{
  "title": "I Was Part of a Search Team For a Missing Child. Something Else Was in Those Woods.",
  "upload_date": "",
  "duration_sec": 5776.0,
  "segments": [],
  "full_text": "The radio's static crackle jolted me awake. I fumbled for it on my nightstand, knocking over a half empty water glass before my fingers closed around the hard plastic. \"Ranger Santos, do you copy? Over.\" The voice belonged to Linda at dispatch. \"I copy,\" I said, my voice still thick with sleep. \"What's the situation?\" \"We've got a missing child report. Seven-year-old boy named Melvin Strickland last seen at Pinewood Overlook around 4:00 this afternoon. Parents lost sight of him when he ran ahead on the trail. Search has been ongoing for two hours with no success. We need all available rangers. Over.\" I was already pulling on my pants before she finished speaking. \"I'm on my way. Has Wagner been notified?\" \"Affirmative. He's meeting you at the main trailhead. Ellis and Salinas are en route as well.\" \"Copy that. ETA, 15 minutes. Over and out.\" I moved through my cabin with practiced efficiency, grabbing my emergency pack from the hook by the door. After 12 years as a ranger at Pinewood National Park, the routine was automatic. I checked my flashlight batteries, grabbed extra water, and made sure my first aid kit was fully stocked. A missing seven-year-old meant we were racing against time and dropping temperatures. The drive to the main trailhead took exactly 12 minutes. I pulled my truck into the small lot where three other ranger vehicles were already parked alongside a county sheriff's car. The flashing lights cast eerie blue and red patterns across the trees. Scott was waiting for me, his face tight with concern. He'd laid out a map on the hood of his truck and was marking search quadrants with a red marker. \"Sawyer,\" he nodded as I approached. \"Parents say the kid was wearing a red jacket and had a matching backpack. Name's Melvin. They lost him near Pinewood Overlook when he ran ahead on the trail.\" \"Any medical conditions? Special needs?\" I asked, scanning the map. \"None. Just an active kid who got too far ahead. Parents said he's familiar with hiking but has never been on this trail before.\" Sheri Ellis jogged over to join us, her dark ponytail bouncing with each step. Beau Salinas was right behind her, adjusting his glasses as he approached. \"We've got four search teams already covering the immediate area around the overlook,\" Sheri said. \"Sheriff's department has volunteers assembling, but they won't be fully deployed for another hour.\" Beau pointed to the map. \"Temperature's dropping faster than normal tonight. Forecast says it'll hit 45 degrees by midnight. Kid's only got a light jacket.\" I studied the terrain. \"We need to push farther out. Scott and I will take the North Ridge Trail. Sheri, you and Beau head south along the creek basin. Those are the two most likely routes if he kept moving after dark.\" \"We'll check in every 15 minutes,\" Scott added, folding the map and tucking it into his pocket. We synchronized our watches and radios before splitting into teams. As Scott and I headed toward the north trail, I caught sight of a couple huddled together near a sheriff's deputy. The woman was clutching a small blue jacket, her eyes red from crying. The man had his arm around her shoulders, his face a mask of barely contained panic. Melvin's parents. I wanted to offer reassurances but knew better than to make promises I couldn't keep. Instead, I gave them a firm nod before turning toward the darkened forest. The North trail started wide, but quickly narrowed as it wound up into denser woods. Scott and I moved at a steady pace, our flashlight beams cutting through the darkness. Something felt off about the forest tonight. The usual chorus of crickets and night birds was absent, leaving an unnatural silence that made the hair on my neck stand up. \"Is it just me or is it colder than it should be?\" Scott asked, zipping his jacket higher. He was right. The temperature had dropped at least 10 degrees since we'd entered the tree line, much colder than normal for early autumn. Our breath formed small clouds in front of our faces. \"Melvin,\" I called out, my voice echoing between the trees. \"Melvin Strickland.\" Scott joined in, and we alternated calls every hundred yards or so. But each time, our voices seemed to be swallowed by the darkness, the echoes dying away too quickly. \"This is weird,\" Scott muttered after about 45 minutes of hiking. Usually we'd have heard something by now, animal movements at least. I nodded, scanning the underbrush with my flashlight. The forest felt wrong tonight, too still, too quiet, too cold, like it was holding its breath. \"Melvin,\" I called again, louder this time. \"If you can hear us, stay where you are. We're coming to find you.\" My voice bounced back at me flat and hollow. We pressed on, checking our position against the map occasionally and marking our route with small reflective tags. After about an hour of searching, something red caught my eye, a flash of color against the dark brown of a tree trunk. \"Scott,\" I said quietly, pointing my light toward it. We moved closer and my stomach tightened. A small red backpack hung from a low branch, snagged as if its owner had been running past. \"That's gotta be his,\" Scott said, reaching for his radio. I carefully removed the backpack from the branch. It was lightweight, the kind parents buy for young children's first hikes. The front pocket was unzipped, suggesting it might have opened during whatever had caused it to snag on the branch.\n\"This is Wagner. We've located a red backpack on the North Trail, approximately two miles in from the trail head. Appears to belong to the missing child. Over.\" While Scott reported our find, I carefully opened the main compartment. Inside was a small toy truck, a half-empty package of animal crackers, and a juice box. No additional clothing or emergency supplies, just the simple treasures of a seven-year-old boy. \"Copy that,\" Scott said into his radio. \"We're continuing the search from this location. Over and out.\" He turned to me. \"Sheri and Bo haven't found anything on the southern route.\" I was already scanning the ground around us with my flashlight, moving in widening circles from where we'd found the backpack. After a few minutes of careful examination, I spotted what I was looking for, a partial footprint in a patch of soft earth. \"Got something,\" I called to Scott, who joined me immediately. The print was small, definitely a child's. I found another a few feet away, then a third. They formed an uneven line leading away from the trail, deeper into the woods. \"He left the trail here,\" I said, pointing along the track. \"And look at the pattern. These aren't casual walking steps. They're spaced irregularly, some deeper than others.\" Scott nodded grimly. \"Kid was running, or at least moving fast.\" \"Scared, maybe,\" I added, feeling a chill that had nothing to do with the dropping temperature. We followed the tracks, moving more cautiously now. The footprints told a concerning story. Melvin had been moving erratically, sometimes zigzagging, sometimes making sharp turns for no apparent reason. It looked like the pattern of someone fleeing from something. \"Melvin,\" I called again. \"Melvin, we're Rangers here to help you.\" My voice seemed to travel only a short distance before fading into nothing. The forest around us had grown darker, the trees closer together, blocking what little moonlight filtered through the canopy. Our flashlight beams seemed dimmer somehow, struggling to penetrate the gloom. \"Anyone else would have turned back by now,\" Scott muttered, more to himself than to me. \"Why would he keep going deeper?\" I had no answer. Children lost in the woods typically did one of two things. They either froze in place too scared to move, or they tried to find their way back, usually ending up moving in circles. Melvin had done neither. He'd plunged straight into the densest part of the forest, away from all trails and landmarks. \"Melvin,\" I tried again, my voice sounding muffled even to my own ears. The woods seemed to press in around us, absorbing our calls, swallowing our flashlight beams. The silence was complete now. No wind in the branches, no rustling leaves, no distant animal sounds. Just our breathing and footsteps, and even those seemed unnaturally quiet. \"I don't like this, Sawyer,\" Scott said, his voice low. \"Something feels wrong about these woods tonight.\" I nodded, unable to shake the same feeling. In 12 years of Ranger work, I'd never felt the forest so unwelcoming. It was as if we were trespassing somewhere we didn't belong, following tracks that led somewhere we shouldn't go. But somewhere ahead was a scared seven-year-old boy alone in the dark, and whatever strange mood had settled over Pinewood tonight, finding Melvin was all that mattered. We pressed forward, following the erratic trail of small footprints, the forest growing darker and more foreboding with each step we took. I found an unfamiliar clearing. This struck me as impossible. I'd worked these woods for 12 years and knew every trail, every landmark, every notable feature within Pinewood National Park's boundaries. Yet here I stood at the edge of a perfectly circular open space that I'd never seen before. My flashlight beam cut through the darkness, sweeping across the ground until it caught something red in the center of the clearing. The beam trembled in my hand as I adjusted it. A small body lay motionless on the forest floor, Melvin Strickland. \"I found him,\" I shouted, my voice sounding strange and muffled in the unnatural silence. \"Wagner, I found the boy.\" No response came. Scott must have fallen behind as we followed the erratic trail of footprints. I didn't wait. I ran forward, boots pounding against the soft earth, my breath coming in quick clouds of vapor in the unnaturally cold air. As I got closer, my flashlight revealed dark liquid surrounding the boy's small form. It looked like blood, too much blood, pooled around him on the ground. \"Melvin?\" I called, dropping to my knees beside him. His face was pale, eyes closed. The red jacket his parents had described was torn at the shoulder. I pressed my fingers against his neck, searching for a pulse, finding nothing. No rise and fall of his chest. No flutter of a heartbeat beneath my fingertips. \"No, no, no,\" I muttered, tilting his head back to check his airway. Nothing blocked it. I leaned down, putting my ear near his mouth. No breath. No signs of life. I reached for my radio clipped to my shoulder. \"This is Ranger Santos. I've located Melvin Strickland. He's unresponsive. No pulse, no breathing. I need medical, immediate medical assistance.\" I rattled off what I believed was our approximate location based on the trail we'd followed.... the radio crackled with static. No voice came through to acknowledge. I tried again, \"Dispatch, do you copy? This is an emergency.\" More static. Just as I was about to try a third time, I noticed something that made me forget the radio entirely. A soft light emanated from between Melvin's parted lips. Not reflected light from my flashlight. This was something else entirely. A gentle bluish glow pulsed from inside him, visible through his slightly open mouth. I blinked hard, certain I was seeing things. The glow remained. It pulsed rhythmically like a heartbeat, growing steadily brighter with each pulse. \"What the hell?\" I whispered. Leaning closer despite every instinct telling me to back away. The light intensified, becoming almost too bright to look at directly. I finally listened to my instincts and tried to stand up to move away from whatever this was. I couldn't. Some invisible force held me in place, then began pulling me toward the light. My body felt heavy like I was moving through thick mud. I tried to plant my feet to resist whatever was happening, but the force grew stronger. \"Wagner,\" I shouted. My voice sounding distant even to my own ears. \"Scott, something's wrong.\" The light expanded outward from Melvin's mouth, enveloping first his face, then his entire body. It reached toward me in tendrils that wrapped around my arms, my chest, my neck. Not burning, not painful, but insistent, pulling, tugging, drawing me in. My consciousness began to separate from my body. I felt it happening with perfect clarity like stepping out of a wetsuit, peeling away from my physical form. The sensation wasn't painful, just profoundly wrong. The trees, the clearing, Melvin's body, everything around me dissolved into darkness. My flashlight, my radio, my physical body, all gone. I floated in nothingness, suspended in a void without up or down, without light or dark, without any physical reference point. Then came the voices. At first, they were distant whispers, indistinct and overlapping. They grew louder, clearer. Surrounding me from all sides in this dimensionless space. Dozens then hundreds of voices calling out, \"Help me. I'm lost. Please find me. Don't leave me here.\" The voices became a cacophony, each one distinct yet blending with the others in a disorienting chorus of pleas. And then, cutting through them all, I heard a voice I recognized instantly, \"Sawyer, son, is that you?\" My father's voice. Cameron Santos had died three years ago from a heart attack while chopping wood behind his cabin, yet his voice came through with perfect clarity as real as if he stood beside me. \"Dad,\" I called into the void. \"Dad, where are you?\" \"I'm lost, son. I need you to find me. I've been waiting for you.\" Before I could respond, another familiar voice joined his. \"Sawyer, honey, please help me.\" My mother, Kelsey. Cancer had taken her five years before my father passed. Her voice sounded exactly as I remembered. Gentle, but with that underlying strength she'd maintained even in her final days. \"Mom? Mom, I can't see you.\" \"Follow my voice, sweetheart. I've been so alone here.\" Their voices pulled at me from different directions, making it impossible to move toward both at once. I tried to turn, to look around, but there was nothing to see in the void, only darkness and the disembodied voices. Then came another voice that chilled me to my core. \"Sawyer, help me! Something's got me!\" Scott Wagner's voice filled with terror, called from somewhere in the darkness. \"Scott,\" I shouted. \"Scott, where are you? What's happening?\" \"I can't get out. It won't let me go. Find me, please.\" This made no sense. Scott wasn't dead. He'd been right behind me on the trail, yet his voice sounded as real as my parents', filled with the same desperate need. And then, cutting through all the others, came a small, frightened voice. \"Mr. Ranger, I'm scared. I'm really scared.\" Melvin Strickland. \"It's dark here. I want my mom and dad. Please help me find my mom and dad.\" The boy's voice broke into sobs that tore at something deep inside me. I tried to move toward the sound, but in this place without direction or dimension, I had no way to navigate. \"Melvin, I'm coming. Keep talking so I can find you.\" The voices grew louder, more insistent. Not just the four I recognized, but all of them. Hundreds calling out at once, begging for help, for rescue, for release. They pulled at me from all directions, like hooks embedded in my consciousness, threatening to tear me apart. \"Find me. Save me. Don't leave me here.\" \"Please, I've been waiting so long.\" My father's voice again, \"Son, stay with me. I need you here.\" My mother, \"Sawyer, please don't go.\" Scott, \"Don't leave me in this place.\" Melvin, \"I'm so scared. Please help me, Mr. Ranger.\" The pull became unbearable, stretching me in countless directions at once. The voices grew louder until they were screaming, demanding, pleading. A deafening chorus of need that overwhelmed everything else. I couldn't move toward one without abandoning the others.I couldn't help them all. I couldn't even help myself as the voices continued to pull, to tear, to rip at whatever remained of me in this impossible void. I fought against the voices in the void. They pulled at me from every direction, hooks of sound and memory tearing into what remained of my consciousness. My parents' voices called the loudest. Mom's soft pleading, Dad's insistent demands. Scott's terrified cries cut through everything else. And Melvin... God, that little boy sounded so scared. \"Help us, Sawyer,\" my mother begged. Her voice exactly as I remembered from before the cancer took her. \"I've been so alone.\" \"Son, you found me,\" my father said, his voice strong and vital, not weak like in his final days. \"I've been waiting for you.\" Every instinct told me to go to them, to follow their voices deeper into this impossible darkness. I wanted to. Part of me ached to surrender, to let the voices guide me wherever they wanted, to help them, to join them. But something deep inside me resisted, some fundamental survival instinct locked my will in place like an anchor. This wasn't right. This wasn't natural. Whatever this place was, I didn't belong here. \"Scott needs your help,\" my father's voice insisted, growing harder, less like him. \"The boy needs you.\" \"I'm scared,\" Melvin's voice called, small and fragile. \"Please don't leave me alone in the dark.\" I tried to speak, to call back to them, but had no voice here, no body. No substance. Just awareness stretched thin across an impossible void filled with desperate pleas. The voices multiplied, hundreds of them now layered over each other in a deafening chorus of need. They spoke of being lost, trapped, forgotten. They begged for rescue, for release, for someone to find them. I couldn't save them all. I couldn't save any of them, not from here. Not like this. No, I thought, focusing all my will into resistance. This isn't real. This isn't right. The moment I pushed back, something changed. The voices grew angry, insistent. The pulling sensation intensified, threatening to tear me apart. \"Don't leave us.\" My mother's voice hardened, becoming something that didn't sound like her at all. \"You can't abandon us again.\" \"Coward,\" my father's voice accused, twisting into something cruel and unfamiliar. Scott's voice remained terrified, but now seemed further away. \"Sawyer, don't let it take me.\" I focused on Scott's voice, real, present, alive. My partner was out there somewhere. If I surrendered to this place, I'd never find him, never help him, never get back. Suddenly, a different force yanked me backward through the darkness. It felt like being pulled through thick water against a powerful current. The sensation was violent, disorienting. My consciousness dragged away from the voices at impossible speed. The voices faded, growing distant and distorted. My parents' voices disappeared first, melting back into the general cacophony. Then Melvin's frightened calls faded too. Scott's voice followed me the longest, his cries for help trailing after me through the void until even they disappeared, swallowed by distance and darkness. The pulling grew stronger, more insistent. My awareness stretched painfully thin, then snapped back like a rubber band reaching its limit. I slammed back into my physical body with jarring violence. The impact knocked the air from my lungs, or would have if I'd been breathing. Pain erupted everywhere at once, nerves firing in confused panic as my consciousness reconnected with flesh. My chest hurt worst of all, sharp rhythmic pain that crushed down on my sternum in regular intervals. I opened my eyes with a desperate gasp. Scott knelt over me, hands locked together on my chest, performing CPR. His face was streaked with sweat, his expression a mask of panic and exhaustion. He looked like he'd been at it a while. \"Sawyer?\" His eyes widened in shock when he saw me looking at him. \"Jesus Christ.\" He fell back on his heels, breathing hard, staring at me like he'd seen a ghost. Maybe he had. I tried to speak but could only cough, my throat raw and dry. My chest felt like someone had been jumping on it. Someone had... \"Easy,\" Scott said, his voice shaking with relief. \"Just breathe, just breathe.\" I followed his advice, focusing on pulling air into my lungs. Each breath hurt, but the pain meant I was alive, back in my body, back in the world. After a minute, I managed to croak out, \"Melvin?\" Scott's expression shifted to confusion. \"What about him? Did you see something?\" I pushed myself up on one elbow, looking around the clearing. There was no sign of Melvin's body, no blood-soaked ground. Nothing but undisturbed forest floor where I'd seen the boy's lifeless form. \"He was right here,\" I said, my voice rough. \"Right here in the clearing, he was dead, Scott.\" Scott shook his head. \"There's been no sign of him, Sawyer. I found you alone out here about 30 minutes ago. You were just lying here, not breathing. No pulse.\"I sat up slowly, every muscle in my body protesting the movement. I felt like I'd been physically beaten, run over, wrung out. Scott put a hand on my shoulder to steady me. \"What happened?\" He asked. \"You were ahead of me on the trail, then you just disappeared. I called for you, but you didn't answer. Took me 15 minutes to find this clearing.\" I looked around again, trying to reconcile what I was seeing with what I remembered. The clearing looked the same, that perfect circle of open space that shouldn't exist in these woods. But no body, no blood, no evidence of what I'd witnessed. \"I found Melvin,\" I said, the memory vivid and undeniable. \"He was right here in the middle of the clearing. He wasn't breathing. There was blood all around him. I tried to radio for help.\" Scott's face creased with worry. \"Your radio's still on your belt, Sawyer. You never called anything in.\" I reached down, feeling the solid weight of the radio still clipped to my belt. I remember trying to use it, getting nothing but static. \"This doesn't make sense,\" I muttered. \"None of it makes sense,\" Scott agreed. He stood up and offered me his hand. \"Can you stand? We need to get you checked out.\" I took his hand and let him pull me to my feet. The world swayed alarmingly for a moment before steadying. My legs felt weak, disconnected, but they held my weight. \"There's something else,\" Scott said, his voice hesitant. \"Something really weird.\" I looked at him, waiting. \"When I first spotted you through the trees, you were still moving,\" he said. \"Walking through the forest. But when I caught up to you here, you were down. Not breathing, no pulse. I started CPR right away, but... Sawyer, how were you walking if you weren't breathing?\" I stared at him, trying to process what he was saying. \"What do you mean walking? I was in the clearing with Melvin, then I was... somewhere else.\" Scott shook his head. \"I saw you moving through the trees, following some path only you could see. You were wandering in this weird trance-like state. I called your name, but you didn't respond. By the time I caught up, you were here, on the ground.\" \"That's impossible,\" I said, but even as the words left my mouth, I knew we were far beyond what was possible or impossible. \"I was... gone. My body was here, but I wasn't in it.\" \"Gone where?\" Scott asked. I didn't know how to explain the void, the voices, the feeling of being torn apart by hundreds of desperate pleas for help. How could I tell him I'd heard his voice there too, begging me not to abandon him? \"I don't know,\" I said instead. \"But we need to find Melvin.\" I froze in place, unable to process Scott's words. My muscles locked up as if I'd been hit with a stun gun. We stood at the edge of the clearing, the same one where I'd found Melvin's body, where I'd seen the light coming from his mouth and felt myself pulled into that terrible void. \"What do you mean? I guided the search teams,\" I finally managed to ask. Scott ran his hand through his hair, his eyes never quite meeting mine. \"After I got you breathing again, you just stood up. I was still trying to radio for help, but you started walking. I called your name, but you didn't respond. You just kept moving with this weird... purpose.\" \"That's impossible. I was unconscious.\" \"Your eyes were open the whole time, Sawyer. Wide open, but...\" Scott paused, visibly uncomfortable. \"It was like nobody was home. You didn't blink, didn't respond to anything I said. You just started walking, and I followed you.\" A cold feeling spread through my chest that had nothing to do with the night air. \"I have no memory of this.\" \"You led us straight out of this section of the forest, walking faster than I could keep up sometimes. You never stumbled, never hesitated, even in the dark. When we hit the main trail, you turned south without a second's pause.\" I shook my head. \"The South Trail, that's where Sherry and Bo were searching.\" \"Yeah. I radioed ahead to tell them we were coming. By then, the other search teams had joined up with them. Everyone was confused why you were heading that way with such conviction.\" Scott looked down at his boots. \"You walked right past everyone like they weren't even there. Nobody knew what to do except follow you.\" My throat felt dry. \"And Melvin? You said we found him?\" Scott nodded. \"About a quarter mile down the South Trail, you suddenly stopped walking. You just stood there, pointing toward a little stream that runs alongside the path. And there he was, Melvin, just sitting there, playing with some rocks like he hadn't been missing for hours.\" I tried to make sense of this. The image of Melvin's body in the clearing remained vivid in my mind. The torn red jacket, the dark liquid surrounding him, the blue light pulsing from his mouth. \"Was he hurt? His jacket... I saw blood.\" Scott frowned. \"No blood, Sawyer. Kid was completely fine. His clothes weren't even dirty, which was the weird part. He'd been missing for hours in these woods, but he looked like he'd just stepped outside to play.\" \"That's not possible,\" I insisted. \"I saw him. He was...\" I couldn't bring myself to say dead out loud. It felt too final, too contradictory to what Scott was telling me.\"After we found him, you just collapsed, dropped like someone cut your strings. You were conscious but completely out of it. We had to help you back to the trailhead.\" I tried to recall any of this, walking through the forest, finding Melvin collapsing afterward, but there was nothing. My last memory was being in that void, hearing the voices pulling at me from all directions, and then suddenly waking up with Scott performing CPR on my chest. \"What did Melvin say about being lost?\" I asked. Scott's expression grew more troubled. \"That's another strange thing. He said he wasn't lost at all. Said he followed a friendly voice that promised to take him back to his parents.\" \"A voice?\" The hairs on my arm stood up. \"What voice?\" \"He couldn't really explain, just said it was nice and made him feel safe.\" Scott hesitated. \"Sawyer, we should head back. The others are waiting at the trailhead with Melvin and his parents. They'll want to thank you.\" Thank me. The thought made me sick. Something had used my body while I was trapped in that void. Something had controlled me, moved me, used me to find Melvin, or to bring back whatever was now pretending to be Melvin. \"I need a minute,\" I said, leaning against a tree for support. \"Take your time, but we should get going soon. It's been a long night for everyone.\" I nodded, not trusting myself to speak. After a few deep breaths, I pushed myself away from the tree. \"Let's go.\" We walked back to the trailhead in silence. My mind raced with questions I couldn't answer, theories I couldn't prove. I kept glancing at Scott, wondering if he believed what he'd seen or if he was trying to rationalize it all away. The parking lot came into view, illuminated by the flashing lights of emergency vehicles. A small crowd had gathered, the search teams, park staff, medical personnel, and in the center, a family huddled together. As we approached, I spotted Melvin immediately. He stood between two adults, his parents I assumed, looking completely unharmed. His red jacket was intact, not torn as I had seen it. There was no blood, no sign of injury or trauma. He was smiling, pointing at something in the distance while his mother knelt beside him, her arm wrapped protectively around his shoulders. Sherry noticed us first and waved us over. \"There he is, our hero of the hour.\" I flinched at the word 'hero.' I wasn't a hero. I wasn't even sure I had been present for the rescue. Bo approached, clipboard in hand. \"Santos, remarkable work tonight. I've never seen tracking like that, especially in these conditions.\" Before I could respond, Melvin's parents rushed toward me. The father, Dominic, according to the information we'd received at the start of the search, reached me first, grabbing my hand and shaking it vigorously. \"Ranger Santos, we can't thank you enough,\" he said, his voice cracking with emotion. \"When they told us you found him just sitting there playing...\" He trailed off, overcome. The mother, Cassie, was right behind him, tears streaming down her face. \"Thank you, thank you,\" she repeated clutching my arm. \"Our boy is safe because of you.\" I mumbled something appropriate, some standard ranger response about just doing my job, but my attention was fixed on Melvin. The boy was watching me with curious eyes, no fear, no trauma, no recognition of what had happened between us in that clearing. \"Melvin,\" I said, kneeling down to his level. \"How are you feeling?\" He smiled, a normal childlike smile. \"I'm okay. I wasn't scared.\" \"You weren't?\" He shook his head. \"The voice said I'd be safe.\" \"What voice was that, Melvin?\" I asked carefully. \"The nice one. It said to follow and I'd find my way back.\" He shrugged the way children do when they can't quite explain something but don't find it particularly troubling. \"Did you see who was talking to you?\" Melvin thought for a moment, then shook his head. \"No, but it was nice.\" Cassie stroked her son's hair. \"We've told him not to wander off or follow strangers. I don't know what he was thinking.\" \"It wasn't a stranger,\" Melvin protested. \"It was a friend.\" I studied him carefully. His clothes were clean, impossibly clean for a child who had spent hours lost in the woods. His red jacket showed no signs of the tears I had seen. His face was calm with no indication he had experienced anything traumatic. This was not the same body I had found in the clearing. \"Well, we're just glad you're safe now,\" I said, standing up. The sheriff approached, nodding respectfully. \"Good work, Santos. We'll need your report by tomorrow, but for now, I think everyone deserves some rest. The Stricklands are free to take their boy home.\" Dominic put his hand on my shoulder. \"We owe you everything. If there's ever anything we can do...\" \"Just keep him close,\" I said, the words coming out more intensely than I intended. He nodded solemnly, misinterpreting my concern as professional caution rather than the deep unease I actually felt. As the family walked toward their car, I watched Melvin. He turned back once, looking directly at me with an expression I couldn't read. Not quite a smile, not quite recognition, but something else, something that made my skin crawl.... Scott appeared at my side. \"You okay? You look like you've seen a ghost.\" \"I'm not sure what I've seen,\" I admitted. The image of Melvin's lifeless body in the clearing flashed in my mind again, the torn jacket, the dark liquid, the blue light. It had been real, I was certain of it. But here was Melvin, alive and unharmed, with no memory of being in that clearing, no memory of being whatever he had been when I found him. The contradiction was impossible to reconcile. Either I had hallucinated everything in the clearing, the body, the void, the voices, or something much stranger had happened, something I couldn't begin to explain. I watched the Stricklands drive away, their headlights cutting through the darkness as they headed home with their son, or with whatever had taken his place. I questioned Scott as we drove back to headquarters, the headlights cutting through the darkness of the forest road. My body ached from the CPR compressions, and my mind couldn't stop replaying what I'd experienced in that void, especially Melvin's terrified voice begging for help. \"Tell me exactly what happened again,\" I said, watching the trees flash by outside the passenger window, \"when you found me walking.\" Scott kept his eyes on the winding road, his knuckles white against the steering wheel. \"I already told you.\" \"I need more details, everything you can remember.\" He sighed, adjusting his grip. \"After I got you breathing again, you just stood up. Your eyes were open, but you weren't responding to anything I said.\" \"And then?\" \"You started walking. Not stumbling or hesitating, moving with purpose, like you knew exactly where you were going.\" I tried to imagine myself doing this, but the memory simply wasn't there, just a blank space where those minutes should've been. \"What was wrong with my eyes?\" I asked, remembering his earlier comment. Scott glanced at me briefly before looking back at the road. \"They were open but empty, vacant, like no one was looking out from behind them.\" He shook his head. \"It was the creepiest thing I've ever seen, Sawyer. It wasn't you in there.\" A chill ran through me. \"How did I navigate in the dark?\" \"That's the thing that really got to me,\" Scott said, slowing as we approached a curve. \"You moved through that forest like you had night vision. No flashlight, no hesitation. You went over fallen logs, around thickets, stuff I could barely see with my light. You never tripped, never stumbled. Not once.\" \"That's impossible,\" I said. \"Yeah, well, I watched it happen. You were moving faster than I could keep up. I had to jog to stay with you.\" I tried to process this information. Whatever had taken control of my body had navigated the forest with an efficiency that defied explanation. \"And when we got to the trail, you turned south without pausing. Other search teams were calling out to you, but you walked right past them. Didn't acknowledge anyone. Just kept moving until you reached that spot by the stream and pointed.\" \"And Melvin was just sitting there, playing with rocks?\" Scott nodded. \"Like he hadn't been lost for hours. Clean clothes, not a scratch on him.\" I stared out at the dark forest beyond the headlights. Melvin's voice echoed in my mind. \"Help me, please. Help me find my parents. I'm scared.\" The desperation in that child's voice had been real, and now I couldn't shake the feeling that the real Melvin was still trapped in that darkness while something else had come back in his place. \"You okay?\" Scott asked as we pulled into the headquarters parking lot. \"No,\" I answered honestly. \"I'm not.\" The station was quiet when we entered, most of the search teams having already departed. The adrenaline of the rescue had worn off, leaving me exhausted but unable to relax. I sat down at my desk and pulled out the incident report form. \"You want some coffee?\" Scott asked, hovering nearby. \"Thanks,\" I said, not looking up from the form. As I stared at the blank report, I realized I had a choice to make. I could document everything, the void, the voices, finding Melvin's dead body, or I could stick to the facts everyone else had witnessed, the successful outcome, the happy ending. I started writing, deliberately focusing on the objective elements, time of the initial call, search parameters, weather conditions, discovery of the backpack. When I reached the part about finding Melvin, I hesitated. Then I wrote, 'Ranger Wagner and I tracked footprints leading off-trail. After continuing the search, we located the missing child approximately two miles from the trailhead. Subject was uninjured and in good condition. Subject was safely returned to parents at 23:45.' Nothing about the clearing. Nothing about the void. Nothing about the light coming from Melvin's mouth or the voices pulling at my consciousness. Nothing about my apparent possession. Scott returned with two cups of coffee, setting one beside me. \"Thanks,\" I said, taking a sip of the bitter liquid. \"What are you putting in the report?\" he asked cautiously. \"Just the facts,\" I replied. \"That we found him and brought him back safely.\" Scott nodded, understanding what I was leaving out. Probably smart.I continued filling out the form, but my pen kept pausing over the paper. The image of Melvin standing between his parents kept flashing in my mind, alongside the memory of his lifeless body in that clearing. Two contradictory realities that couldn't both be true, and yet I'd experienced both. \"Scott,\" I said, setting down my pen. \"Do you think that was really Melvin we brought back?\" He looked uncomfortable with the question. \"What do you mean?\" \"I mean, what if something else came back? Something that just looks like him.\" Scott took a long drink of his coffee before answering. \"I don't know what to think anymore. But his parents recognized him. They didn't seem to notice anything wrong.\" \"Would they though,\" I countered, \"if it looked exactly like him, acted like him?\" \"You're talking about what? Something supernatural? A doppelganger?\" I shook my head. \"I don't know what I'm talking about. I just can't shake this feeling that something's not right, that something essential got left behind in that place.\" Scott didn't have an answer for that. We sat in silence as I finished the report, signing my name at the bottom with a sense of unease. The official record now documented a straightforward rescue with a happy ending. Nothing about what I'd actually experienced would ever appear in the park's files. I leaned back in my chair, rubbing my eyes. \"What took control of my body, Scott? How did I know exactly where to find him?\" \"Maybe it was just some kind of instinct,\" he suggested, but his tone made it clear he didn't believe that explanation any more than I did. \"And what about the clearing? I found his body there. I saw the blood. I saw the light coming from his mouth. That was real to me.\" Scott looked down at his coffee. \"I don't have answers for you, Sawyer.\" I stood up and walked to the window, looking out at the dark forest beyond. Somewhere in those trees was the clearing where everything had changed. Somewhere in that darkness was the boundary between our world and whatever that void had been. A place filled with lost souls crying out for rescue. \"I keep hearing his voice,\" I admitted quietly, \"begging for help. What if the real Melvin is still trapped in there, Scott? What if we left him behind?\" Scott joined me at the window. \"You need some rest. It's been a hell of a night.\" I nodded, but I knew sleep wouldn't come easily, not with these questions haunting me, not with the memory of those voices still echoing in my mind, not with the persistent unsettling feeling that something remained unresolved, that a door had been opened between worlds that shouldn't have been breached. I gathered my things and followed Scott out to the parking lot. The night air was cool against my face, the stars bright overhead. Everything looked normal, but nothing felt normal anymore. As I climbed into my truck, I couldn't escape the feeling that I'd returned from that void changed in some fundamental way, that I'd glimpsed something humans weren't meant to see. And worst of all was the nagging certainty that whatever had happened in those woods wasn't over. I'd been back on duty for three weeks, but everything felt wrong. The trees stood in the same places, the trails followed the same paths, and the mountains rose against the same sky, but the forest had changed, or maybe I had. \"You with us, Sawyer?\" Scott asked, nudging my shoulder as we walked along the Eastern Perimeter Trail. \"Yeah, just thinking.\" Scott had been watching me like I might break since the night we found Melvin. I couldn't blame him. My behavior had been erratic. Zoning out during briefings, jumping at sounds only I seem to hear, and spending too much time staring at the tree line where that clearing waited. \"You know,\" Scott said, \"nobody would think less of you if you took some time off.\" I shook my head. \"I'm fine.\" But I wasn't fine. The voices followed me everywhere. They'd start as whispers at the edge of my hearing. My parents calling my name, Melvin asking for help, and others I couldn't identify. Sometimes they grew so loud I had to stop whatever I was doing and press my hands against my ears, which only made my colleagues exchange more worried glances. Back at the station that afternoon, I locked myself in the records room. If what happened to me had happened before, there would be evidence. Rangers kept detailed logs of every search and rescue operation going back decades. I started with the most recent cases and worked backward. Most were straightforward. Lost hikers found dehydrated but alive, injured climbers carried out on stretchers, children who wandered from campsites. Normal rescues with normal paperwork. But three cases stood out. The first was from 1998. A 10-year-old boy named Tyler Simmons disappeared during a family camping trip. Ranger Marcus Dawson reported finding the boy unharmed two miles from his campsite after an eight-hour search. The report was sparse on details, but a handwritten note in the margin caught my eye. \"Dawson unable to account for approximately 45 minutes during search. Medical evaluation recommended.\" Dawson retired six months later. The second case occurred in 1982. 6-year-old Eliza Bennett vanished while hiking with her father. Ranger Harold Jenkins found her alive after a 12-hour search. Jenkin's report mentioned unexplained environmental anomalies and temporary disorientation.... the park superintendent had added a note. \"Jenkins' account contains inconsistencies. Psychological assessment pending.\" Jenkins stayed on with the Park Service, but transferred to a different park the following year. The third case was from 1975. Eight-year-old Michael Torres disappeared from a picnic area. Ranger Alan Cooper located him after a two-day search. Cooper's report was rambling and disjointed, describing impossible weather conditions and voices in the darkness. Cooper took medical leave immediately after and never returned to service. I sat back in my chair, my heart pounding. Three cases spanning 50 years, all following the same pattern. Missing children found under strange circumstances by rangers who subsequently experienced psychological issues, and now me. I needed to talk to someone who understood. Marcus Dawson had died five years ago according to an obituary I found online. Alan Cooper's whereabouts were unknown, but Harold Jenkins was still alive. I found his address in the personnel records. He lived just outside the park boundaries in Riverdale. I called the number listed in his file the next morning. \"Hello?\" The voice on the other end was cautious, guarded. \"Mr. Jenkins? My name is Sawyer Santos. I'm a ranger at Pinewood National Park.\" A long pause. \"What do you want?\" \"I'd like to talk to you about Eliza Bennett, the girl you found in 1982.\" The line went silent for so long, I thought he'd hung up. \"Meet me at Donna's Diner off Highway 22 at noon tomorrow,\" he finally said. \"Come alone.\" He hung up before I could respond. The next day, I drove 40 minutes to reach the small roadside diner. It was a typical truck stop. Vinyl booths, laminated menus, and the smell of coffee and grease hanging in the air. I spotted him immediately. Harold Jenkins sat in the farthest booth, his back to the wall, eyes on the door. He was in his 70s now, thin with a weathered face and white hair cut short. His hands fidgeted with a paper napkin, tearing it into tiny pieces. \"Mr. Jenkins?\" I approached his table. \"I'm Sawyer Santos.\" He nodded to the seat across from him. \"Sit down. And call me Harold.\" I slid into the booth. A waitress came by and we both ordered coffee. Harold watched me with wary eyes, saying nothing until she walked away. \"You look like hell,\" he finally said. I hadn't been sleeping well. The voices were loudest at night. \"Why did you want to talk about Eliza?\" he asked, his voice low. \"Something happened to me a few weeks ago. Something I can't explain.\" I leaned forward. \"I found a missing boy named Melvin Strickland.\" Harold's expression didn't change, but his hands went still. \"And?\" \"I found him dead first. Then I didn't. Then I led search teams right to him while I was not myself.\" I watched his face carefully. \"And now I hear voices all the time.\" Harold closed his eyes briefly. When he opened them, they were filled with a mixture of fear and resignation. \"I was hoping I was the only one,\" he said quietly. The waitress returned with our coffees. Harold waited until she was out of earshot before continuing. \"I found Eliza's body in a clearing that shouldn't have been there,\" he said. \"She was lying face up, not breathing. No pulse. There was this light coming from her mouth. Blue. Pulsing. It pulled me in somehow.\" My hands tightened around my coffee cup. \"Into a void? With voices?\" Harold nodded. \"Hundreds of them, begging for help. My wife, she had died the year before. Her voice was the loudest, calling to me, saying she needed me.\" He took a shaky breath. \"Next thing I knew, I was standing with Eliza, alive and unharmed, surrounded by the search team. They said I'd walked right to her, but I had no memory of it.\" \"That's exactly what happened to me,\" I said. \"Exactly.\" \"But the boy I found, I don't think it's really him that came back.\" Harold's eyes narrowed. \"What makes you say that?\" \"Just a feeling. Something's off about him, like he's wearing Melvin like a costume.\" Harold looked down at the shredded napkin. \"I never saw Eliza again after that night. Her family moved away. But I've often wondered...\" He trailed off. \"What happened to you afterward?\" I asked. \"The voices never stopped,\" he said simply. \"They started invading my dreams. Every night, I'd hear my wife calling for me from that darkness. Eliza too. Others I didn't know. They wanted me to come back, to help them. I nearly went crazy with it.\" \"Did they ever go away?\" Harold gave a bitter laugh. \"I'm 74 years old and I still sleep with the TV on to drown them out. What do you think?\" I felt sick. \"So there's nothing I can do?\" \"I transferred parks. It helped a little, being away from where it happened. But they followed me.\" He leaned forward suddenly, grabbing my wrist with surprising strength. \"Listen to me. Whatever's in those woods, it's been there a long time. It collects people somehow. Keeps parts of them. And it uses the rangers to bring back, uh, something else.\"\"What is it?\" I asked. \"I don't know. I've spent 40 years trying to figure that out.\" He released my wrist. \"But I know this, what you found in those woods wasn't just the boy, and what brought him back wasn't just you.\" We sat in silence for a while. The diner's ambient noise, clinking silverware, murmured conversations, the hiss of the grill, creating a bubble of normalcy around our impossible discussion. \"You said the voices get into your dreams,\" I said finally. Harold nodded. \"That's when they're strongest, when your guard is down. They'll use anything to reach you, memories, guilt, love. My wife,\" his voice cracked. \"She sounds so real. Sometimes I almost go to her.\" \"Go to her? How?\" \"Back to the woods, back to that place.\" He looked at me with haunted eyes. \"There were times I almost did it. Drove back to the park in the middle of the night ready to find that clearing again, to let the light take me back to her.\" \"Why didn't you?\" \"Because deep down, I knew it wasn't really her calling. It was using her voice, her memory.\" Harold's hands trembled as he lifted his coffee cup. \"Whatever's out there, it wants more of us, and it's patient.\" I thought of the three cases I'd found. \"It only happens every 15 or 20 years.\" \"That we know of,\" Harold corrected. \"How many people go missing in national parks and are never found? How many rangers quit after traumatic incidents that never make it into official reports?\" He had a point. The forest kept its secrets well. \"What happened to the other rangers?\" I asked. \"Cooper and Dawson?\" \"Cooper killed himself three years after finding that Torres boy, gunshot to the head.\" Harold said it flatly. \"Dawson lasted longer, drank himself to death slowly instead. I kept track of them even though we never spoke about what happened. We didn't have to. I recognized the look in their eyes, the same one I see in yours now.\" The waitress came by to refill our cups. Harold waited again until she left. \"The voices will get worse,\" he said. \"Especially at night. They'll say things only the real people would know. They'll beg. They'll accuse you of abandoning them. They'll make promises.\" He looked down at his gnarled hands. \"The hardest are the children. They sound so scared.\" I thought of Melvin's voice in the void, small and frightened. \"Have you ever tried to go back to help them?\" Harold's face hardened. \"That's what it wants. Don't you see? It's a trap. Whatever's in there, it wants more of us, more... I don't know, souls, consciousness, whatever you want to call it.\" He leaned forward again. \"Promise me you won't go looking for that clearing again. Promise me.\" I couldn't make that promise, not when I still heard Melvin's real voice calling for help every night, not when I was increasingly convinced that whatever walked out of those woods with me wasn't really him. Harold must've read my thoughts in my expression. \"You're going to try, aren't you, to go back?\" \"I don't know,\" I said honestly. \"Then you'll end up like Cooper or like me, old and broken, haunted by voices that never stop.\" Harold pushed his coffee cup away. \"I should've warned you not to tell me your story. Now your voice will probably join the others in my head.\" \"I'm sorry,\" I said. \"No, you're not. Not yet.\" Harold stood up slowly, his joints cracking with the movement. \"But you will be.\" He tossed a few dollars on the table for his coffee. \"One last piece of advice, Ranger Santos. If you start dreaming about that clearing, about going back there, tell someone. Have them stop you because once those voices get a real foothold in your mind, you'll do anything to make them stop. Anything.\" I watched him shuffle toward the exit, an old man bent by the weight of a 40-year-old burden. Just before he pushed through the door, he turned back to look at me one last time. His eyes filled with a mixture of pity and fear. \"They never let you go,\" he said. \"Not really.\" Then he was gone, leaving me alone with my cooling coffee and the whispers that never quite faded from the edges of my hearing. I started dreaming about the void. It wasn't just voices at the edge of my hearing anymore. They had found a way in deeper, just like Harold Jenkins had warned me they would. The first night it happened, I jolted awake around 3:00 in the morning. My sheets soaked through with sweat. In the dream, I had been back in that dimensionless darkness, but this time, Melvin's voice had been clearer than all the others. \"Ranger Sawyer, please help me. I can't find my way out.\" The boy's voice had echoed through my mind with such clarity that I thrown myself upright, certain he was standing in my bedroom, but there was nothing, just the faint moonlight filtering through my blinds and the sound of my own ragged breathing. I grabbed the glass of water from my nightstand, my hand shaking so badly that I spilled some on the blanket. After drinking half of it, I set it down and wiped my face with my palms. The memory of Scott's voice from the dream lingered too. \"Sawyer, don't leave me here. Something's got me. It won't let go.\"I got up and paced around my cabin, turning on lights as I went. Sleep wasn't coming back tonight. I made coffee even though it was hours before dawn and sat at my kitchen table, flipping through the notes I'd taken after meeting with Harold. The pattern was clear. The voices would get worse, not better. They would push into my dreams when my defenses were down. The next night was the same, except this time I heard my parents too. My mom's soft voice begging me to find her, my dad's stronger tone turning accusatory when I tried to pull away. I woke up shouting, my throat raw. By the fifth night, I was afraid to go to sleep. I'd started keeping the TV on, just like Harold said he did, but it only helped a little. The voices would find ways to weave themselves between the dialogue of late night talk shows or blend with commercials until I couldn't tell what was real and what wasn't. After a week of this, I knew I had to do something. The thing that had come back with Melvin's face, the thing pretending to be him, was out there living his life while the real Melvin was still trapped. I felt it with a certainty that went beyond logic or evidence. I knew it the way you know your own name. I started watching the Strickland house. The first time was innocent enough. I drove past their neighborhood on my way to the grocery store. Their house was a modest two-story with blue siding on a quiet street with big maple trees. I slowed down as I passed, catching a glimpse of Dominic mowing the lawn while Cassie sat on the porch steps. Of Melvin, there was no sign. Two days later, I parked down the block and watched the house for nearly an hour. I told myself I was just being thorough, making sure everything was okay after the traumatic event. Rangers sometimes did welfare checks on people who'd been through ordeals in the park, but I knew this was different. I was looking for proof that the boy who came back wasn't Melvin. I started finding reasons to drive by the Strickland house every day. I learned their routines. Dominic left for work at 7:30 each morning. Cassie walked Melvin to the bus stop at the corner at 8:15. The school bus came at 8:22. Melvin returned home at 3:45. On my day off, I followed them to the local playground. I sat in my truck across the street, watching as Cassie sat on a bench with her phone while Melvin played on the swings. From a distance, he looked like any normal seven-year-old. He laughed when he swung high. He ran around with other kids. But there were moments, brief flashes, when something seemed off. I noticed it first when a dog walked by with its owner. Melvin stopped everything he was doing and stared at the animal with such intensity that the dog began to whine and pull at its leash. The owner hurried away, throwing concerned glances back at Melvin, who continued to watch the dog until it disappeared around a corner. His face hadn't shown excitement or interest. There had been no smile, no attempt to pet the animal. Just that unwavering predatory focus that looked wrong on a child's face. A few minutes later, I watched him talking to another boy near the slide. I couldn't hear what they were saying from my position, but the other child's reaction told me enough. The boy backed away from Melvin with a confused expression, then ran to his mother. They left the playground shortly after. I wrote everything down in a small notebook I'd started keeping. Each observation, each strange moment, the evidence was circumstantial at best, but it was adding up. Scott noticed the change in me. We were patrolling the southern trail when he brought it up. \"You look like hell,\" he said, not unkindly. \"When's the last time you got a full night's sleep?\" I shrugged. \"It's been a while.\" \"This is about the Strickland kid, isn't it? You're still hung up on what happened that night.\" I didn't answer, which was answer enough. Scott stopped walking and turned to face me. \"Look, Sawyer, I was there too. I saw what happened. I don't understand it either, but the boy is home safe with his family. Whatever you think you saw-\" \"I know what I saw,\" I cut him off. \"And that thing living with his parents isn't Melvin.\" Scott's face shifted from concern to alarm. \"'Thing?' Jesus, Sawyer, listen to yourself.\" \"I've been watching him,\" I admitted. \"You've been what?\" \"Observing the family, making sure everything's okay.\" Scott ran a hand through his hair. \"That's not observing, that's stalking. If anyone finds out...\" \"He speaks wrong sometimes,\" I continued, needing Scott to understand. \"Yesterday, I heard him tell his mother that the vessel requires sustenance. What seven-year-old talks like that?\" \"Kids pick up weird phrases from TV all the time,\" Scott countered. \"My nephew went through a phase where he talked like a British documentary narrator.\" \"It's more than that. The way he looks at animals, at other kids, like he's studying them, learning how to act human.\" Scott put his hand on my shoulder. \"I think you need to take some time off. This job, what happened with Melvin, it's gotten to you. I'm worried, man.\" I shook his hand off. \"I'm fine.\" \"You're not fine. You look like you haven't slept in days. You're following a family around town. That's not normal behavior, Sawyer.\" \"I just need to be sure.\" Scott sighed. \"Take a week. Go fishing or something. Clear your head.\"I nodded, not because I agreed, but because I needed him to drop it. Scott meant well, but he hadn't experienced what I had in that void. He hadn't heard the voices that now haunted my every sleeping and waking hour. The next morning, instead of taking Scott's advice, I drove to the park before sunrise. I parked at the northern trailhead and hiked the now familiar path to where we had found Melvin's backpack. From there, I followed the same route Scott and I had taken that night, moving deeper into the woods until I reached the clearing. In daylight, it looked so ordinary. Just a natural break in the trees, maybe 30 feet across, with patchy grass and a few wildflowers. Nothing to suggest it was a doorway to another dimension. Nothing to indicate that I had found a dead child here who later wasn't dead at all. I walked to the center, to the exact spot where I had found Melvin's body. The grass looked no different here than anywhere else in the clearing. No bloodstains, no disturbed earth. If I hadn't lived through it myself, I would've thought it was all a hallucination. I took out my compass, standard ranger equipment, and held it flat on my palm. The needle spun lazily at first, then faster, whirling in complete circles as if searching for north and finding nothing. I moved a few steps to the left, and the compass settled, pointing north as it should. I stepped back to the center, and again, the needle spun wildly. A cold spot. That's what ghost hunters on TV were always talking about. I had always scoffed at those shows, but now I knelt down and placed my hand on the ground at the center of the clearing. The earth felt colder than it should have on a warm autumn day, much colder, like touching the floor of a meat locker. And then I heard it, so faint I might have missed it if I hadn't been holding my breath. \"Help me,\" Melvin's voice coming from nowhere and everywhere, not from the air around me, but from beneath my palm as if rising through the soil itself. I pressed my hand harder against the ground. \"Melvin, is that you?\" The forest went completely silent, not gradually, but all at once, like someone had pressed a mute button on the world. The birds stopped singing. The breeze that had been rustling the leaves simply ceased. Even the distant sound of a woodpecker that had been tapping somewhere to the east disappeared. I stayed frozen in that position, my hand flat against the cold ground for what felt like minutes. The silence was absolute, pressing against my eardrums like a physical force. Then, just as suddenly as it had gone quiet, the forest sounds returned. Birds, insects, the soft whisper of leaves. But Melvin's voice didn't come again. I sat back on my heels, my heart pounding. This was real, all of it, the void, the voices, the thing that had come back wearing Melvin's face. And the real Melvin, the actual child, was still trapped somewhere I couldn't reach. I had been right all along. Something had returned from the woods that night, but it wasn't Melvin Strickland. I drove back to the park after my shift ended, waiting until darkness settled completely over the forest. The weight of my decision felt heavy, but I couldn't ignore what I'd discovered earlier today. The cold spot, the spinning compass, Melvin's voice coming from beneath the ground. Those weren't hallucinations. They were proof. My truck's headlights cut through the empty parking lot at the northern trailhead. No other vehicles around. Exactly what I wanted. I checked my watch. 10:15 PM, perfect timing. I grabbed my backpack from the passenger seat and did a final check of my supplies. Two heavy-duty flashlights with fresh batteries, 100 feet of climbing rope, my park radio, and a digital camera with night vision capability. Everything I thought I might need to document whatever happened in that clearing. I locked my truck and switched on my headlamp, adjusting it to cast a wide beam ahead of me. The night air felt cooler than usual for this time of year, making me glad I'd worn my heavy jacket. The forest seemed to watch me as I started down the trail, my footsteps crunching softly on the path. The hike took longer at night, but I knew these trails like the back of my hand. Every fork, every landmark registered automatically in my mind as I walked. About halfway to the clearing, I noticed the first temperature drop. Subtle at first, then more pronounced with each step forward. My breath began fogging in front of my face despite it being only early fall. \"Just like before,\" I whispered to myself, watching the cloud of my breath dissipate. The memory of that night with Melvin came rushing back. The unnatural cold, the silence, the blue light pulsing from his mouth. I shivered, but kept moving. When I reached the edge of the clearing, I stopped and took a deep breath. In the beam of my headlamp, it looked deceptively ordinary. Just a circular open space about 30 feet across, surrounded by trees. But I knew better. I knew what had happened here. I approached the center carefully, marking my path with small reflective tacks pushed into the ground. The temperature continued dropping with each step. By the time I reached the middle, it felt like winter. I checked my watch again. 11:20 PM. I had time to set up. I unloaded my backpack methodically. First, I set up the camera on a small tripod, pointing it at the exact spot where I'd found Melvin's body.I tested it twice to make sure the night vision was working properly. Next, I took out the rope and measured a length that would allow me to move freely around the clearing while staying tethered. I secured one end to a sturdy oak at the edge of the clearing with a climber's knot, leaving the other end coiled beside my equipment. With everything in place, I sat cross-legged on the ground near the cold spot and waited. The forest had gone completely silent. No insects chirping, no night birds calling, no rustling leaves despite the occasional breeze I could feel on my face. Just like before. Just like Jenkins had described from his experience 40 years ago. My watch ticked past midnight. I stood up, muscles stiff from sitting in the cold. Nothing had changed yet. I paced the clearing, checking my equipment again, wondering if I'd gotten the timing wrong. Then I felt it, a subtle shift in the air pressure that made my ears pop. I spun around toward the center of the clearing and froze. The air above the cold spot had begun to shimmer, like heat waves rising from hot pavement, except this was the coldest part of the clearing. I grabbed the camera and started recording, my hands surprisingly steady despite my racing thoughts. The shimmering intensified, and within it, something began to take shape. At first, just a vague outline on the ground, but it gradually solidified into a form I recognized immediately, the small body of a child lying motionless in the exact position where I'd found Melvin three weeks ago. My breath caught as the image became clearer. The red jacket, the sprawled limbs, the closed eyes. It wasn't solid, more like a projection or a memory made visible, but it was unmistakably Melvin. I crept closer, camera still recording. \"Melvin?\" I whispered. Though I knew this wasn't really him, not his physical body anyway. As if in response, the apparition's lips parted slightly and a soft blue light began to pulse from between them. The rhythm matched a heartbeat, slow, steady pulses that grew gradually brighter with each beat. The light cast eerie shadows across the clearing, making the trees look like they were swaying, though no wind moved them. I backed away and grabbed the loose end of the rope. This was it. This was happening exactly as it had before, but this time, I was ready. I wrapped the rope around my waist, tying it securely with a rescue knot I could release quickly if needed. I tested the tension, making sure it would hold. The blue light continued to intensify, and I felt the first tug of that invisible force, the same pull that had dragged me toward Melvin's body the first time. It was gentle at first, like someone taking my hand, but grew steadily stronger. I planted my feet and leaned back against it, testing how much control I had. The pull increased, becoming insistent, almost angry at my resistance. I felt it wrap around my chest and arms just like before, but the rope held me in place. For several minutes, I fought against it, trying to see how long I could resist. My feet began to slide forward despite my efforts, leaving tracks in the dirt. The force was stronger than I remembered, or maybe I was just more aware of it now. I looked back at the tree where the rope was secured, making sure the knot held firm. It did. The blue light from the apparition's mouth had become almost blinding, pulsing faster now. The pull was becoming painful, constricting around my chest until breathing became difficult. I had to make a choice, keep fighting and risk injury or allow myself to be taken while maintaining the physical connection through the rope. I made my decision. I stopped resisting and took three deliberate steps toward the light. \"I'm coming for you, Melvin,\" I said aloud. \"The real you.\" The force seized me completely, and the world dissolved around me. The trees, the clearing, the equipment, all of it melted away into darkness. But unlike last time, I still felt the pressure of the rope around my waist, a constant reminder of my physical body and the way back. The transition was less violent this time, more like sinking into deep water than being torn apart. And then I was there again, the dimensionless void where no direction existed, where light and dark had no meaning. The rope extended behind me, disappearing into nothingness, but I could feel its reassuring tug connecting me to the physical world. The voices started immediately, hundreds of them overlapping, desperate. \"Help me.\" \"I can't find my way out.\" \"Please, take me with you.\" \"Don't leave me here.\" I recognize some of them, my father's strong voice calling my name, my mother's softer tones begging me to stay with her. But I ignored them all, concentrating instead on one specific voice. \"Help me, please. I'm scared.\" Melvin's voice, high and frightened, came from somewhere in the darkness. I turned toward it, though turning had no real meaning in this place. The other voices grew louder as if trying to drown him out. \"Sawyer, son, I need you.\" \"Don't abandon us again.\" \"It's got me, Sawyer. It won't let go.\" I closed my eyes, another meaningless gesture in the void, but it helped me focus. \"Melvin,\" I called out. \"Keep talking. I'm following your voice.\" \"I'm here,\" his voice called back, clearer now. \"I want to go home.\" I moved toward the sound, though movement here was more like willing myself in a direction than actual physical travel.\nThe rope trailing behind me grew taut occasionally, reminding me of my limits, but it still allowed me to proceed. The voices became more insistent, more manipulative. My mother's voice turned accusatory, \"After everything I did for you, this is how you repay me, by leaving me alone in this darkness.\" My father's voice grew angry, \"You're making the same mistakes I did, son. Never finishing what you start. Never doing the right thing.\" Scott's voice, terrified, \"Something's got me, Sawyer. Don't leave me here with it.\" I pushed forward, ignoring them all. \"They're not real,\" I told myself. \"Focus on Melvin. Find Melvin.\" His voice called again, closer now, \"Please hurry. I don't like it here.\" Other voices tried to mimic him, creating a chorus of childlike pleas from all directions. I hesitated, suddenly unsure which was the real Melvin. The rope around my waist tightened as if something on the other end was pulling me back. \"Melvin,\" I called out, \"tell me something only you would know, something about the day you got lost.\" A moment of silence, then, \"I had animal crackers in my backpack, and a juice box, and my favorite truck toy that Daddy gave me for my birthday.\" That was him. Those were the exact items I'd found in his backpack on the trail. I moved toward his voice with renewed certainty. As I got closer, I began to perceive something in the darkness, a small, faint glow like a firefly hovering in the distance. I pushed toward it, feeling resistance from all sides now, as if the void itself was trying to hold me back. The other voices grew hostile, no longer pleading, but threatening. \"You'll never find your way back. We'll keep you here forever. You belong with us now.\" The glowing point grew larger as I approached, gradually taking the shape of a small boy. Melvin, or some manifestation of him in this place, appeared as a dim, translucent figure with frightened eyes. He reached out toward me as I got closer. \"You came back,\" he said, his voice trembling. \"You heard me.\" \"I heard you,\" I confirmed, stretching my hand toward his. \"I'm going to get you out of here.\" The other voices surged around us, a cacophony of rage and desperation trying to break my concentration. I felt multiple forces pulling at me from different directions, trying to tear me away from Melvin, but I kept my focus on the boy's frightened face. \"Take my hand,\" I told him, extending my arm further. As our fingers nearly touched, the rope around my waist jerked violently, pulling me backward. I fought against it, reaching desperately for Melvin's outstretched hand while the voices screamed in fury all around us. I found Melvin in the void, appearing as a frightened, glowing figure. His face was exactly as I remembered, round cheeks, freckles across his nose, those innocent blue eyes now wide with terror. The translucent outline of his small body trembled as he reached toward me. \"You came back. You heard me,\" he said, his voice small but clear among the cacophony of other voices swirling around us. \"I'm going to get you out,\" I promised, extending my hand toward his. As our fingers nearly touched, I became aware of other presences surrounding us. Not just voices anymore, but actual souls trapped, frightened, angry. Some appeared as faint glowing outlines like Melvin, while others were just suggestions of human forms, their features blurred by time or trauma. An elderly woman with kind eyes floated near my left shoulder. \"Please,\" she whispered, \"I've been here since 1967, hiking with my grandson when I fell.\" A middle-aged man materialized on my right, his outline flickering. \"Lost in a storm in 1983. They never found my body.\" More appeared, a teenage boy, a young woman, an older man wearing what looked like a park uniform from decades past. Dozens, maybe hundreds of souls trapped in this place between worlds, their stories cut short in these woods I'd patrolled for 12 years. The truth hit me with sickening clarity. This wasn't just about Melvin. Whatever entity controlled this place had been collecting souls for decades, maybe centuries. And each time, it sent something back in their place, something that looked human, but wasn't. The thing wearing Melvin's face that I'd watched playing at the playground, the thing that had told its mother, \"The vessel requires sustenance,\" it was just the latest replacement. \"How many?\" I asked, my voice tight with horror. \"How many people has this thing taken?\" The souls didn't answer directly, but their numbers spoke volumes, generations of lost hikers, children who wandered off trails, rangers who came looking, all trapped here while something else returned to their families wearing their faces. I turned back to Melvin and grabbed his small hand firmly in mine. His fingers felt surprisingly solid despite his translucent appearance. \"Hold on tight,\" I said. \"We're getting out of here.\" I felt the rope still secured around my waist, the one physical connection to the real world. I began following its pull, keeping Melvin's hand firmly in mine as I moved through the darkness. The moment I started moving with clear purpose, the other voices changed.The pleading and begging transformed into something hostile, angry. \"You can't take him,\" hissed a woman's voice that sounded disturbingly like my mother's. \"If he leaves, we all leave.\" \"Traitor,\" growled another that mimicked my father's deep timbre. \"You promised to find me.\" The darkness around us shifted and solidified. The trapped souls were no longer just voices or translucent forms. They became shadowy figures with substance, moving to block our path. Their eyes glowed with unnatural blue light as they reached for us with elongated fingers. \"Don't look at them,\" I told Melvin, pulling him closer to my side. \"Just keep moving forward.\" A shadow that had once been a man lunged at us, its form stretching impossibly as it tried to wrap around Melvin's legs. I kicked at it, feeling a strange resistance, like pushing through cold mud. \"They're angry,\" Melvin whimpered, pressing against my side. \"They're trapped,\" I said, \"and they don't want us to escape.\" I kept one hand firmly gripping Melvin's while the other followed the rope, pulling us forward inch by inch. The shadows grew more aggressive, clawing and grabbing at us. One caught my ankle, sending a bone-deep chill up my leg. I shook it off and kept moving. The rope pulled taut as I felt resistance from both sides, the physical world pulling me back and the shadows trying to keep us in. My chest tightened as the pressure increased, making each breath a struggle. Then suddenly, the darkness parted. Ahead of us appeared a shimmering boundary, like looking through water at a distorted image. Through it, I could see the clearing in the physical world, illuminated by the blue light still pulsing from the apparition of Melvin's body. And there was my own body, lying motionless on the ground beside my equipment, the rope still tied around my waist. My camera had fallen from its tripod, its red recording light still blinking. \"That's the way out,\" I told Melvin, pointing toward the boundary. \"We need to go through there.\" Melvin hesitated, his grip on my hand tightening. \"What if I can't? What if I'm stuck here forever?\" \"You won't be,\" I assured him, though I had no idea if that was true. \"I'm taking you home to your parents, your real parents.\" We pushed forward together, fighting against the increasing pressure of shadows pulling at us from behind. The boundary wavered like a soap bubble as we approached, thin and fragile. \"You go first,\" I said to Melvin when we reached it. \"I'll be right behind you.\" Melvin looked up at me with terrified eyes. \"Promise?\" \"I promise,\" I said firmly. I lifted him toward the boundary, and as his small hands touched the shimmering surface, it rippled. The shadows behind us shrieked in fury, surging forward in a wave of darkness. I shoved Melvin through the boundary with all my strength, watching as his form disappeared into the physical world. Then I turned to face the oncoming shadows, bracing myself as they crashed against me. Cold, clawing hands grabbed at my clothes, my hair, my skin. They pulled me backward, away from the boundary, away from escape. \"No,\" I shouted, fighting against their grip. I grabbed the rope with both hands and pulled hard, feeling it cut into my palms. The shadows wrapped around me, their whispers filling my ears with promises and threats. My father's voice telling me we could be together again. My mother's voice saying she needed me. Scott's voice warning me that something had him, something wouldn't let go. I ignored them all and pulled harder on the rope, inching toward the boundary. The shadows grew more desperate, more violent. One wrapped around my throat, cutting off my air. With one final effort, I lunged toward the boundary, feeling it part around me like cold water. The shadows screamed as I passed through, their grip weakening as I entered the physical world. My consciousness slammed back into my body with such force that I arched upward, gasping desperately for air. My lungs burned as they filled, my heart pounding painfully in my chest. Every muscle in my body felt like it had been stretched to breaking point. I rolled onto my side, coughing and retching, and came face-to-face with Melvin, the real Melvin. He lay beside me on the ground, his eyes wide and confused, his small chest rising and falling rapidly. His red jacket was torn exactly as I remembered seeing it the first time I found his body. \"Ranger Sawyer?\" he whispered, his voice hoarse. \"It's okay,\" I managed to say between gasps. \"You're safe now.\" The ground beneath us trembled slightly, a low vibration that quickly intensified. The cold spot at the center of the clearing began to frost over, ice crystals spreading outward in a rapidly expanding circle. I didn't wait to see what would happen next. I untied the rope from my waist, staggered to my feet, and scooped Melvin into my arms. His body felt impossibly light, but solid and real. \"Hold on,\" I told him, and started running. The trembling ground made it difficult to keep my balance. Behind us, the clearing was transforming. The frost had given way to what looked like black oil bubbling up from the earth, and the air shimmered with that same blue light. I ran as fast as I could through the forest, no longer following the trail, but heading straight toward where I knew the forest edge would be.... Melvin clung to me, his face buried against my shoulder. Tree branches whipped at my face and arms, but I didn't slow down. The vibrations followed us, the ground continuing to shake. Trees began to sway dangerously, their roots pulling up from the soil. The sounds of cracking wood and falling branches filled the air along with an unnatural howling that might have been wind, but felt more like the screams of the trapped souls we'd left behind. I didn't look back. I couldn't. Every ounce of my energy was focused on getting Melvin out of these woods. The eastern sky was beginning to lighten when we finally broke through the tree line. I stumbled into the open space of the northern trailhead parking lot. My legs nearly giving out beneath me. My truck stood where I'd left it, and beyond it, the access road that led back to civilization. I set Melvin down gently, checking him for injuries. Apart from being cold, confused, and frightened, he seemed physically unharmed. His eyes focused on me with recognition, real recognition, not the empty stare of the thing that had taken his place. \"Am I going home now?\" He asked, his voice small, but steady. \"Yes,\" I promised him. \"Right now.\" I loaded him into my truck, cranked the heat and drove straight to the Strickland house. The sun was just cresting the horizon when we pulled up in front of the blue-sided two-story home I'd watched so many times during my surveillance. Before I could even get out of the truck, the front door flew open. Dominic and Cassie Strickland rushed out onto the porch in their pajamas looking frantic. \"He's gone.\" Cassie was shouting into a phone. \"We woke up and he was just-\" She stopped mid-sentence when she saw my truck and then her eyes landed on Melvin sitting in the passenger seat. The phone dropped from her hand. I helped Melvin out of the truck and watched as he ran toward his parents. There was no hesitation in their reaction, no confusion, no uncertainty. They knew immediately, this was their son, their real son. Dominic fell to his knees on the lawn catching Melvin in his arms with a sob. Cassie joined them, wrapping her arms around them both, crying and laughing at the same time. \"Mommy, Daddy,\" Melvin said. His voice muffled against his father's chest. \"I was lost, but the ranger found me.\" I stood by my truck, watching the reunion. Cassie looked up at me over Melvin's head. Her eyes filled with questions and gratitude. \"The other one,\" she said quietly, \"it looked like him, but it wasn't. It wasn't our Melvin. We knew something was wrong, but we thought maybe it was trauma or shock. And then this morning, it was just gone.\" I nodded, not surprised. Whatever had been wearing Melvin's face had no reason to stay once the real Melvin returned. It had probably sensed what was happening and fled back to wherever it came from. \"What happened out there?\" Dominic asked, still holding Melvin tightly. I looked back toward the forest where the trees stood dark against the brightening sky. In the distance, I thought I could still see a faint blue glow among the trees, but it might have been my imagination. \"Something that shouldn't be possible,\" I said, \"but it happened.\" I knew I would have to explain eventually to the Stricklands, to the park service, to Scott. I would have to find a way to tell them about the clearing, the void, the trapped souls, and the thing that had been collecting them. I would have to warn people about what lurked in those woods, but for now, I was content to watch Melvin safe in his parents' arms, back where he belonged. The forest would never be the same for me. I would never walk those trails without remembering what I had seen and experienced, but I had survived to tell the truth, and maybe that was enough. Melvin looked up from his parents' embrace and met my eyes. There was recognition there and something else, a shared understanding of where we had been and what we had escaped. \"Thank you,\" he said simply. I nodded, suddenly too exhausted for words. The sun continued to rise, casting long shadows across the lawn, but for once, I wasn't afraid of the darkness."
}