{
  "title": "I Was a Marine at the DMZ in 1989. I Saw Something TERRIFYING.",
  "upload_date": "",
  "duration_sec": 6823.0,
  "segments": [],
  "full_text": "I checked my gear for the third time in 10 minutes, running through the same mental checklist that had become second nature over the past eight months. M16 secured, extra magazines clipped to my belt, radio functioning, night vision equipment tested. The familiar weight of the equipment felt reassuring against my shoulders as I adjusted the straps of my pack. October in Korea meant the nights were getting colder and I could already feel the bite in the air through my fatigues. Drew Noble stood at the front of the briefing room. His square jaw set in that expression he wore whenever he was about to send us somewhere that made him nervous. The fluorescent lights overhead cast harsh shadows across his weathered face, making the lines around his dark eyes look deeper than usual. He'd been our commanding officer for six months now and I'd learned to read the subtle signs that meant trouble. Tonight, those signs were all there. \"Listen up,\" Drew said, his voice carrying that crisp authority that made everyone in the room straighten their backs automatically. \"Tonight's patrol takes you through sector seven, standard route along the fence line. Intelligence reports increased movement on the northern side over the past week. Nothing confirmed, but stay alert.\" I felt my stomach tighten slightly. Sector seven wasn't our usual assignment. The terrain there was rougher, more isolated, with fewer checkpoints and longer stretches between radio contact with base. The North Koreans had been testing boundaries more frequently lately, probing for weaknesses in our patrol patterns. Everyone knew it, even if command didn't like to talk about it openly. \"Weather forecast shows clear skies, minimal cloud cover,\" Drew continued, consulting the papers in his hand. \"Temperature dropping to around 40 degrees. Visibility should be good, but watch for ground fog in the lower areas near the river.\" Elijah Knapp shifted beside me, adjusting his radio equipment with the careful precision that marked him as our communications specialist. At 23, he was younger than me, but had a talent for keeping our radio contact clear even in the worst conditions. His blonde hair caught the harsh light as he nodded along with Drew's briefing, making mental notes about frequency checks and backup channels. Christian Hoffman sat across from us. His dark eyes focused intently on the map Drew had spread across the table. Christian was our translator, fluent in Korean and familiar with the cultural nuances that sometimes made the difference between a peaceful encounter and a dangerous misunderstanding. He traced the patrol route with his finger, probably calculating distances and memorizing landmarks the way he always did before we went out. Julian Burgess lounged in his chair with the relaxed confidence of someone who'd grown up hunting in the Texas Hill Country. At 21, he was the youngest of our team, but his practical approach to problems and steady nerves under pressure had earned everyone's respect. He cleaned his fingernails with a pocketknife while listening to the briefing, a habit that used to annoy me, but now seemed reassuring in its predictability. \"Any questions?\" Drew asked, looking around the room with those stern brown eyes that missed nothing. Nobody spoke up. We'd done this route before, just not recently. The patrol patterns rotated every few weeks to keep the North Koreans from predicting our movements, but sector seven was familiar enough territory. Rolling hills covered with scrub brush, a few scattered trees, and the ever present fence line with its warning signs in three languages. \"Departure at 2200 hours,\" Drew said, checking his watch. \"Expected return at 0600. Maintain radio contact every 30 minutes. Any deviation from the planned route requires approval from base.\" I glanced at my own watch. 21:45. 15 minutes to finish preparations and meet at the motor pool. My hands moved automatically to check my equipment one more time, even though I knew everything was exactly where it should be. Eight months of patrols had ingrained the habit so deeply that I could probably do the equipment check in my sleep. The briefing room emptied quickly as everyone headed to make final preparations. I walked outside into the crisp October air and felt the familiar mix of anticipation and unease that came before every patrol. The base around us hummed with its usual nighttime activity. Generators provided steady background noise, punctuated by the occasional vehicle engine or radio chatter from other units. Korea in October felt different from the summer months when I'd first arrived. The oppressive heat and humidity had given way to clear, cold nights that made the stars seem brighter and the silence more profound. During the day, the mountains in the distance showed hints of autumn color, but at night, everything faded to shades of gray and black. I met up with the others at the designated vehicle, a military Jeep that had seen better days, but still ran reliably enough for patrol duty. Elijah was already running final checks on his radio equipment, speaking quietly into the handset to confirm our frequencies with base communications. Christian had spread a detailed map across the hood of the Jeep and was marking our checkpoints with a red pen. \"Route looks straightforward,\" Christian said without looking up from the map. \"Three major checkpoints, two river crossings, and a stretch along the eastern fence line that'll take about 90 minutes.\" Julian finished loading extra water and emergency supplies into the back of the Jeep. \"Weather's supposed to stay clear, but I packed extra gear just in case. You never know what might happen out there.\" That was Julian's approach to everything. Plan for the worst, hope for the best, and always carry more supplies than you think you'll need.It had served us well during our previous patrols, especially the time when unexpected rain had turned a simple navigation exercise into a six-hour ordeal. At exactly 22:00 hours, we pulled away from the base and headed towards Sector 7. The Jeep's engine settled into a steady rhythm as we followed the familiar roads that led to our patrol area. I rode in the passenger seat, watching the landscape roll past in the pale illumination of our headlights. The transition from the relative civilization around the base to the wild empty terrain of the DMZ always struck me as abrupt. 20 minutes later, we reached our starting point and parked the Jeep at a designated spot where it would wait for our return. From here, the patrol would be on foot through terrain that vehicles couldn't navigate safely in the dark. I shouldered my pack and checked my compass heading while the others made their final preparations. The night was clear and cold, just as Drew had promised. Stars filled the sky with a brilliance that you never saw near cities or major bases. The silence felt complete except for the soft sounds of our boots on the rocky ground and the occasional rustle of wind through the sparse vegetation. We moved in standard formation with me taking point, Christian and Julian in the middle, and Elijah bringing up the rear with the radio. Our route took us along a ridge line that provided good visibility in all directions while keeping us away from the most heavily monitored areas near the fence itself. The terrain was exactly what I'd expected. Rolling hills covered with scrub brush and scattered rocks cut by occasional dry creek beds that would fill with rushing water during the spring rains. Warning signs appeared at regular intervals, marking the boundaries of minefields and restricted areas in Korean, Chinese, and English. The messages were always the same. \"Danger, mines. Do not enter,\" and, \"Military Zone. Authorized personnel only.\" Two hours into the patrol, we'd covered roughly half our planned route without incident. The night remained clear and quiet with no signs of unusual activity on either side of the border. Elijah had maintained regular radio contact with base, reporting our position and status every 30 minutes exactly as instructed. I was beginning to think this would be one of those routine patrols that you remembered mainly for the cold and the long walk when I noticed something that made me stop and study the northern horizon more carefully. A line of fog was rolling down from the hills on the North Korean side, moving slowly but steadily in our direction. At first, it looked like the kind of natural ground fog that Drew had mentioned in his briefing. October nights in Korea often produced fog in the lower areas, especially near water sources. But something about this fog bothered me. The night was clear with a steady breeze coming from the south, yet this fog was moving against the wind. That wasn't how weather patterns worked. Fog followed air currents and temperature gradients flowing downhill and moving with the prevailing wind direction. I held up my hand to signal the others to stop and pointed toward the approaching fog bank. \"Anyone else notice something strange about that?\" Christian moved up beside me and studied the northern horizon. \"It's moving the wrong direction. Wind's coming from behind us, but that fog is moving south.\" Elijah checked his radio and tried to raise base communications. \"Base, this is Patrol 7. We have unusual weather conditions developing in our sector. Requesting guidance.\" The radio crackled with static, but no response came through. Elijah adjusted the frequency and tried again with the same result. \"I'm getting nothing but static. Could be atmospheric interference, but the radio was working fine 10 minutes ago.\" The fog continued its steady advance and, as it got closer, I could see that it wasn't the wispy, translucent fog that formed naturally on cool nights. This was thick and dark, almost solid-looking, with an unnatural uniformity that seemed wrong somehow. The leading edge moved in a straight line like a wall of gray-black vapor rolling across the landscape. Julian squinted at the approaching fog bank and shook his head. \"I've seen a lot of weird weather growing up in Texas, but I've never seen fog move like that. It's like something's pushing it.\" As the fog got closer, I caught a smell that made my stomach clench. It was acrid and chemical, like burning plastic mixed with something organic that had been left to rot. The smell carried on the wind despite the fact that the fog itself was moving against the air current. \"We need to get out of here,\" I said, feeling a deep unease that had nothing to do with the tactical situation and everything to do with some primitive instinct that was screaming warnings. \"This isn't natural.\" But even as I said it, the fog was moving faster than we could retreat. Within minutes, it had surrounded us completely, reducing visibility to just a few feet in any direction. The world became a gray bubble with indistinct shapes looming and disappearing in the swirling mist. The smell got stronger, making my eyes water and my throat burn. I pulled out a handkerchief and pressed it over my nose and mouth, but it didn't help much. The chemical stench seemed to penetrate everything, getting into my lungs and making me feel dizzy. Elijah tried the radio again, but the static was so loud now that he had to turn down the volume to avoid attracting attention.\"Nothing,\" he whispered. \"It's like something's jamming every frequency.\" The fog continued to thicken around us until I could barely make out Julian's silhouette, even though he was standing less than three feet away. The unnatural silence that came with the fog was almost as disturbing as the reduced visibility. No wind sounds, no insect noises, no distant sounds of normal nighttime activity. Christian tapped my shoulder and pointed ahead through the fog. At first, I couldn't see what had caught his attention. Then the mist shifted slightly, and I saw dark shapes on the ground about 20 yards ahead of us. My first thought was that we'd stumbled across some kind of equipment cache or supply drop. The shapes were too regular and evenly spaced to be natural rock formations. But as we moved closer, the horrible truth became clear. Six North Korean soldiers lay on the ground, arranged in a perfect circle with their feet pointing outward and their heads toward the center. Even in the thick fog, I could see that their uniforms were shredded and their bodies were covered with what looked like claw marks, deep parallel gouges that had torn through fabric and flesh with surgical precision. But it was their faces that made my blood run cold. Each soldier's eyes were wide open, staring upward with expressions of absolute terror frozen in place. Their mouths were open as if they died screaming, and their hands were clawed as if they'd been trying to fight off something that had attacked them from above. The wounds were too clean and too precise to have been made by any weapon I knew. They looked like the work of some massive predator, but there were no large predators in Korea, nothing that could've done this kind of damage to six trained soldiers. I approached the nearest body cautiously, my rifle ready, even though I had no idea what I might need to shoot. The soldier looked young, maybe 19 or 20, with the lean build and weathered hands of someone who'd spent his life doing physical labor. His uniform bore the insignia of a regular infantry unit, nothing special forces or elite. The claw marks across his chest were deep enough to have severed major blood vessels, but there was surprisingly little blood on the ground around the bodies. Whatever had killed these men had been quick and efficient, leaving them arranged in this perfect circle for reasons I couldn't begin to understand. I knelt beside the second body, forcing myself to look past the terror frozen on the soldier's face. The wounds demanded closer inspection, even though every instinct told me to get away from this place. The fog pressed around us like a living thing, muffling our movements and making the air thick enough to taste. The claw marks weren't random. That much became clear as I traced the pattern with my eyes, careful not to touch anything. Three parallel gouges ran from the man's left shoulder down across his chest, each one perfectly spaced about two inches apart. The fabric of his uniform had been sliced clean through, as if someone had taken a razor to it, but the edges were too ragged for any blade I knew. Whatever had done this possessed claws sharp enough to cut through military-grade fabric and the flesh beneath in one smooth motion. \"Knapp, get some photos of these wounds,\" I called out, keeping my voice low. The fog seemed to swallow sound, making even normal conversation feel like shouting. Elijah moved closer with his camera, the flash cutting through the mist in sharp bursts. Each pop of light revealed more details I wished I hadn't seen. The wounds went deep, probably down to the bone in some places, but the bleeding had been minimal. That bothered me more than anything else. A man torn up this badly should've bled out completely, should've left the ground around him soaked red. Instead, I found only small, dark stains in the dirt. \"Jesus,\" Elijah muttered, lowering his camera. \"What kind of animal makes cuts that clean?\" \"No animal I know,\" I said, moving to the third body. This soldier had been older, maybe 30, with sergeant stripes on his sleeve. The same three-claw pattern marked his torso, but he also had defensive wounds on his forearms. He'd tried to fight back, had raised his arms to protect himself. Fat lot of good it had done him. Christian was working his way around the circle, collecting dog tags and anything else that might identify the dead men. His face had gone pale, but he kept at his task with methodical precision. Military training took over when your mind couldn't process what you were seeing. \"Hoffman, you finding anything useful?\" I asked. \"Standard North Korean infantry,\" he replied, holding up a set of tags. Nothing special about any of them. Regular patrol unit, probably doing the same job we were. Julian crouched near the fourth body, shaking his head. \"These wounds don't look like any landmine damage I've seen,\" he said. \"Mines tear you up random-like, blow chunks off you. This here's too neat, too organized.\" He was right. I'd seen mine casualties during training exercises, had studied the photographs and damage patterns. Explosive wounds were messy, chaotic things that scattered shrapnel in every direction and left victims with missing limbs and crater-like injuries. These soldiers still had all their parts. They'd been sliced open with surgical precision by something that knew exactly where to cut. The fog shifted around us, and for a moment, I thought I heard something, a sound that didn't belong to the wind or our movement. I held up my hand, signaling the others to freeze and strained to listen.There it was again, a soft crying barely audible through the thick air. \"You hear that?\" I whispered. Elijah nodded, pointing toward a cluster of pine trees about 50 meters ahead. The sound was coming from that direction, thin and high-pitched, human, young. My mind raced through possibilities. Another patrol member who'd survived whatever happened here? A civilian caught in the wrong place? The crying continued, steady and heartbroken, the sound of someone who'd been weeping for a long time. I checked my rifle, made sure a round was chambered, then motioned for the team to form up. We moved away from the circle of bodies, stepping carefully through the fog toward the trees. The crying grew louder as we approached, definitely human, definitely young, a child. The pine trees loomed out of the mist like dark sentinels, their branches heavy with moisture from the fog. The crying was coming from behind the largest tree, maybe 10 feet into the small grove. I signaled for the others to spread out, to approach from different angles. We had no idea what we might be walking into. I rounded the tree first, rifle ready, and stopped short. A little girl sat huddled against the trunk, her knees drawn up to her chest, small hands covering her face. She couldn't have been more than eight or nine years old, wearing what looked like a traditional Korean dress, a hanbok in pale blue fabric. The dress should have been beautiful, but it was soaked in blood. Dark red stains covered the front of it, splattered across the white trim and pooled in the folds of the skirt. My first thought was that she was injured, that whatever had killed the soldiers had gotten to her too. But as I watched, I realized she was crying from fear, not pain. Her breathing was steady, her posture strong. The blood wasn't hers. \"It's okay,\" I said softly, lowering my rifle. \"We're here to help.\" She looked up at the sound of my voice, and I saw her face clearly for the first time. Blood streaked her cheeks and forehead, but underneath the crimson mask, she appeared completely unharmed. Her eyes were wide with terror, darting between me and the other soldiers as they emerged from the fog. She started speaking rapidly in Korean, her words tumbling over each other in a rush of fear and desperation. I couldn't understand a word, but the tone was unmistakable. She was terrified and trying to tell us something important. \"Hoffman, get over here,\" I called. \"We need translation.\" Christian jogged over, slinging his rifle and crouching down to the girl's level. He spoke to her in Korean, his voice gentle and reassuring. She responded immediately, pointing back toward where we'd found the dead soldiers, her words coming faster now. \"What's she saying?\" I asked. Christian's face darkened as he listened. \"She says she escaped from bad men who hurt her family, says they were soldiers, but not like us. Different uniforms, different weapons.\" The girl continued talking, gesturing wildly now, tears streaming down her bloodstained cheeks. Christian translated in fragments, trying to keep up with her rapid speech. \"She was hiding in the trees when it happened, says the bad men were chasing her. But then something else came, something that attacked the soldiers.\" \"Ask her what attacked them,\" I said. Christian posed the question, and the girl's response made him frown. He asked her to repeat herself, then looked up at me with confusion. \"She says it came from the sky, something big and dark that moved too fast to see clearly. Says it made sounds like screaming metal.\" I felt a chill that had nothing to do with the fog. \"Ask her where her family is.\" The girl's answer was longer this time, punctuated by fresh sobs. Christian's expression grew grim as he translated, \"Her village is about two kilometers north of here. She says the bad men came three days ago, took her parents and older brother. She's been hiding in the woods since then, trying to find help.\" Three days. That meant whatever had happened to her family occurred before our patrol, before the fog, before we'd found the bodies. But the soldiers we'd discovered couldn't have been dead that long, rigor mortis hadn't even set in completely. My radio suddenly crackled to life, making all of us jump. Static filled the air, then a voice broke through. Drew's voice, but distorted and unclear. \"Alpha Team, report status. What's your current position?\" I grabbed the radio, grateful to finally have communication restored. \"Base, this is Alpha Team. We've encountered casualties and a civilian. Request immediate extraction and medical support.\" But instead of Drew's response, another voice cut in, Colonel Hunt's gravelly tone overriding the transmission. \"Negative on extraction. Alpha Team is to continue mission parameters, eliminate any security threats, and proceed to checkpoint three.\" \"Sir, we have a child here who needs medical attention,\" I replied, \"and six KIA soldiers who...\" A third voice interrupted, this one belonging to Major Payne. \"Alpha Team, ignore previous orders. Return to base immediately with the civilian for debriefing.\" The radio erupted in competing transmissions. Drew's voice arguing with Hunt's, Payne issuing contradictory commands, and underneath it all, static that sounded almost like screaming.I turned the volume down, but the chaos continued. \"What the hell is going on?\" Julian asked, staring at the radio. I had no idea. In three years of military service, I'd never heard commanding officers argue over open channels, never received contradictory orders from multiple superiors simultaneously. Protocol was clear. Chain of command was absolute. Communications were structured and professional. The little girl was watching us with wide eyes, still crying, but more quietly now. Blood continued to streak her face and stain her dress, and I found myself wondering whose blood it was, if her family had been taken three days ago. Where had she been? How had she survived alone in these woods, and why was she covered in fresh blood when she showed no signs of injury? The radio chatter continued, voices overlapping and cutting each other off. Through the static and confusion, I caught fragments of orders. Secure the area. Eliminate witnesses. Extract the package. Abort the mission. None of it made sense, and all of it contradicted everything else. Christian was still talking to the girl, trying to calm her down and gather more information. She kept pointing toward the dead soldiers, repeating something that made him shake his head in disbelief. \"What now?\" I asked. \"She says she saw what killed them. Says it wasn't an animal or a weapon. Says it was...\" He paused, asking her to repeat herself. \"Says it was like a shadow with claws, something that moved like smoke but cut like metal.\" The fog pressed closer around us, and somewhere in the distance, I thought I heard the sound of metal scraping against stone. The radio in my hand continued its chaotic chorus of conflicting orders, each voice more urgent than the last. I looked down at the blood-covered child, then back toward the circle of mutilated soldiers and realized we were caught in something far beyond a simple patrol mission gone wrong. The radio crackled in my hand. Three different voices cutting through the static at once. Drew's orders to eliminate the security threat. Hunt's demand to bring the girl back for questioning. Payne insisting we protect her and return to base immediately. Each voice more urgent than the last, each one contradicting the others. I stared down at the girl still huddled against the pine tree. Her blood-soaked hanbok making her look even smaller in the shifting fog. Christian knelt beside her, speaking in quiet Korean, trying to keep her calm while the chaos erupted from my radio. The poor kid had been through enough without having to listen to three officers argue about what to do with her. The metal scraping sound echoed again from somewhere in the distance, closer this time. Whatever had torn apart those six soldiers might still be out there, and here we were standing around debating protocol while the fog pressed in around us. I made my decision. \"We're taking her back to base,\" I said into the radio, cutting through the competing voices. \"Child in need of medical attention returning to Camp Liberty for immediate debriefing.\" Hunt's voice exploded through the speaker. \"Negative, Dahe. Secure the area first. Eliminate any potential...\" I switched the radio off and clipped it back to my belt. Sometimes you had to make the call and deal with the consequences later. This wasn't the time for committee decisions. \"Julian,\" I called out. \"You're carrying her. Christian, stay with them. Elijah, take point with me.\" Julian looked down at the girl, then back at me. \"She's covered in blood, Eddie. What if-\" \"What if what? She's eight years old and terrified. We're Marines, not monsters.\" I kept my voice low but firm. \"Move.\" Christian spoke to the girl in Korean, explaining what we were going to do. She nodded and let Julian scoop her up, wrapping her thin arms around his neck. The blood on her dress was already drying, turning the pale blue fabric dark and stiff. I tried not to think about where all that blood had come from or why she didn't have any visible injuries. We formed up and started moving back toward the base, leaving the circle of dead North Korean soldiers behind in the fog. The chemical smell still burned my throat with each breath, but I noticed the thick wall of mist had started to shift, becoming less dense as we put distance between ourselves and that killing ground. The unnatural silence began breaking apart too, replaced by the normal sounds of night insects and distant wind through the trees. Julian carried the girl without complaint, adjusting his grip every few minutes to keep her comfortable. She stayed quiet, occasionally whispering something to Christian in Korean. I caught fragments of the translation as we walked, more details about the shadow creature, about the screaming metal sounds it made when it attacked, about how the soldiers had tried to run but couldn't escape something that moved like smoke. The fog continued clearing as we approached Camp Liberty's perimeter, revealing the familiar outline of guard towers and fence line. But something was off about the base layout. I'd walked this approach hundreds of times, and tonight everything looked wrong. Additional sentries stood at positions that were normally unmanned during night shifts. The main flood lights swept back and forth in continuous patterns instead of their usual stationary illumination. Vehicles were parked in irregular clusters around the motor pool, not in the neat rows we maintained according to regulation. Extra Humvees positioned near buildings that never saw that kind of security presence.\"What's all the activity about?\" Elijah muttered, adjusting his radio equipment as we got closer. I studied the unusual deployment. \"No idea, but something's got them spooked.\" The main gate came into view, and I spotted Michael Garrison waiting for us with a full security detail. Six armed marines in combat gear flanked him, weapons ready but not quite pointed in our direction. Garrison himself wore full tactical equipment, including body armor and helmet, which struck me as excessive for a routine gate check. We approached the checkpoint, and Garrison stepped forward. His green eyes swept over our team, lingering on Julian and the girl he carried. \"Day,\" he said in his clipped Midwestern accent, \"orders are to process the civilian immediately.\" \"She needs medical attention first,\" I replied. \"Kid's been through hell.\" \"Medical will be provided as needed.\" Garrison gestured to two of his marines. \"Transfer the package to security personnel.\" Package, like she was cargo instead of a terrified child. I felt my jaw tighten, but Julian was already moving forward, gently setting the girl down next to Garrison. She looked up at us with wide, dark eyes, still clutching the hem of her blood-stained dress. Christian knelt down and spoke to her in Korean, probably explaining what was happening. She nodded and responded, pointing back toward the fog we'd emerged from. Whatever she said made Christian's expression darken. \"What did she tell you?\" I asked. \"She wants to know if we're going to help find her family,\" Christian said quietly. \"The ones the soldiers took three days ago.\" Garrison was already escorting the girl away from us, one hand on her shoulder as he guided her toward a cluster of buildings I'd never paid much attention to before. Building 7, according to the faded number painted on its concrete wall, a restricted facility with no windows and only one visible entrance. I'd been stationed at Camp Liberty for two years and had never seen anyone go in or out of that place. \"Where are they taking her?\" I called after Garrison. He didn't turn around. \"Debriefing and medical evaluation. Standard protocol for civilian contacts.\" The girl looked back at us once as they reached the building's entrance. One of Garrison's marines opened a heavy steel door and they disappeared inside. The door closed with a solid clang that echoed across the compound. \"That didn't feel right,\" Julian said, watching the empty space where they'd vanished. Before I could respond, Drew Noble appeared from the direction of the command building, walking toward us with his characteristic military bearing. Even at this hour, his uniform was perfectly pressed, every ribbon and insignia in regulation position. His dark brown eyes swept over our team as he approached. \"Gentlemen,\" he said in his formal East Coast accent, \"time for debriefing. Follow me.\" He led us to a small conference room in the administrative building, the same space where we'd received our mission briefing earlier that night. The fluorescent lights were harsh after hours in the fog, making everything look washed out and artificial. Drew gestured for us to take seats around the metal table while he remained standing at the front of the room. \"Report,\" he said simply. I gave him the basic facts, the fog bank, moving against the wind, radio communications failure, discovery of six dead North Korean soldiers arranged in a circle, the girl hiding in the trees, the competing orders from multiple officers. Drew listened without interruption, occasionally making notes on a clipboard. \"Describe the fog in detail,\" he said when I finished. \"Thick, dark, moved in a straight line from the north against the prevailing wind pattern. Chemical smell, like burning plastic mixed with something organic.\" \"Duration of communications blackout?\" \"Approximately 40 minutes from when the fog hit until we started moving back toward base.\" Drew made more notes. \"The civilian, describe her condition when found.\" \"Scared but physically unharmed, dress covered in blood but no visible injuries on her, spoke Korean, claimed to be from a village two kilometers north.\" \"Did any team members make physical contact with her?\" The question caught me off guard. \"Physical contact? Julian carried her back to base. Christian knelt next to her while translating. Why?\" Drew's expression didn't change, but he wrote something on his clipboard that took longer than my answer warranted. \"Standard decontamination protocol, the fog's chemical composition is unknown.\" That made some sense, but the way he asked the question suggested something more specific, like he was looking for particular information about who had touched her and when. \"What about the dead soldiers?\" Elijah asked. \"Those wounds weren't from any weapon I've seen.\" \"Investigation ongoing,\" Drew replied without looking up from his notes. \"Likely encounter with North Korean patrol unit resulted in casualties from unknown ordnance.\" Unknown ordnance, that was one way to describe three-inch claw marks that cut through military fabric and flesh with surgical precision. I thought about the girl's description of something that moved like smoke but cut like metal, something that attacked from the sky and made screaming sounds. \"Sir,\" I said carefully, \"the wound patterns were unusual, very specific. Three parallel marks, consistent spacing, minimal bleeding.\"The girl described... \"The girl is a traumatized child who witnessed combat,\" Drew interrupted. \"Her account is unreliable. Focus on observable facts.\" Observable facts. Six dead soldiers arranged in a perfect circle. Wounds that looked like massive predator damage in a region with no large predators. A fog bank that moved against the wind and interfered with radio communications. A blood-covered child with no injuries, who claimed her family had been taken by soldiers three days ago. Drew continued asking questions for another 20 minutes, covering every detail of our patrol route, timing, and observations. He seemed particularly interested in the sequence of events after we found the girl, asking multiple times about what she had said and how we had decided to bring her back to base. \"That's all for now,\" he finally said, closing his clipboard. \"Return to quarters. Standard debrief report due 0800 hours tomorrow.\" We filed out of the conference room and walked across the compound toward the barracks. The unusual security presence was even more obvious now that we were inside the fence line. Extra guards at every building entrance, floodlights that never stopped moving, the low rumble of vehicle engines running at positions that should've been empty. \"Think they'll tell us what's really going on?\" Christian asked as we reached our building. I looked back toward Building 7, its windowless concrete walls revealing nothing about what might be happening inside. The girl was in there somewhere, probably scared and confused, surrounded by people asking her questions she might not understand. \"Probably not,\" I said. The whole situation felt wrong, from the competing radio orders to Drew's strange questions about physical contact. \"But I don't think this is over.\" The next morning brought changes I could feel before I even left my quarters. Walking to the mess hall, I counted twice as many guards as usual posted around the compound. Military police with clipboards moved between buildings, stopping soldiers for what looked like impromptu head counts. Every time I turned a corner, someone in an MP armband was checking IDs and making notes. The mess hall conversation told the real story. Soldiers from three different units were missing from morning formation. Nobody used the word missing directly, but the way conversations stopped when officers walked by made it clear enough. Staff Sergeant Morrison from supply mentioned that two of his mechanics hadn't shown up for duty. A corporal from communications said his bunkmate's rack had been empty for two nights running. I grabbed my tray and found a spot near the back where I could listen without drawing attention. The talk was all speculation, but certain details kept coming up. Strange sounds from Building 7 during night hours. Not construction noise, but something that made the windows vibrate. Medical personnel getting called in at odd times, sometimes carrying equipment I didn't recognize. Orders coming down through channels nobody could trace back to a specific commanding officer. Christian sat down across from me, looking pale. Dark circles ringed his eyes, and his hands shook slightly as he cut into his eggs. \"You feeling all right?\" I asked. \"Headache won't go away,\" he said. \"Started yesterday morning. Julian's got the same thing, plus he's been throwing up.\" That caught my attention. \"Since when?\" \"Day before yesterday, right after we got back from patrol.\" Christian rubbed his temples. \"Elijah's got it worse though. They took him to medical yesterday afternoon.\" I set down my fork. \"What do you mean, took him?\" \"Fever spiked to 104. Medics came to the barracks with a stretcher.\" Christian's voice dropped. \"Haven't seen him since.\" After breakfast, I walked over to the medical facility. The building sat on the east side of the compound, a single-story structure that normally had maybe one guard during busy periods. Now three MPs stood at the entrance, and they'd set up a checkpoint with a folding table and paperwork. \"Here to see Knapp,\" I told the sergeant manning the table. He checked his clipboard without looking up. \"Name and unit.\" I gave him the information and watched him run his finger down a list of names. When he found mine, he made a mark and shook his head. \"Restricted access. Medical personnel only.\" \"He's on my team, I just want to check on him.\" \"Orders are orders, soldier. No visitors without authorization from Colonel Hunt or Major Payne.\" I could see through the medical facility's front windows. The waiting area that was usually empty had been converted into something that looked more like a quarantine ward. Beds lined both walls, and I counted at least eight soldiers lying under white sheets. Medics in full protective gear moved between them, checking IVs and monitoring equipment I'd never seen in a basic field hospital. Walking back toward my quarters, I noticed more changes. Vehicles parked in positions that made no tactical sense, unless you were preparing for some kind of lockdown. Extra communication equipment on rooftops. Guards at buildings that had never required security before. The second day brought news that made the situation clearer. Three more soldiers from other units had been transferred to medical. The official word was food poisoning from a contaminated shipment, but the timeline didn't match. These were all soldiers who'd been on patrol duty in the past week, all from different units, all eating in different facilities.Christian's condition worsened. He could barely keep food down, and the headaches had him squinting in normal light. Julian wasn't much better. Both of them spent most of their time in the barracks, sleeping or trying to sleep. I felt fine, which bothered me more than if I'd been sick too. Whatever was affecting my team had skipped over me completely. That meant either I'd been lucky or there was something different about my exposure to whatever had caused this. The third day, I got my answer about the missing soldiers. Walking past the administrative building around 14:00 hours, I saw a convoy of unmarked vehicles loading equipment and personnel. Medical stretchers went into the back of enclosed trucks, along with sealed containers that required two people to carry. The soldiers being loaded onto those stretchers weren't conscious. One of the medics supervising the loading was someone I recognized from the base hospital. When the convoy pulled out, I followed him back toward the medical facility. \"Where are they taking those men?\" I asked. He looked around to make sure nobody was listening, then shook his head. \"Specialized treatment facility, that's all I know.\" \"What kind of specialized treatment?\" \"The kind where they don't tell us what's wrong with the patients.\" He lowered his voice. \"Been doing this for 12 years, never seen anything like what these guys have.\" \"Like what?\" \"Can't say. But whatever they were exposed to, it's not responding to normal treatment.\" That evening, Christian collapsed during evening chow. Julian and I carried him to medical, where the MPs at the checkpoint waved us through without checking their list. The same medic I'd talked to earlier took one look at Christian and called for a stretcher. \"He's going to be fine, right?\" Julian asked. His own face was gray with exhaustion and fever. The medic didn't answer directly. \"We'll take good care of him.\" Julian lasted one more day before his fever spiked and he started vomiting blood. I carried him to medical myself, and this time, I didn't leave quietly. I pushed past the MP checkpoint and followed the stretcher into the treatment area. What I saw inside made my stomach drop. 20 beds filled with soldiers in various stages of the same condition. Some were unconscious with IVs running clear fluid into their arms. Others were awake, but staring at nothing, their eyes unfocused and glassy. The smell in the air was wrong. Not the usual antiseptic hospital smell, but something organic and sweet that made me think of rotting fruit. A doctor in full protective gear grabbed my arm and steered me back toward the entrance. \"You can't be in here without authorization.\" \"Those are my teammates. I wanna know what's wrong with them.\" \"Unknown pathogen. We're doing everything we can.\" \"Unknown pathogen from what?\" He didn't answer, just kept pushing me toward the door. On the fourth night, I got called to Drew's office. The message came through official channels, delivered by an MP who waited while I changed into dress uniform. The walk across the compound took longer than usual because of the checkpoints that had been set up at every major intersection. Drew's office was in the command building, second floor, with windows that looked out over the motor pool. I'd been there twice before for routine briefings, and it had always felt like a normal military workspace. Tonight, something was different. Extra communication equipment lined one wall, and maps covered his desk that showed areas well beyond our normal patrol sectors. \"Wait outside,\" the MP told me, pointing to a chair in the hallway. \"Noble will call you in when he's ready.\" I sat down and tried to look relaxed, but the voices coming through the door made that impossible. Drew was talking to someone, but not in English. The other voice had a heavy accent I couldn't place, and they were speaking what sounded like a mix of Korean and English. \"The Kumiho legend describes shape-shifting entities that take the form of beautiful women,\" the accented voice was saying. \"They lure men to isolated locations and feed on their hearts and livers. Traditional accounts suggest they can mimic human appearance perfectly, but maintain certain fox-like characteristics.\" Drew's voice was clearer. \"What about the anomalous readings from Building Seven? Consistent with the presence of a supernatural entity. The subject has been uncooperative during questioning, but thermal imaging shows body temperature fluctuations outside normal human parameters.\" My blood went cold. They were talking about the girl. \"And the exposure effects?\" \"Progressive deterioration in subjects who had direct physical contact. The pathogen appears to be transmitted through touch, possibly through some form of supernatural contamination.\" \"Recommendations for containment?\" \"Immediate evacuation protocols for all primary exposure subjects. Permanent isolation until we can determine the extent of contamination.\" I realized they were talking about my team. Julian, Christian, Elijah, they were all getting sick because they'd touched the girl. Julian had carried her, Christian had knelt beside her, Elijah had been close enough to take photographs. \"What about the subject who shows no symptoms?\" \"Day unknown. Either he maintained sufficient distance to avoid contamination or he has some natural immunity. Recommend continued monitoring.\" The voices moved away from the door, and I heard papers rustling.They were wrapping up whatever meeting this was, which meant Drew would call me in soon. I had maybe two minutes to process what I just heard. The girl wasn't human. The sickness affecting my team wasn't a pathogen in any normal sense, and Drew had been expecting this from the beginning. The voices moved away from the door and papers rustled as they wrapped up whatever meeting this was. Drew would call me in any second now. I had maybe two minutes to process what I just heard, but my mind was already racing ahead to what came next. Permanent isolation, that's what they'd said about my teammates. Not treatment, not recovery, isolation. And they were talking about me like I was some kind of test subject they needed to keep monitoring. The way Drew had discussed it so casually, like he was ordering supplies instead of deciding whether to lock me away forever. I stood up from the chair. My legs steadier than I expected them to be. The hallway stretched in both directions, empty except for the MP who had escorted me here. He was positioned near the stairwell, back turned, checking something on his radio. Standard protocol would be for him to wait until Drew called me into the office, then escort me back to my quarters afterward. But there wouldn't be any afterward if I walked through that door. My dress uniform felt too tight suddenly, the collar cutting into my neck. I tugged at it without thinking, then caught myself. Had to stay calm, act normal. The MP glanced over his shoulder at the movement, but I just nodded like everything was fine. He went back to his radio. The conversation behind Drew's door had gone quiet. I could hear him moving around, probably organizing his papers, getting ready to call me in. Once I entered that office, I wouldn't be leaving as a free man. They'd have some story ready. Medical observation, protective custody, something that sounded reasonable on paper, but I knew what it really meant. I thought about Christian collapsing during chow, the way his skin had gone gray and his hands wouldn't stop shaking. Julian vomiting blood before I carried him to medical. Elijah burning up with fever, delirious, and barely conscious when they took him away on that stretcher. All of them had touched her, the thing that looked like a little girl in a blood-soaked hanbok. And now, they were being shipped off to some facility where nobody would ask questions about what happened to them. The smart thing would be to run right now while the MP wasn't watching, while Drew was still organizing his paperwork. I could slip down the back stairs, find a way out of the building, get off base before anyone realized I was gone. But running meant abandoning my teammates completely. It meant accepting that whatever was happening to them would continue happening. I looked down the hallway toward the main staircase. Three doors between me and the stairs, all of them closed. No sounds from behind any of them, which meant the offices were either empty or the occupants were being very quiet. The emergency exit at the far end of the hall had a sign warning that opening it would trigger an alarm, but I'd seen maintenance crews use it during the day without any alarms going off. Probably only armed during certain hours. My hands felt steady as I checked my watch. 22:45. Late enough that most of the administrative staff would be gone, early enough that the night shift might not be fully settled into their routines yet. If I was going to move, it had to be now. The MP's radio crackled with some kind of status report. He responded in a low voice, giving his position and confirming all secure. Standard check-in, which meant he'd have another one in 15 or 20 minutes. By then, Drew would've called me into the office and discovered I wasn't there anymore. I started walking toward the emergency exit, keeping my footsteps quiet but not obviously sneaking. Just a soldier moving with purpose, like I had somewhere to be. The MP didn't turn around. His radio conversation continued, something about perimeter sweeps and vehicle checks. The heightened security I'd been noticing for days was even more extensive than I'd realized. The emergency exit door was steel with a push bar across the middle. No visible alarm contacts that I could see, but that didn't mean much. I pressed my ear against the metal and listened. Nothing from the other side except distant vehicle engines and the normal sounds of a military base at night. I took a breath and pushed the bar. The door opened silently. No alarm, no flashing lights, no sudden commotion from behind me. Cool night air hit my face as I stepped onto a metal platform with stairs leading down to ground level. The administrative building's backside faced a maintenance area where they kept construction equipment and utility vehicles. Plenty of shadows, plenty of cover. I closed the door carefully behind me and moved down the stairs. My dress shoes weren't ideal for sneaking around, but they'd have to do. The maintenance area was dimmer than the rest of the base, with only a few scattered lights that left large pools of darkness between buildings. I stuck to those dark areas, moving from shadow to shadow like we'd practiced in training. My quarters were on the other side of the base, which meant crossing several open areas where guards might spot me, but I needed my gear, civilian clothes, my personal weapon, and the emergency kit I'd put together during my first week here. Every soldier learned to prepare for situations where the normal chain of command might not be available to help you. The route I chose took me behind the motor pool, past the communications building.... and along the backside of the enlisted barracks. I saw more guards than usual, but they were focused on the main pathways and building entrances. Nobody was watching the spaces between buildings where maintenance crews normally worked. 20 minutes later, I was outside my barracks building. Getting inside without being seen would be the tricky part. The main entrance had a guard and there were probably MPs inside checking rooms or waiting for soldiers to return. But there was a window near the back that didn't latch properly. I'd noticed it weeks ago and never reported it because small security flaws sometimes became useful. The window was on the first floor, ground level, leading into a storage room next to the laundry area. I worked it open carefully and climbed through, landing quietly on concrete floor between stacks of cleaning supplies. The hallway beyond was empty, but I could hear voices from the common area near the front entrance. At least two people, maybe three, talking in the low tones that meant business rather than casual conversation. My room was on the second floor. I took the back stairs, avoiding the main staircase that would put me in view of whoever was in the common area. The second floor hallway was dark except for emergency lighting, and most of the doors were closed. Some of my neighbors were probably in medical or already transferred somewhere else. The base was emptying out one sick soldier at a time. My door was unlocked, which should have been a warning sign. I always locked it, even for short trips to the mess hall or briefings. But there wasn't time to be cautious. I needed my gear and I needed to get out before someone discovered I wasn't in Drew's office anymore. The room looked normal at first glance. Bed made. Footlocker closed. Personal items where I'd left them. But my wall locker was open, and I always kept that locked too. Someone had been through my things, probably looking for anything that might indicate where I'd go if I ran. They hadn't found my real emergency kit because I'd hidden it somewhere they wouldn't think to look. I changed out of my dress uniform quickly, pulling on civilian clothes, jeans, dark shirt, jacket that would help me blend in outside the base. My personal sidearm was still in its hiding place behind the loose panel near my desk. Nine-millimeter pistol with two extra magazines. Not much firepower, but better than nothing. The emergency kit was taped inside the ventilation duct above my closet, wrapped in plastic to keep it dry. Cash, fake ID I'd acquired during leave time, basic medical supplies, and a prepaid cellphone that couldn't be traced back to me. Voices in the hallway made me freeze. Two men walking slowly, checking door numbers. MPs doing a room by room search. Probably looking for me specifically. They were three doors down and moving in my direction. The window in my room was too high and faced the wrong direction, but the fire escape was accessible from the window at the end of the hall if I could reach it without being seen. I grabbed my gear and moved to the door, listening as the voices got closer. Two doors away now, and one of them was trying door handles to see which rooms were unlocked. I waited until they entered the room next to mine, then slipped out and moved quickly toward the end of the hall. The fire escape window was old and painted shut, but I got it open with some effort. The metal platform outside was rusty but solid, and the ladder down to ground level was clear. Getting off base was the next problem. The main gate would have my name on a list by now, and the vehicle checkpoints would be watching for anyone trying to leave unexpectedly. But during my first week here, I'd done what every smart soldier does. I'd found the unofficial ways in and out that maintenance crews and local workers used when they didn't wanna deal with formal security procedures. There was a drainage culvert that ran under the fence on the east side, near where the Korean contractors brought supplies for the mess hall. It was big enough for a person to crawl through, and it came out in a grove of trees about half a kilometer from the base perimeter. From there, I could make my way to the observation post I'd spotted during previous patrols. The observation post was an abandoned Korean military position from the 1950s, built into a hillside with a clear view of Camp Liberty. It had been empty for decades, but the concrete structure was still solid and the camouflage netting would hide me from casual observation. Most importantly, it was close enough to watch what was happening on base, but far enough away that normal patrols wouldn't find me. The crawl through the drainage culvert took 20 minutes and left me covered in mud and standing water. But I made it to the tree line without triggering any alarms. From there, it was a two-kilometer hike through rough terrain to reach the observation post. I moved carefully, using the night vision techniques we'd learned in training to avoid obstacles and stay oriented in the darkness. The observation post was exactly as I remembered it, a concrete bunker built into the hillside with narrow windows facing south toward Camp Liberty. The interior was empty except for some old equipment that Korean forces had left behind, but it was dry and defensible. I set up my gear in the back corner where I couldn't be seen from outside, then moved to the main observation window. Camp Liberty spread out below me like a miniature city, all lights and movement and organized activity. Even at this distance, I could see that something major was happening. Vehicle convoys were arriving at the main gate, headlights streaming in from the south in a steady procession. Not normal supply trucks or routine transfers. These were military vehicles with official markings that I recognized from intelligence briefings.I pulled out the binoculars from my emergency kit and focused on the convoy. Humvees with communications equipment, transport trucks with canvas covers, and several vehicles I didn't recognize with specialized equipment mounted on top. The markings were from the 8th Army's Special Investigations Unit, the people who handled incidents that regular military police couldn't deal with. They were setting up some kind of operation center in the administrative area with communication cables being run between buildings and additional lighting being installed around the perimeter. Whatever was happening wasn't just about my team anymore. This was big enough to bring in specialists from outside the base. I watched through the binoculars as soldiers unloaded equipment from the trucks. Medical gear, but not the normal kind. Isolation units and containment systems that looked more like something from a laboratory than a field hospital. They were preparing for something that required serious contamination protocols. A refrigerated truck pulled up to the medical facility, and I watched as personnel in full protective gear began loading body bags into the back. I counted six bags, then eight, then lost track as more trucks arrived. The soldiers who had been getting sick weren't just being transferred for treatment. Some of them were already dead. The realization hit me like a physical blow. Christian's pale face and trembling hands, Julian vomiting blood, Elijah burning up with fever. They weren't just sick. They were dying from whatever that thing in the hanbok had done to them, and the people in charge had known it would happen. Movement near the medical facility caught my attention. Three figures being escorted by armed guards, moving slowly like they were having trouble walking. Even at this distance, I recognized them. Elijah was first, supported by two MPs because he couldn't stand on his own. His head hung forward and his legs dragged with each step. Christian came next, also supported by guards, but more alert than Elijah. He kept looking around like he was trying to understand where they were taking him. His face was gray in the artificial lighting, and even from here, I could see how much weight he'd lost. Julian was last, and he was fighting them. Not seriously. He was too weak for that, but he kept trying to pull away from the guards holding his arms. One of the MPs said something to him, probably a threat, because he stopped struggling and let them guide him toward a waiting vehicle. They weren't just being transferred. They were being taken away in restraints, like prisoners or dangerous patients who couldn't be trusted to cooperate. The guards were treating them like they might be infectious, keeping their distance even while providing support. Three separate vehicles waited for them. Not ambulances or medical transports, but unmarked vans with government plates. Each of my teammates was loaded into a different vehicle. No contact between them. No chance to communicate or coordinate. Standard procedure for handling people you didn't want comparing stories or planning escapes. I watched the vehicles leave the base and disappear into the darkness, heading south towards Seoul and whatever facility was equipped to handle supernatural contamination cases. My teammates were gone, and I was the only one left who knew what had really happened during that patrol. The thing that had killed those North Korean soldiers was still in Building 7. The people in charge were covering up what it really was, calling it an unknown pathogen instead of acknowledging that something impossible had happened. And they were willing to let soldiers die to maintain that cover story. I lowered the binoculars and sat back against the concrete wall. The observation post felt colder now. The reality of my situation settling in like the night air. My entire team was gone, dead, dying, or disappeared into some black site facility where nobody would ask inconvenient questions, and I was next on their list. The smart move would be to run as far as possible, get off the peninsula, find a way back to the States. Disappear into civilian life and never look back. But that would mean abandoning any chance of helping my teammates, assuming they were still alive to help. It would also mean letting whatever was in Building 7 continue doing what it was doing. I thought about the girl, the thing that looked like a girl sitting against that pine tree with blood covering her hanbok. The way she'd spoken to Christian in Korean, sounding scared and helpless. The way Julian had carried her without hesitation, trying to comfort someone he thought was just a traumatized child. We'd all believed she was human because that's what she'd wanted us to believe. The Korean voice in Drew's office had mentioned shape-shifting, something about fox entities that could mimic human appearance. Kumiho, they'd called it. I didn't know much about Korean folklore, but the description matched what we'd encountered. Something that looked harmless, but killed through contact, feeding on people in ways that modern medicine couldn't understand or treat. More vehicles were arriving at the base. I raised the binoculars again and watched as personnel in hazmat suits began setting up additional equipment around Building 7. Floodlights, monitoring devices, and what looked like containment barriers. They were taking the situation seriously now, treating it like the supernatural threat it actually was instead of pretending it was just another medical emergency. A convoy of black SUVs pulled up to the command building, and I watched as civilians in expensive suits got out and were escorted inside. Not military personnel. These were people with authority that came from outside the normal chain of command.... government specialists probably, or contractors who dealt with situations that officially didn't exist. The base was transforming into something else entirely. What had been a routine border patrol station was becoming a containment facility, complete with outside oversight and specialized personnel. They were preparing for a long-term operation, not a quick cleanup. I checked my watch: 3:15 in the morning. Drew would have discovered I was missing hours ago, and by now, they'd have search teams looking for me. But they'd be checking the obvious places first, transportation hubs, local towns, anywhere a soldier might go if he was trying to get off the peninsula quickly. It would take them time to expand the search to include abandoned positions like this one. The observation post gave me an advantage, but it wouldn't last forever. Eventually, they'd bring in tracking dogs or aerial surveillance, and then my hiding spot would become a trap. I needed to use the time I had to gather more information about what was really happening. Through the binoculars, I could see into some of the lighted windows on the base. The command building was busy with activity, people moving between rooms and carrying equipment. The medical facility had been completely taken over by the hazmat teams, with additional personnel arriving every few minutes. But it was Building 7 that held my attention, the windowless concrete structure where they'd taken the girl after our patrol. More lights had been set up around it, and I could see guards posted at positions that gave them clear fields of fire in all directions. Whatever was inside that building, they were taking no chances with it escaping. As I watched, a new vehicle arrived, a specialized truck with equipment I didn't recognize mounted on the back. The personnel who got out were wearing full protective gear, the kind used for handling extremely dangerous biological or chemical threats. They began setting up additional monitoring equipment around Building 7's perimeter. One of them carried a device that looked like a radiation detector, sweeping it back and forth as he walked around the building. But the readings he was getting seemed to surprise him, because he kept checking the device and calling his colleagues over to verify what he was seeing. Whatever they were detecting wasn't radiation or any conventional hazard. The activity continued throughout the night. More specialists arrived, more equipment was installed, and the security perimeter around Building 7 was expanded twice. By dawn, the entire area looked like a scientific research station rather than a military facility. I was getting hungry and thirsty, but I didn't dare leave the observation post during daylight. The emergency rations in my kit would keep me going for a few days, and there was a water source nearby that I could reach after dark. For now, I needed to stay hidden and keep watching. The morning brought even more activity. A helicopter landed near the command building, and I watched as someone important enough to rate air transportation was escorted inside. Military officials came and went in a steady stream, and the number of vehicles on base had doubled since the night before. But the most significant development was what I saw happening near the medical facility. The refrigerated trucks were being loaded again, but this time, I could see the process more clearly in daylight. The body bags being carried out weren't just from soldiers who had gotten sick recently. Some of them looked like they'd been in storage for a while. They were cleaning house, removing evidence of how long this had been going on. The official story would probably be that a small number of soldiers had been affected by an unknown pathogen, with casualties kept to a minimum through quick action and proper medical protocols. But the reality was that people had been dying from supernatural contact for longer than anyone wanted to admit. I thought about all the missing soldiers I'd heard about in the mess hall, the ones who hadn't shown up for formation or had disappeared from their quarters. How many of them had encountered something like what we'd found in the fog? How many had been quietly transferred to facilities where their deaths could be managed without creating panic or difficult questions? The base was operating under complete information control now. No unauthorized communications, no personnel leaving without escort, no contact with the outside world except through official channels. Anyone who might have knowledge of what was really happening was being isolated or eliminated. I was the only witness left who was still free, still able to tell the truth about what had happened during that patrol. But I was also the only person who might be able to do something about the thing they were keeping in Building 7. The question was what I could actually accomplish on my own. I had basic combat training and survival skills, but I was facing an enemy that could kill through touch and an organization that was willing to murder soldiers to keep its secrets. The smart tactical assessment was that I had no chance of success and should focus on escape and survival. But I kept thinking about my teammates, about Julian carrying what he thought was a scared child, about Christian trying to comfort her with gentle words in Korean. They'd done the right thing, the human thing, and it had gotten them killed or worse. Someone needed to be held accountable for that. The sun was fully up now, and the base below looked almost normal except for the extra security and the specialized equipment around Building 7. From a distance, it could've been any military installation conducting routine operations. Only someone who knew what to look for would notice the signs of a supernatural containment operation. I settled in to wait for nightfall when I could move safely and maybe get closer to the base for better intelligence.I had food, water, and shelter for several days if necessary. More importantly, I had a clear view of everything happening below and time to plan my next move. The observation post felt like a good place to make my stand, at least for now. I was the only person left who knew the truth, and I wasn't going to let them bury it along with my teammates. I stretched my legs for the first time in hours, feeling the cramping in my calves from staying crouched behind the concrete barrier. The observation post wasn't built for comfort. The Korean engineers who constructed this place in the '50s had designed it for function, not long-term occupancy. Every surface was rough concrete or rusted metal, and the narrow firing slits that gave me perfect views of Camp Liberty below also funneled cold air directly across my position. My emergency rations were running low. The protein bars and water purification tablets had kept me going, but I was down to maybe two days of food if I stretched it. The stream that ran through the valley provided water but getting to it meant exposing myself during daylight hours. I'd been making the trip at night crawling down the hillside with my empty canteen and filling it in the dark while listening for any sounds that might indicate patrols in the area. Through the binoculars, I watched the same routine I'd been observing for nearly a week. Morning shift change at 0600. Convoy arrivals around noon with more specialists and equipment. Evening briefings in the command building. The base had settled into what looked like a permanent containment operation, with no signs of returning to normal patrol schedules or training exercises. Building 7 remained the center of all activity. The specialists had installed more equipment around it every day, setting up monitoring stations and running cables between various devices that I couldn't identify from this distance. The building itself looked different now somehow. The concrete seemed darker, and there were stains around the foundation that hadn't been there before. Whatever was happening inside, it was affecting the structure itself. I'd been keeping a mental count of personnel going in and out. Fewer people were entering the building now compared to the first few days. The hazmat suits had become standard equipment for anyone who got within 50 meters of the place. Even the guards positioned around the perimeter wore protective gear and rotated out every two hours instead of the usual four-hour shifts. The refrigerated trucks had stopped coming after the third day, but not before I'd counted 23 body bags being loaded. 23 soldiers dead from whatever had happened during our patrol. The official story was food poisoning according to the radio chatter I'd intercepted. But food poisoning didn't require hazmat teams and body bags. My teammates were supposed to be at a medical facility receiving treatment. That's what I'd told myself for the first few days, even though I'd seen them loaded into separate vehicles and driven south toward Seoul. Even though the radio traffic I'd monitored mentioned transport protocols and containment procedures rather than medical care. But I knew better now. I'd been lying to myself because the alternative was too much to accept. On the morning of the seventh day, I was adjusting the frequency on the field radio I'd found in the observation post when I heard the first explosion. Not an explosion exactly. More like a deep rumble that seemed to come from underground, followed by a sound that made my teeth ache. Through the binoculars, I could see smoke rising from Building 7, but it wasn't normal smoke. It moved wrong, swirling in patterns that defied the wind direction and maintaining a dark red color that reminded me of dried blood. The base erupted into activity. Sirens started wailing, and personnel came running from every direction. The hazmat teams that had been working around Building 7 were backing away. Their equipment abandoned as they retreated to what looked like predetermined positions around the perimeter. Then I saw the flames. They weren't normal flames either. They burned with the same red color as the smoke, and they seemed to be consuming the building from the inside out. The concrete walls were glowing, actually glowing, as if they were being heated from within. The flames didn't spread like regular fire. They moved in deliberate patterns, following the walls and climbing toward the roof in organized lines that looked almost intentional. Through the radio, I picked up fragments of communication. \"Containment breach. Emergency protocols. All personnel to maintain minimum safe distance.\" The voices were strained. Professional calm barely covering what sounded like panic. I watched for three hours as the fire consumed Building 7. The hazmat teams worked frantically around the perimeter, setting up additional equipment and spraying something that wasn't water onto the flames. Whatever they were using created more of that red smoke, and I could see personnel being rotated out frequently as if prolonged exposure to the smoke was dangerous even with protective equipment. More trucks arrived. Not the refrigerated ones this time, but vehicles with specialized equipment I didn't recognize. Teams in full protective suits began removing items from the burning building, loading them into sealed containers that required two people to carry. The containers were immediately placed into lead-lined trucks and driven off base under heavy escort. But it was the body bags that made everything clear. They started bringing them out around noon when the fire had burned down to a smoldering glow, but the building was still too hot to approach safely.The first team went in wearing what looked like radiation suits, and they came out carrying a stretcher with a black bag. Then another. Then another. I counted 12 bags before I stopped counting. 12 people had died inside Building 7, not from the fire because the fire had only started that morning. They died before the fire, and the building had been burning for hours before anyone could safely retrieve the body. The radio chatter became clearer as the day progressed. I caught fragments about transport complications and facility notifications, medical examiner protocols and next of kin procedures. But the most important transmission came through around 1500 hours when someone with Colonel Hunt's voice was giving a status report to what sounded like a superior officer. \"Transport casualties confirmed,\" Hunt's voice said through the static. \"'Knap, Hoffman and Burgess all expired during transfer to the facility. Official cause of death listed as complications from unknown pathogen contracted during patrol duties. Recommend immediate location and containment of remaining team member day for medical evaluation and debriefing.\" The transmission cut out after that, but I'd heard enough. Knap, Hoffman and Burgess; Elijah, Christian and Julian, all dead. Not sick. Not being treated at some medical facility. Dead. They died during transport, which meant they'd probably been dying from the moment we'd encountered that thing in the fog. The girl who wasn't a girl, the Kumiho that had somehow infected everyone who touched her with whatever supernatural contamination she carried. Julian had carried her. Christian had knelt beside her. Elijah had gotten close enough to take photographs. And now they were all dead, loaded into body bags and processed like casualties of war. I was the only one left, the only member of the patrol who'd survived, because I'd been smart enough or lucky enough to keep my distance from her. But that also made me the only witness to what had really happened out there in the fog, the only person who knew the truth about what the military was containing in Building 7 and what had killed my teammates. Hunt's voice on the radio had made their intentions clear. They weren't looking for me to provide medical care or debriefing. They were looking for me for containment, which meant they planned to add my name to the casualty list, right alongside Elijah, Christian and Julian. I watched the smoke continue to rise from Building 7 as the sun started to set. The hazmat teams were still working, but their movements had become more routine, less frantic. Whatever emergency had caused the fire was under control now, but the building was completely destroyed. The concrete walls were cracked and blackened, and portions of the roof had collapsed inward. Whatever had been contained in there was either dead or had been moved to a new location. But the body count suggested that containing it had cost more lives than anyone had anticipated. The radio crackled with routine traffic now, shift changes and supply requests. Normal base operations continuing around the edges of the containment zone. But I noticed that personnel were being rotated out more frequently than usual, and new faces were arriving on every convoy. They were bringing in fresh soldiers to replace the ones who'd been exposed, the ones who'd been loaded into body bags and driven away in refrigerated trucks. I thought about my teammates, about how they'd looked when I'd last seen them being loaded into those unmarked vehicles. Elijah had been barely conscious, supported by guards because he couldn't walk on his own. Christian had been gray-faced and shaking, but still aware enough to look confused about what was happening to him. Julian had been fighting weakly against the restraints. His usual smart remarks replaced by fevered mumbling. They'd trusted the people putting them in those vehicles. They'd thought they were being taken for medical treatment, that they were going to recover and eventually return to duty. They'd had no idea they were being driven to their deaths. But I knew now. I knew what the military was willing to do to contain information about supernatural threats. I knew how quickly they could make soldiers disappear and generate paperwork to explain their deaths. I knew that my name was already on their list and that they were actively searching for me with the same equipment and personnel they'd use to hunt enemy combatants. The observation post had kept me safe for six days, but it wouldn't protect me indefinitely. Eventually, they'd expand their search pattern to include the surrounding hills. Eventually, they'd find the Korean military positions and check them for signs of occupation. But for now, I was the only person alive who knew the truth about what had happened during our patrol, the only witness to the supernatural threat that had killed my teammates and an unknown number of other soldiers. I couldn't stay at the observation post forever. My food had run out completely the night before, and the water purification tablets were down to three. Worse, I'd seen patrol teams expanding their search grid toward the hills where Korean positions dotted the landscape. They'd find me eventually. The decision to leave came when I spotted two Humvees heading up the access road that wound through the valley below my position. Through the binoculars, I could make out soldiers with detection equipment, the kind used for tracking radio signals or heat signatures. They were being methodical about it, stopping every few hundred meters to sweep the area.I packed my emergency kit, checked the 9 mm one last time, and started moving before dawn. The trek down the backside of the hill took me through dense brush that tore at my civilian clothes. I ditched the uniform days ago, keeping only the boots and tactical vest under a jacket I'd found in the observation post. Better to look like a lost hiker than a deserting Marine. The first 24 hours were about distance. I stuck to ridge lines and avoided roads, moving south towards Seoul using landmarks I remembered from maps. My stomach cramped from hunger, but I'd been through worse during training. The bigger problem was the constant checking over my shoulder, waiting for helicopters or search teams to appear on the horizon. On the second day, exhaustion forced me to take shelter in an abandoned farmhouse. The roof had partially collapsed, but one room remained intact. I found a working hand pump in the yard and drank until my stomach hurt. While resting, I made the decision that had been building since I left the observation post. I needed help, and there was only one person I could trust. Paul had given me an emergency contact protocol years ago when I first deployed. He'd insisted on it, said if anything ever went sideways, I should use the system he'd set up through his police connection. At the time, I thought he was being paranoid. Now, that paranoia might save my life. The nearest town had a PC bang, one of those internet cafes that stayed open all night. I paid cash for two hours of computer time and accessed the encrypted email service Paul had shown me. The message I sent was simple. \"Need immediate extraction. Situation compromised. Will explain when safe.\" I included coordinates for a location 10 kilometers south of my current position and signed it with the code name he'd assigned me. The response came within six hours. Paul had contacts in Seoul, people who moved things quietly for law enforcement agencies. Within 48 hours, I was sitting in a safe house apartment with new civilian identification documents spread across a kitchen table. The man who'd arranged everything went by Kim, though I doubted that was his real name. He spoke perfect English with a slight accent and asked no questions about why I needed to disappear. \"Your brother's friends have long reach,\" Kim said, examining the military ID I'd handed over. \"But this will need to be destroyed completely. No traces.\" I watched him feed my Marine identification into a small furnace in the apartment's back room. Two years of service gone in 30 seconds of flame. The civilian documents he provided looked authentic. Driver's license, passport, even a credit history that went back three years. According to the paperwork, I was Michael Harrison, a technical consultant from Ohio. \"There's a cargo flight leaving Incheon Airport tomorrow night,\" Kim continued. \"Manifest shows agricultural equipment bound for Yokota Air Base in Japan. You'll be listed as a logistics coordinator. Once you're on base, your brother's people will handle the rest.\" The flight to Japan was the longest eight hours of my life. I spent most of it in a cargo hold that smelled like fertilizer, wondering if the plane would be diverted or if MPs would be waiting when we landed. But Kim's people were thorough. The customs inspection was routine, and the sympathetic personnel Paul had arranged were exactly where they said they'd be. Master Sergeant Rodriguez met me at the cargo terminal. He was career military, close to retirement, and had worked with Paul's contacts before. \"Your brother explained the situation,\" he said as we walked toward the base administrative building. \"'Not the details, but enough to know you need a clean exit.' The medical discharge process took three weeks. Rodriguez had arranged for me to be evaluated by a Navy psychiatrist who specialized in combat stress cases. I didn't have to lie much. The nightmares about the girl in the bloodstained hanbok were real, and the paranoia about being watched was justified. The doctor diagnosed acute stress reaction and recommended immediate stateside treatment. 'You'll have full benefits,' Rodriguez explained as he handed me the discharge papers. \"'Medical retirement, disability compensation, the works. As far as the system knows, you completed your tour and came home sick. Nothing unusual about that.' The flight back to the United States was commercial, first class, paid for by Paul through channels I didn't ask about. I spent most of it staring out the window, trying to process the fact that I was actually going home. For the first time in months, I wasn't looking over my shoulder or planning escape routes. Paul met me at Cleveland-Hopkins Airport. He looked older than I remembered. More lines around his eyes, grayer at the temples. When he saw me coming through the terminal, his expression shifted from relief to concern. 'Jesus, Eddie, you look like hell.' I probably did. I'd lost at least 20 pounds, and the constant stress had left me with a permanent tension in my shoulders that wouldn't go away. But I was alive, which was more than I could say for Elijah, Christian, and Julian. 'Thanks for the help,' I said as we walked toward his car. 'I know it wasn't easy to arrange.' Paul stopped walking and turned to face me. \"What happened over there? And don't give me some bullshit about combat stress. I've seen soldiers come home broken. This is different.\"\nI thought about telling him everything, about the patrol, the dead North Korean soldiers, the girl who wasn't human, the teammates who died from supernatural contamination. But how do you explain something like that to someone who's never seen it? How do you make it sound like anything other than a complete mental breakdown? \"Some things went wrong,\" I said finally. \"People died who shouldn't have. I saw things that don't make sense. The military wanted to bury it all, including me.\" Paul studied my face for a long moment. He was good at reading people, came with the job. Whatever he saw there convinced him not to push for more details. \"Okay,\" he said. \"We'll deal with the rest later. Right now, you need food, sleep, and time to decompress.\" He'd arranged for me to stay at his apartment in downtown Cleveland while I figured out my next move. It was a nice place, two bedrooms, good security, close to his precinct. For the first few weeks, I barely left the building. I slept 12 hours a day and spent the rest of the time trying to readjust to civilian life. The nightmares continued, always the same sequence, the fog rolling in against the wind, the circle of dead soldiers, the girl in the blood-stained hanbok pointing toward the trees. Sometimes I'd wake up expecting to see her standing at the foot of my bed, those dark eyes staring at me with intelligence that was too old, too knowing for a child's face. Paul noticed, but didn't comment directly. He'd make extra coffee in the mornings when he heard me moving around at 3:00 AM, or he'd suggest we go for walks when I'd been cooped up too long. He was giving me space to heal while making sure I wasn't completely alone. The first sign that my problems had followed me home came six months later. I'd moved into my own apartment by then, a small place in Lakewood with good sight lines and multiple exit routes, old habits from Korea that I couldn't shake. I was settling into something that resembled a normal routine, job interviews, grocery shopping, trying to figure out what civilians did with their time. The knock on my door came on a Tuesday afternoon. Two men in dark suits, federal badges, serious expressions. They introduced themselves as Agents Morrison and Blake, said they were conducting a routine follow-up investigation related to my military service. \"Just a few questions about your time in Korea,\" Morrison said as I led them into my living room, standard procedure for personnel involved in classified incidents. They knew things they shouldn't have known, details about the patrol route, the timeline of events, even specifics about Building 7 that weren't in any official report I'd filed. Their questions were precise, probing, designed to test whether I was holding back information. \"You were the only member of your patrol team to return to base that night,\" Blake noted, consulting a file folder. \"Can you walk us through your decision-making process?\" I gave them the same story I'd told Drew during the debriefing. Found the girl, brought her back, followed orders. I didn't mention the supernatural elements, the competing radio transmissions, or what I'd overheard about Kumiho legends. They listened without taking notes, which told me the conversation was being recorded. \"Your teammates developed complications after the mission,\" Morrison continued. \"Were you aware of any unusual symptoms or behaviors during the patrol?\" \"They got sick,\" I said. \"Food poisoning, according to the official report.\" Blake exchanged a glance with Morrison. \"The medical records indicate a more complex situation, unknown pathogen, possible contamination event. You showed no symptoms despite identical exposure conditions.\" They were fishing, trying to get me to reveal what I knew about the supernatural contamination. The fact that they were asking meant someone in the military had briefed them on the real situation, which meant the coverup extended beyond Camp Liberty. The interview lasted two hours. They left their business cards and said they might have follow-up questions. I watched from my window as they got into a black sedan parked across the street. The license plate was government issue. That sedan, or ones just like it, became a regular fixture in my neighborhood. Always parked with a clear view of my building, always occupied by men in suits who pretended to read newspapers while watching my windows. I started varying my routine, taking different routes to the grocery store, leaving at random times. The surveillance teams adapted to match. The first search happened three weeks after the initial interview. I'd gone out for a job interview, came back to find my apartment exactly as I'd left it, except for tiny details that were wrong. The coffee mug I'd left on the kitchen counter had been moved two inches to the left. A book on my nightstand was facing the opposite direction. Someone had been through my belongings very carefully, trying not to leave obvious signs. They were looking for evidence, probably hoping I'd kept photos, documents, or recordings from Korea. What they didn't understand was that the real evidence wasn't something you could photograph or document. The real evidence was in my head, in the memories of things that shouldn't exist. The second search was less subtle. I came home from a movie to find my door lock had been picked and my apartment thoroughly tossed, drawers pulled out, closet emptied, even the refrigerator moved away from the wall. They tried to put everything back, but it was obvious they'd been frustrated by finding nothing incriminating. I called Paul that night.\"I need to move,\" I told him. \"The federal people are escalating.\" \"How bad?\" he asked. \"Bad enough that staying put isn't an option anymore.\" Paul helped me relocate to a different part of town, a furnished apartment I could rent month-to-month under a fake name. The surveillance teams found me within two weeks. This time they were more aggressive, following me to job interviews, sitting in nearby restaurants when I went out to eat, making their presence obvious. The message was clear. We know where you are. We know what you're doing. And we're not going away. I moved again six months later, this time to a different state entirely. Paul had a contact in Pittsburgh who could help with new documentation and a clean apartment lease. I thought distance might help, that maybe the federal interest would fade if I stayed quiet and didn't cause problems. I was wrong. Within a month, the same black sedans were parked outside my new building, the same pattern of subtle searches and obvious surveillance. Wherever I went, whatever name I used, they found me. After the third relocation, I stopped trying to run. They clearly had resources I couldn't match and patience I couldn't outlast. Instead, I focused on preparation. If they wanted to find me, fine, but I wasn't going to be an easy target. The gun shop in suburban Cleveland sold me everything I needed without asking awkward questions. The 9mm I'd brought back from Korea was reliable, but I wanted options, a .45 caliber pistol for stopping power, a compact .380 for concealment, and ammunition that might actually work against supernatural threats. Finding blessed silver rounds required more creativity. I tracked down a Catholic priest who'd served as a military chaplain, told him I was dealing with unusual security concerns related to my overseas service. Father McKenzie didn't ask for specifics, but he understood enough to help. He blessed two boxes of hollow point rounds and gave me contact information for other clergy who might assist if I needed to relocate again. \"Whatever you're facing,\" he said as I prepared to leave, \"remember that faith can be a weapon too, sometimes the most powerful one.\" I carried those rounds everywhere, along with a small silver cross he'd given me. Probably overkill for human surveillance teams, but the nightmares reminded me that human threats weren't the only ones I might face. The girl in the blood-stained hanbok visited my dreams every few nights. Always the same scene, standing among the pine trees, pointing toward the circle of dead soldiers, speaking in Korean I couldn't understand. But her eyes held a message that was universal. This isn't over. I'd survived the initial encounter through luck and distance. I'd escaped the military cover-up through Paul's connections and careful planning. But the federal surveillance made it clear that survival wasn't the same as freedom. Someone somewhere was still hunting me. My life had become a careful balance of hyper-vigilance and forced normalcy. I worked temporary jobs that didn't require background checks, paid rent in cash, maintained multiple identities and escape routes. Every relationship was surface level. Every routine was temporary. Every day was spent watching for signs that the hunters were closing in. The cost of survival was everything I'd once thought I wanted, career, family, the chance to build something permanent. Instead, I lived in a perpetual state of tactical readiness, armed against threats both human and supernatural, knowing that the girl in my nightmares was a reminder of truths the world wasn't ready to accept. Two years after returning from Korea, I sat in my latest apartment, a studio in Detroit with good sight lines and multiple exits, cleaning the blessed silver rounds and wondering how long I could maintain this existence. The surveillance teams were still out there. The nightmares continued. And somewhere in the back of my mind, I knew the real threat wasn't the federal agents watching my building. The real threat was whatever had been contained in Building 7 and the possibility that my survival had marked me as something more than just a witness. The name on my security badge read Michael Harrison, and after eight years, I almost believed it myself, almost. But every morning when I clipped that badge to my uniform shirt, I remembered who I really was underneath the false identity, Eddie Day, former Marine, sole survivor of a patrol that never should've happened. I'd been working nights at Glacier Valley Community College for three years now, long enough that the students recognized me, nodded when they passed, long enough that Professor Martinez brought me coffee during her late office hours, long enough that I'd started to think maybe this time would be different. Maybe this time, I could stay. The college sat in a valley between two mountain ridges, surrounded by pine forests that reminded me too much of Korea. When I'd first arrived in Montana, those trees had kept me awake at night. Now, they just made me careful. I'd chosen this job specifically because the campus had good sight lines, multiple exit routes, and a night shift that meant fewer people around to notice things, fewer people to get hurt if something went wrong. My shift started at 6:00 PM, just as the last evening classes were wrapping up. I'd walk the perimeter first, checking doors, noting which cars remained in the parking lots.The routine had become automatic. Thirty-seven exterior doors, 12 emergency exits, four main entrances. Building by building, I'd work my way through the campus, flashlight beam cutting through shadows, radio crackling with check-ins every hour. But tonight felt different. I'd been getting that familiar itch between my shoulder blades for the past week, the one that meant I was being watched. Surveillance teams had found me before, Detroit, Pittsburgh, that brief stint in Denver. Federal agents with their black sedans and careful questions. But this felt older, hungrier. I documented everything over the years, building a file that would make any conspiracy theorist proud. Seventeen deaths among personnel who'd served at Camp Liberty during '89. Morrison, the supply sergeant, who'd reported missing mechanics, car accident on a clear road. Blake from communications, heart attack at 28 with no history of cardiac problems. The medic who'd processed Christian's stretcher, house fire while he was sleeping, smoke alarm mysteriously disabled. All accidents, all natural causes, all bullshit. The pattern was there if you knew how to look. Each death occurred within five to seven years of their service at Camp Liberty. Each happened when the victim was alone, isolated. Each left behind evidence that investigators dismissed as coincidence. Scratch marks that could have been animal damage, electronic equipment that malfunctioned, witnesses who reported seeing things that didn't make sense. I kept the files in a safety deposit box three towns over, along with my real identification and enough cash to disappear again if needed. Paul thought I was paranoid. Hell, maybe I was, but paranoia had kept me alive for eight years while 17 other people had died. The nightmares hadn't stopped either. Same sequence every time. Fog rolling against the wind. Six soldiers arranged in a perfect circle. Eyes wide with terror. And her, the girl in the bloodstained hanbok pointing toward the trees with fingers that were too long, too sharp. I'd wake up tasting that chemical smell, feeling the weight of Julian's camera around my neck even though I'd lost it years ago. Dr. Patterson, the Navy psychiatrist who'd processed my medical discharge, had called it survivor's guilt mixed with acute stress reaction. He'd prescribed medication that I'd never taken and recommended therapy that I'd never attended. What was I supposed to tell a therapist? That my friends had died because they touched something that wasn't human? That I'd survived because I'd kept my distance from a creature that fed on human contact? Patterson's diagnosis had been useful though. Medical retirement with full benefits. Disability compensation that I'd never claimed because claiming it would mean staying in one place long enough for the checks to find me. The discharge papers showed I'd completed my tour and returned home for medical treatment. Clean, simple, official. Nothing about Building 7. Nothing about Kumiho legends or supernatural contamination. Nothing about the fact that I'd watched my teammates loaded into separate vans and transported to their deaths while government specialists contained something that should never have existed. I tried staying in contact with Paul for the first few years. Christmas cards sent to post office boxes. Brief phone calls from pay phones in different states. But even that had become too dangerous. The federal surveillance teams had visited him twice asking about my whereabouts, my mental state, my ongoing medical needs. Paul had been smart enough to play dumb, but I couldn't risk putting him in danger. So I'd become Michael Harrison, security guard. Quiet guy who paid his rent in cash and kept to himself. No family, no close friends, no connections that could be used against me. I'd learned to live with the loneliness because loneliness meant safety for me and for anyone who might get too close. The job at Glacier Valley had been perfect until recently. Small town, isolated location, minimal background checks. The kind of place where people minded their own business and didn't ask too many questions about a man's past. I'd rented a cabin 15 miles outside town, far enough from neighbors that nobody would hear if something came calling in the night. But that itch between my shoulders had been getting stronger. Three times this week, I'd caught movement in my peripheral vision that disappeared when I turned to look. Twice, I'd found footprints in the mud around my cabin that were too small to be mine, too precise to be random. The prints looked like they'd been made by someone walking on the balls of their feet. Weight distributed in a way that suggested inhuman balance. I'd started carrying the blessed silver rounds again. Father McKenzie's ammunition, consecrated and blessed according to rituals I didn't understand, but trusted anyway. The old chaplain had died two years ago. Natural causes, the obituary said, though I wondered if anything was natural anymore. Before his death, he'd connected me with other clergy who understood that some threats required more than faith and prayer. The silver bullets rode in a custom magazine loaded into my backup weapon, a compact nine millimeter that I carried in an ankle holster. My primary sidearm held standard ammunition because explaining blessed silver to local law enforcement would raise questions I couldn't answer. But if something came for me that bullets couldn't stop, I'd be ready. I was checking the locks on the library's rear entrance when I first saw her.She stood at the edge of the campus, maybe 50 yards away, just beyond the reach of the security lights. Even in the darkness, I could make out the pale blue of traditional Korean dress, the way she held herself perfectly still like she was waiting for something. My flashlight beam didn't reach that far, but I didn't need artificial light to recognize the shape, the posture, the patient watchfulness. Eight years of nightmares had burned that silhouette into my memory. I kept my movements casual, continuing my security round as if I hadn't noticed her. But my hand found the radio clipped to my belt, finger hovering over the emergency button. Not that campus security could handle this kind of emergency. Not that anyone could. She didn't move as I completed my circuit of the library, didn't react when I tested the emergency exit alarms or checked the windows on the ground floor. Just stood there, watching, like she had all the time in the world, like she'd been waiting eight years for this moment and could wait eight more if necessary. I'd always known this day would come. Deep down, beneath the false identities and careful planning, I had understood that running was just delaying the inevitable. Whatever the girl truly was, Kumiho, demon, something older and hungrier than either, she'd marked me that night in the DMZ. My teammates' deaths had been just the beginning, payment on a debt I'd incurred by witnessing something I wasn't supposed to survive. The federal surveillance had been about containment, keeping me isolated until the creature found me. They'd known she was hunting, known that eventually, I'd lead them to her, or she'd lead them to me. I finished the library check and moved toward the student center, forcing myself to maintain normal pace and routine. But I could feel her eyes tracking my movement, could sense that patient hunger that had followed me across two continents and eight years of hiding. When I reached the student center's main entrance, I risked another glance toward the tree line. She was closer now. Maybe 30 yards away, standing beneath a pine tree that cast shadows across her face. But I could see her eyes clearly enough, dark, intelligent, completely human in appearance. That was the worst part. If she'd looked like a monster, it would've been easier. Instead, she looked like what she'd pretended to be that night in Korea, a lost child, a victim who needed help. Except for the way she stood without moving for minutes at a time. Except for the fact that she hadn't aged a day in eight years. Except for the smell that was starting to reach me, even at this distance. That same chemical sweetness I remembered from the fog, like rotting fruit mixed with burning plastic. I keyed my radio and called in a routine check to the campus security office. \"Everything normal,\" I reported. \"All buildings secure.\" Just another quiet night in Montana. But my hand was already moving toward the ankle holster, fingers finding the grip of the nine millimeter loaded with blessed silver. Whatever happened next, I wouldn't go down like my teammates. Wouldn't be found arranged in some ritualistic pattern, eyes wide with terror, throat torn by claws that moved faster than human reflexes could track. I'd been running for eight years, living under false names, changing locations, staying one step ahead of something that couldn't be killed by conventional means. But running was over now. The hunt that began in the DMZ was about to reach its conclusion. The girl in the bloodstained hanbok took a step forward, then another, moving with that same fluid grace I remembered from my nightmares. No longer hiding, no longer patient. I drew the weapon and chambered a round, the mechanical sound echoing across the empty campus. Time to find out if blessed silver worked better than prayer."
}