{
  "title": "I Went Camping With My Girlfriend and Her Friend. Something Isn't Right With These Woods.",
  "upload_date": "",
  "duration_sec": 4888.0,
  "segments": [],
  "full_text": "I should have said no. That was my first thought as I stared at the pile of camping gear Grace had dumped on our living room floor. Sleeping bag, tent, portable stove, flashlights, bug spray. Everything needed for what she called one perfect night under the stars. The whole setup looked like preparation for voluntary torture. \"Come on, Levi. It's just one night.\" Grace crouched beside the gear, rolling the sleeping bag with practiced efficiency. She'd done this before, obviously. Me? I preferred my adventures to come with room service and climate control. The camping equipment looked foreign spread across our hardwood floor. I picked up a metal contraption that might've been a tent stake or a medieval torture device. Hard to tell the difference. The weight of it surprised me. Everything about camping seemed designed to make simple tasks complicated. Why sleep on the ground when we had a perfectly good mattress 20 feet away? \"Amy really needs this,\" Grace continued, not looking up from her packing. \"Derek canceled on her last minute. She's been planning this trip for weeks.\" I knew about Derek, Amy's boyfriend of eight months, who decided he needed space to figure things out, which translated from relationship speak meant he'd found someone else. Amy had been devastated, according to Grace. Hence the emergency camping trip to help her friend heal through communion with nature or whatever. \"And you think I'm an adequate replacement for Derek?\" I asked, testing the weight of a battery-powered lantern. \"I don't exactly scream outdoorsman.\" Grace finally looked at me, and something flickered across her expression. Worry, maybe, or guilt. Hard to read. \"You're doing me a huge favor. Amy's been my best friend since college. I can't let her go through this alone.\" The way she said it made me pause. Grace's voice carried an edge I hadn't heard before. Not quite desperation, but close. Amy Manning had been a constant presence in our relationship. Girls' nights, shopping trips, endless phone conversations about work drama and relationship problems. Grace talked about Amy the way people talked about family. Inseparable since their sophomore year at state, roommates until Grace moved in with me last year. But something felt different about this request. Grace's usual confidence had cracks in it. She kept fidgeting with the tent poles, adjusting and readjusting them, even though they were already perfectly organized. Her movements had a nervous energy that didn't match her casual tone. \"Well, what exactly happened with Derek?\" I asked. Last week Amy seemed fine. She was talking about some concert they were planning to see. \"He just changed his mind about things.\" Grace's answer came too quickly. \"You know how guys can be.\" I didn't know how guys could be actually. The generalization felt like deflection. Grace wasn't usually the type to paint entire genders with broad strokes. She was more thoughtful than that, more precise in her language. This version of her, flustered and evasive, seemed wrong somehow. Still, I found myself nodding along. \"Okay, one night. But I'm bringing my portable phone charger.\" \"Deal.\" Grace's smile looked relieved, but it didn't quite reach her eyes. The drive to Amy's apartment took 20 minutes through downtown traffic. Grace had insisted on picking Amy up rather than meeting at the park, which added an hour to our trip, but seemed important to her. Another gesture of support for her heartbroken friend. I respected that, even if it meant more time in the car with camping gear digging into my back. Amy's building was one of those converted warehouses that tried too hard to look industrial chic. Exposed brick, oversized windows, rent that probably cost more than my monthly salary. Derek worked in finance, I remembered. Had worked in finance. Past tense now. Grace texted Amy from the parking lot and we waited. The late afternoon sky had that gray, overcast quality that made everything look muted and flat. Not exactly ideal weather for outdoor adventures, but Grace had checked the forecast obsessively. No rain predicted, temperatures in the mid-60s. \"Perfect camping conditions,\" she assured me. I watched Grace drum her fingers against the steering wheel, nervous habit. She'd been doing it more lately, though I couldn't pinpoint when it started. Little things like that, the finger drumming, the way she'd been checking her phone more often, how she sometimes seemed distracted during conversations. Nothing dramatic enough to worry about, just subtle shifts in behavior that accumulated over time. \"There she is,\" Grace said. Amy emerged from the building's glass entrance, and I immediately understood why Grace had been worried. Amy looked terrible. Not crying terrible or dramatically heartbroken terrible, but something worse, hollow. She wore dark sunglasses despite the cloudy weather, and her usual confident posture had collapsed into something smaller, more fragile. She'd always been striking, tall, sharp-featured, the kind of person who commanded attention in rooms. Today, she looked like a shadow of herself. Her dark hair hung limp around her shoulders, and her clothes seemed too big, like she'd borrowed them from someone else. Grace got out to help with Amy's bag, leaving me alone in the car. Through the windshield, I watched their interaction. No hug. No animated conversation.\nAmy handed over a small duffle bag and climbed into the back seat without saying anything I could hear. Grace stood by the passenger door for a moment, looking uncertain. When Grace got back in, the atmosphere had changed completely. Whatever lightness we'd managed during the packing process vanished. Amy's presence filled the car with a weight that made normal conversation feel impossible. \"Hey, Amy,\" I said, turning to offer what I hoped was a supportive smile. \"How are you holding up?\" \"Fine.\" The word came out flat and final. She adjusted her sunglasses and stared out the side window. Grace started the engine and we pulled into traffic. \"The weather's supposed to be perfect tonight. Clear skies, not too cold. Remember that camping trip we took junior year? With Sarah and Katie?\" \"I remember.\" Amy's response held no warmth, no invitation for Grace to continue the memory. I caught Grace's eye in the rear view mirror. She looked confused, maybe hurt. This wasn't the dynamic I'd expected. Amy was supposed to be grateful for the distraction, eager for girl time with her best friend. Instead, she sat in our back seat like a hostile stranger. The highway stretched ahead of us, two hours to Pine Ridge State Park. I settled in for what was clearly going to be an uncomfortable drive. Grace tried twice more to start conversations, asking about Amy's work, mentioning a mutual friend's engagement, but each attempt died after Amy's brief cold responses. I found myself studying Amy in the passenger mirror. She kept her face turned away from us, watching the landscape pass by with an intensity that seemed forced, like she was working hard to avoid looking at Grace, or me, or both of us. Something was definitely wrong here. This wasn't normal grief over a breakup. Amy was angry, but not at Derek. The hostility radiating from the back seat felt personal and specific, directed. Grace's fingers resumed their drumming against the steering wheel. In the silence, the sound seemed unnaturally loud. I wanted to reach over and still her hand, but something about the tension in the car made even small gestures feel risky. 30 minutes into the drive, I tried a different approach. \"Pine Ridge is supposed to have great hiking trails. Have you been there before, Amy?\" She turned slightly, just enough for me to see the edge of her profile past the sunglasses. \"No, this is Grace's idea.\" The way she said Grace's name carried something sharp. Not affection, not even neutrality. Something that made Grace's shoulders tense visibly. \"I thought it would be nice,\" Grace said carefully. \"Peaceful, good for clearing your head.\" Amy made a sound that might've been agreement or might've been derision. Hard to tell. I gave up on conversation after that. Whatever was happening between Grace and Amy was bigger than Derek's breakup, and I was clearly not equipped to navigate it. Instead, I watched the suburbs give way to farmland, then forest. The trees grew thicker as we climbed into the foothills, their branches heavy with late summer leaves. The silence stretched between us, filled only by the hum of tires on asphalt and Grace's increasingly anxious finger drumming. I found myself thinking about all the times Amy had been over to our apartment, all the easy conversations and shared jokes. She'd never been cold like this. Distant maybe, when she was stressed about work or dating drama, but never hostile. In the back seat, Amy remained motionless except for the occasional shift of her head to follow something outside the window. She'd removed her sunglasses at some point, and when I caught glimpses of her face in the mirror, her expression was unreadable. Not sad, not angry exactly. Something else. Something that made me uncomfortable in ways I couldn't name. Grace had stopped trying to make conversation entirely. She drove with both hands gripping the steering wheel. Her usual casual confidence replaced by something tighter, more controlled. Every few minutes, she'd glance in the rear view mirror, trying to make eye contact with Amy. Amy never looked back. The trees closed in around us as we climbed higher into the mountains. The road narrowed, winding through dense forest that blocked out most of the remaining daylight. Our headlights cut through the growing gloom, illuminating patches of undergrowth and the occasional reflective eyes of deer watching from the shadows. I'd agreed to this trip to help Amy through a difficult time, but sitting in that car, feeling the weight of unspoken tension between the two women, I realized I had no idea what I'd actually signed up for. Whatever was wrong between Grace and Amy went deeper than a canceled camping trip or a thoughtless ex-boyfriend. The atmosphere in the car had become so thick with unspoken hostility that I could practically taste it. Grace's knuckles were white against the steering wheel now, and Amy continued her silent vigil at the window. Her jaw set in a way that suggested she was working very hard to keep whatever she was thinking to herself. We still had an hour of driving ahead of us, and I was beginning to suspect that reaching our campsite wasn't going to solve anything. The car doors slammed shut with finality, and I found myself standing in a clearing that felt smaller than I'd expected. Pine trees stretched up around us. Their trunks thick and dark, creating walls that seemed to press inward. The ground beneath my feet was covered in a carpet of brown needles that crunched softly as I shifted my weight.Grace had already popped the trunk and was pulling out our gear with movements that struck me as too quick, too determined. She hauled out the tent first, then the sleeping bags, then the cooler we'd packed with sandwiches and drinks. Each item hit the ground with a soft thud that seemed loud in the forest quiet. Amy emerged from the backseat like she was forcing herself through thick water. She moved slowly, deliberately. Her small duffle bag clutched in one hand. The sunglasses were back on her face, which made no sense given how the trees blocked most of the remaining daylight. She surveyed the clearing with what I could only describe as resignation, like someone accepting a prison sentence. \"This looks good,\" Grace said. Her voice carrying that same forced brightness I'd been hearing for the past hour. She gestured at the open space between several large pines. \"We can set up the tents over there and maybe build a fire pit closer to that fallen log.\" Amy said nothing. She walked to where Grace had indicated and dropped her duffle bag on the ground with deliberate emphasis. The sound was sharper than necessary. I grabbed the tent poles from the pile of gear, trying to remember the last time I'd actually set up a tent. College, probably. Maybe that trip with my roommates to Lake George, where we'd spent more time drinking beer than figuring out the camping equipment. The poles felt unfamiliar in my hands, cold metal that seemed designed to confuse rather than help. Grace was already unrolling the tent fabric, her movements quick and efficient. She'd always been better at this kind of thing than me. More practical, more prepared. Watching her work, I noticed her shoulders were tight, held higher than normal. The easy confidence she usually carried was replaced by something that looked like controlled panic. Amy had moved to the edge of the clearing and was unpacking her own gear with methodical precision. She pulled items from her duffle bag one by one, arranging them in neat piles on the ground. Clothes in one stack, toiletries in another, sleeping bag rolled out and inspected for damage. She worked without looking at either of us, like we weren't there at all. The silence stretched between us, broken only by the sound of zippers and rustling fabric. I tried to thread a tent pole through its designated sleeve, and immediately got it stuck. The fabric bunched up around the metal, refusing to cooperate. \"Need help with that?\" Grace asked. But she was already moving toward me before I could answer. Her hands brushed mine as she took the pole, and I felt how cold her fingers were. The tent fabric slid smoothly under her guidance. The pole sliding through like it was meant to be easy. \"Thanks,\" I said. But she was already moving onto the next pole. Her focus intense and narrow. Like if she concentrated hard enough on the tent, she could ignore everything else happening in the clearing. Amy had finished organizing her belongings and was now setting up her own tent. A small, efficient, one-person model that she assembled with practiced movements. No hesitation, no confusion about which piece went where. She'd clearly done this before many times. The tent took shape under her hands with mechanical precision, each stake driven into the ground with firm, decisive strikes. I watched her work and tried to understand what I was seeing. This wasn't grief. Grief looked different, felt different. This was something sharper, more focused. Amy's movements carried purpose, like she was working through anger rather than sadness. Every action seemed calculated to demonstrate her independence, her ability to handle things alone. Grace had our tent mostly assembled now, and I helped her stake down the corners. The fabric pooled taut between the poles, creating a small orange dome that looked surprisingly sturdy. Grace tested the zipper, running it up and down several times like she was checking for problems that might emerge later. \"Amy,\" Grace called out, her voice carefully casual. \"Wanna help us gather some firewood? We could walk the perimeter together, see what's out there.\" Amy didn't look up from adjusting her tent's rain fly. \"I'm good. Still have things to organize.\" The rejection was quiet, but absolute. Grace's face tightened for just a moment before she forced it back into neutral territory. She nodded like this was exactly what she'd expected, but I caught the way her hands clenched briefly at her sides. \"Okay,\" Grace said. \"Levi and I can handle it.\" But Amy was already retreating into her tent, disappearing behind the zipper door like she was pulling up a drawbridge. The tent sat there in the growing dusk, a small orange barrier between her and the rest of us. Grace stared at the closed tent for several seconds, her expression cycling through emotions I couldn't quite read. Disappointment, frustration, something that might've been hurt. Then she turned to me with a smile that didn't reach her eyes. \"Guess it's just us,\" she said. We spent the next 30 minutes collecting fallen branches and dry pine needles from the forest floor. Grace worked with determined efficiency, gathering wood like her life depended on it. I found myself watching her more than the ground, noting how she moved through the trees with sharp, quick steps. She was burning off nervous energy, I realized. All that tension from the car ride had to go somewhere. The forest around us was quieter than I'd expected. No bird sounds, no rustling in the underbrush. Just the soft crunch of our footsteps on the pine needle carpet, and the occasional crack of a branch as Grace snapped it to size.The trees seemed to absorb sound, creating a muffled quality that made even our breathing seem loud. When we returned to the clearing, Amy's tent remained closed. No movement, no sound from inside. It sat there like a rebuke, a physical reminder of the distance she was maintaining between herself and us. I'd never built a campfire before, not really. The few times I'd been camping, someone else had always handled that part while I contributed by opening beer bottles or arranging chairs. But Grace was busy organizing our gear with the same intense focus she'd applied to everything else. So, I found myself crouched next to the pile of wood, trying to remember what I'd seen in movies. Small stuff first, I thought. Build up from there. Two arranged the pine needles in a loose pile, then added the smallest twigs on top. The bigger branches would come later once I had flames to work with. My hands felt clumsy as I fumbled with the lighter Grace had packed, the metal cold against my thumb. The first few attempts produced nothing but sparks that died immediately in the pine needles. I adjusted the pile, trying to create more airflow and tried again. This time, a small flame caught, flickering orange against the brown needles. I held my breath, afraid to disturb it, and slowly fed it more twigs. To my surprise, the fire took hold. Small flames spread through the kindling, growing stronger as I added larger pieces. The wood crackled softly, releasing the sharp scent of burning pine. Smoke drifted upward in a thin column before dispersing among the tree branches overhead. Grace looked up from the cooler she'd been organizing and smiled when she saw the flames. \"Nice work,\" she said. And for the first time since we'd left the car, her voice carried genuine warmth instead of forced cheer. I felt an unexpected surge of pride. Such a simple thing, building a fire, but it gave me something to contribute, made me feel less useless in this outdoor environment that Grace and Amy clearly navigated better than I did. The fire grew steadier as I added more wood, creating a circle of warmth and light in the clearing. The flames cast dancing shadows on the surrounding trees, making the forest feel both more intimate and more mysterious. I arranged three pieces of the fallen log around the fire pit, creating makeshift seats. Grace pulled sandwiches and trail mix from the cooler, setting them out on a camping plate between the log seats. The sandwiches looked slightly compressed from the drive, but the turkey and cheese still smelled good. My stomach reminded me that we'd been traveling for hours without eating. Amy's tent zipper finally opened and she emerged looking like someone who'd been steeling herself for an unpleasant task. She'd removed the sunglasses, and I could see her face clearly for the first time since we'd picked her up. Her eyes looked tired, but there was something harder underneath the exhaustion, something that made me think of a person preparing for a fight. She approached the fire slowly, choosing the log seat farthest from Grace. The distance was subtle but deliberate, creating a triangle around the flames with maximum space between her and Grace. She accepted a sandwich when Grace offered it, but held it in her lap without taking a bite. The three of us sat in the flickering firelight, eating in silence that felt different from the car ride. Less hostile maybe, but no less tense. Grace took small, careful bites of her sandwich, her eyes moving between Amy and the flames. Amy picked at the bread crust, pulling off small pieces that she didn't eat. I found myself focusing on the fire, feeding it new branches when the flame started to die down. The repetitive task gave me something to do with my hands while I tried to figure out what was happening between Grace and Amy. Whatever this conflict was, it ran deeper than Derek's sudden departure. The way Amy looked at Grace carried too much history, too much specific hurt. Grace cleared her throat softly. \"Remember that camping trip we took junior year with Sarah and Katie?\" Her voice was careful, testing the waters. Amy's response was immediate and cold. \"Things were different then.\" The words hit the air like a slap. Grace flinched visibly, her sandwich freezing halfway to her mouth. I felt the temperature around the fire drop several degrees, though the flames continued crackling cheerfully, oblivious to the human drama playing out around them. \"Amy, I...\" Grace started. But Amy cut her off with a look that could've extinguished the fire. \"Different,\" Amy repeated, her voice carrying an edge that made me wince. She said it like Grace should know exactly what she meant, like there was a whole conversation contained in that single word. Grace's face crumpled slightly before she got control of it again. She set down her sandwich and stared into the flames. Her hands clasped tightly in her lap. The silence that followed felt dangerous, like something that might explode if disturbed. I realized I needed to do something. The tension between them was becoming unbearable, and we still had the entire night ahead of us. Sleeping in separate tents wouldn't solve anything if they couldn't even sit around the same fire without this level of hostility. \"Hey,\" I said, my voice sounding too loud in the quiet clearing. Both women looked at me with expressions that suggested they'd forgotten I was there. \"You know what camping trips need? Scary stories.\"It was a desperate attempt at redirection, but Grace's face immediately brightened with relief. She seized on the suggestion like a lifeline. \"That's a great idea,\" she said, her voice carrying genuine gratitude. \"Levi always knows how to make things fun.\" Amy's expression didn't change. She continued picking at her sandwich, her walls firmly in place against any attempt to lighten the mood, but she didn't object, didn't retreat back to her tent, which I took as a small victory. The fire crackled between us, casting shifting shadows on our faces, and I found myself hoping that maybe somehow we could salvage something from this trip. Even if I didn't understand what had broken between Grace and Amy, maybe we could find a way to coexist for one night without everything falling apart completely. I settled back against the log, feeling the rough bark press through my shirt. The fire had found its rhythm now, flames dancing steadily between us. And for the first time since we'd arrived, the silence didn't feel quite so suffocating. Maybe my suggestion had actually worked. Maybe we could get through this evening without everything completely imploding. Amy shifted on her section of the log, adjusting her position so she faced both Grace and me more directly. The firelight caught her features differently now, highlighting the sharp angles of her cheekbones and casting shadows under her eyes that made her look older somehow, more weathered than the Amy I remembered from Grace's stories about their college adventures. \"I do know a story,\" she said finally, her voice carrying across the space between us. Grace looked up from where she'd been methodically shredding a piece of sandwich crust, relief evident in her expression. \"Great. I love your stories, Amy. You always had the best ones in college.\" Amy didn't acknowledge the comment. Instead, she leaned forward slightly, her elbows resting on her knees, hands clasped together. The movement brought her closer to the fire, and I could see her face more clearly now. There was something deliberate about the way she positioned herself, like she was preparing for a performance. \"This one's about two friends,\" Amy began, her voice taking on a quality I hadn't heard from her all day. It was distant, almost dreamy, but with an underlying current that made me pay closer attention. \"They'd been inseparable since they were kids. Best friends, you know? The kind where they shared everything.\" Grace nodded, settling back against her own section of log. Her earlier tension seemed to ease slightly, and she actually smiled for the first time since we'd left the city. \"That sounds nice. Like us in college.\" Amy's eyes found Grace across the fire, and she held her gaze as she continued. \"Everything, Grace. Secrets, clothes, dreams about the future. Even boyfriends sometimes.\" Something in the way Amy said Grace's name made me look between them more carefully. Grace's smile faltered just a bit, though she tried to maintain her encouraging expression. I found myself studying Amy's face, trying to read the intention behind her words. There was a precision to them that felt different from casual storytelling. \"They trusted each other completely,\" Amy went on, never breaking eye contact with Grace. \"Or at least one of them thought they did. See, what she didn't know was that her best friend had been lying to her for years.\" The fire popped, sending a small shower of sparks up into the darkening sky above us. Grace flinched at the sound, her hands tightening around the remains of her sandwich. I noticed her breathing had changed, becoming more shallow and controlled. \"Lying about what?\" Grace asked, though her voice had lost its earlier warmth. Amy's lips curved into something that wasn't quite a smile. \"About someone the first friend cared about deeply, someone she thought she could trust. Turns out, her best friend had been carrying on an affair with him behind her back for months.\" The word affair hung in the air between them like smoke. I felt my stomach tighten as the pieces started falling into place. This wasn't just a ghost story Amy was telling. This was something else entirely, something personal and pointed and aimed directly at Grace. Grace had gone very still, her face pale in the firelight. \"Amy-\" \"Let me finish the story,\" Amy said, her voice sharp now, cutting through Grace's attempt to interrupt. \"The betrayed friend found out eventually. She always wondered why her boyfriend had been so distant lately, why he'd been working late so often, why he'd stopped looking her in the eye when he said he loved her.\" My mind was racing, trying to process what I was hearing. Derek. Amy's boyfriend, Derek, who had supposedly broken up with her to figure things out. The same Derek who had canceled this camping trip at the last minute. I looked at Grace, whose face had drained of all color, and felt something cold settle in my chest. \"So, she confronted her best friend,\" Amy continued, her voice gaining strength and venom with each word. \"Asked her directly if she'd been sleeping with Derek. And you know what her best friend did?\" Grace's mouth opened, but no sound came out. She looked trapped, pinned in place by Amy's relentless stare and the weight of whatever truth was being dragged into the light between them. \"She lied again,\" Amy said, leaning forward even more, her voice dropping to just above a whisper.... looked her right in the eye and lied, said she would never do something like that, said she loved her too much to hurt her that way.\" The fire crackled between us, but it might as well have been a thousand miles away. I felt like I was watching something private and terrible unfold, something I had no business witnessing. Grace's hands were shaking now, the sandwich wrapper crinkling in her grip. \"But the betrayed friend knew,\" Amy said, her voice taking on an almost sing-song quality that made my skin crawl. She'd seen the text messages. She'd followed them to that little motel on Highway 12. She'd watched through the window and seen everything she needed to see. Grace made a small sound, almost like a whimper, and I realized I was holding my breath. This wasn't happening. This couldn't be what I was hearing. Grace wouldn't do something like that. She wouldn't betray her best friend, wouldn't sleep with Amy's boyfriend behind her back. But the way Grace was sitting there, frozen and pale and unable to meet Amy's eyes, told me everything I needed to know. \"So, the betrayed friend decided to get her revenge,\" Amy continued, and now her voice was completely flat, emotionless in a way that was somehow more frightening than if she'd been screaming. She invited her lying, cheating best friend on a camping trip, told her it would be good to get away, to talk things through like they used to. My hands were clenched so tightly around my knees that my knuckles ached. I wanted to say something, to interrupt this horrible revelation, but I couldn't find words, couldn't figure out how to process what I was learning about Grace, about the woman I'd been living with for two years. \"They hiked up to a beautiful overlook,\" Amy said, her eyes never leaving Grace's face, \"a cliff with a perfect view of the valley below. And when they got to the edge, the betrayed friend confronted her one more time, asked her to tell the truth, to finally be honest about what she'd done.\" Grace was crying now, silent tears streaming down her cheeks, but she still couldn't speak, couldn't defend herself or deny what Amy was saying. \"And when her best friend tried to lie again,\" Amy said, standing up slowly from her log, \"the betrayed friend pushed her right off that cliff.\" The words hit like a physical blow. I felt myself recoil, my back pressing harder against the log behind me. Amy stood there in the firelight, tall and terrible and completely calm, looking down at Grace, who had crumpled in on herself like a broken doll. \"The body was never found,\" Amy said, her voice dreamy again, as if she was talking about something she'd seen in a movie instead of describing what sounded like murder. \"It fell too far into a ravine too deep for anyone to reach. But sometimes, on nights like this, the dead friend comes back looking for justice.\" The silence that followed was complete and suffocating. Even the fire seemed to burn more quietly, as if it too was afraid to make noise in the aftermath of Amy's story. Grace was still crying, her shoulders shaking with the effort of trying to stay quiet. Amy remained standing, looking down at both of us with an expression I couldn't read. I tried to make sense of what I'd just heard. Grace had been having an affair with Derek. Amy knew about it. Amy had planned this whole camping trip as some kind of confrontation, and I'd been brought along as what? A witness? An alibi? The thought made me sick. \"That's,\" I started, my voice cracking on the first word. I cleared my throat and tried again. \"That's quite a story, Amy. Very atmospheric.\" It was a pathetic attempt to defuse the situation, to pretend that what had just happened was normal storytelling instead of a confession and a threat rolled into one. But I didn't know what else to do, didn't know how to handle the fact that my girlfriend had apparently been cheating on her best friend or that said best friend had just told a story about pushing someone off a cliff. Amy looked at me for the first time since she'd started talking, and I saw something in her eyes that made me want to run back to the car and drive away as fast as possible. \"I'm tired,\" she announced abruptly as if the last 10 minutes hadn't happened. \"I'm going to bed.\" Without another word, she turned and walked to her tent, unzipping the door and disappearing inside. The zipper closed with a sharp final sound that seemed to echo in the sudden quiet. Grace and I sat by what was left of the fire. Amy had vanished into her tent maybe 10 minutes ago, but the silence felt like it had been going on for hours. I kept my eyes on the orange embers, watching them pulse and fade, because looking at Grace seemed like the wrong thing to do right now. She wasn't crying anymore, but I could hear her breathing in these short, careful bursts, the kind of breathing you do when you're trying not to fall apart completely. Her sandwich wrapper crinkled as she twisted it between her fingers over and over until the sound started getting under my skin. I wanted to say something, anything, but what do you say when your girlfriend just got accused of sleeping with her best friend's boyfriend through a story about pushing someone off a cliff? There's probably not a manual for that situation. The fire popped, sending up a small shower of sparks that died before they reached the trees. Grace flinched at the sound.\"Levi,\" she started, then stopped. Her voice came out rough and small. I finally looked at her. Her face was blotchy from crying, and she kept opening her mouth like she wanted to explain, then closing it again. I'd never seen Grace struggle for words before. She always knew exactly what to say, always had everything planned out. Even this morning when she was being weird about the camping trip, she'd still been in control. Now, she looked lost. \"We should probably...\" I said, then realized I didn't know how to finish that sentence either. \"Yeah.\" She stood up quickly, brushing dirt off her jeans. \"We should get some sleep.\" The fire had burned down to mostly coals anyway. I grabbed a water bottle from our gear and poured some over the embers. They hissed and sent up steam that smelled like wet ash. Grace was already walking toward our tent, moving like she was afraid Amy might come back out and start talking again. I followed her, leaving the camping chairs and cooler where they were. Amy's tent was completely dark, no movement inside. For all I knew, she really was asleep. Maybe she'd said what she needed to say and now she was done, but I doubted it. Inside our tent, Grace was already unrolling her sleeping bag with sharp, jerky movements. The tent wasn't huge, just big enough for two people if they didn't mind being close together. Under normal circumstances, that would've been fine. Tonight, it felt cramped. I unzipped my own sleeping bag and spread it out next to hers. The ground underneath was harder than I'd expected, even with the tent floor between us and the dirt. Grace had gotten into her sleeping bag and turned on her side, facing away from me. \"Grace,\" I said quietly. \"I'm tired, Levi.\" \"I know. But, please, can we just... Not tonight.\" I wanted to push. Part of me needed to know if what Amy had said was true, needed to hear Grace either confirm it or deny it. But the bigger part of me was scared of what she might say. So, I got into my sleeping bag and lay on my back, staring up at the tent ceiling. Grace was moving around constantly. Shifting positions, adjusting her pillow, pulling the sleeping bag up to her chin, and then pushing it back down. Every few minutes she'd let out this quiet sigh that sounded frustrated and miserable at the same time. I closed my eyes and tried to focus on other sounds. Wind moving through the pine trees above us. Something small rustling in the underbrush nearby. An owl calling from somewhere deeper in the forest. Normal camping sounds that should've been peaceful. My mind kept going back to Amy's story though. The way she'd looked directly at Grace while she told it. The details about Highway 12 and the motel. Those weren't random details. Amy knew exactly where Grace and Derek had been meeting. And Derek canceling at the last minute suddenly made a lot more sense. If Grace had been planning to break things off with him, or if Amy had confronted him first, he'd definitely want to avoid this camping trip. Smart move on his part, which left me here instead. I was starting to wonder if Grace had asked me to come because she needed moral support, or because she thought having me around would keep Amy from doing anything too crazy. Either way, I was definitely not equipped for this situation. Grace had finally stopped moving around so much. Her breathing was getting deeper and more regular. I thought maybe she was actually falling asleep when I heard something outside. Footsteps. Not the random sounds of animals moving around. Deliberate footsteps, like someone walking carefully around our campsite. They started near Amy's tent and moved in a slow circle around the perimeter of our clearing. I held my breath and listened. The steps were measured, patient. They'd move for a few seconds, then pause, then continue. Whoever it was wasn't in any hurry. \"Levi?\" Grace's voice was barely a whisper. \"Yeah?\" \"Do you hear that?\" \"The footsteps?\" \"Mm-hmm.\" We both lay there listening. The steps continued their circuit around our site. Sometimes they'd pause right outside our tent wall, close enough that I could hear small sounds. Fabric brushing against something, a quiet intake of breath, what might have been whispered words too soft to make out clearly. It had to be Amy. Who else would it be? But why was she walking around out there instead of sleeping? And why was she being so quiet about it? The footsteps paused again, this time right near the tent entrance. I could see a shadow through the thin tent fabric. A darker shape against the darkness outside. Grace's hand found mine inside her sleeping bag and squeezed tight. I thought about Amy's story again, about the friend who pushed her cheating best friend off a cliff. About how the body was never found. About revenge. Maybe Amy wasn't done talking after all. The shadow moved away from our tent entrance and continued its slow circle. I counted the steps this time. 12 steps along the back of our tent. Pause. Eight steps toward Amy's tent. Pause. 15 steps along the front of our campsite. Pause. 10 steps back toward our tent. Then the whole pattern started over again. \"This is really weird,\" Grace whispered. I wanted to agree, but something about the way she said it bothered me.She sounded scared, which made sense. But there was something else in her voice, guilt maybe. Like she knew exactly why Amy was out there walking circles around us. The footsteps stopped directly outside our tent entrance again. This time, I was sure I heard whispering. Not words I could understand, just the soft rhythm of someone talking very quietly to themselves or to us. I couldn't take it anymore. I unzipped the tent entrance just a few inches and peered out into the darkness. Our fire was completely dead now, just a pile of gray ash. The trees around our campsite were black shapes against a slightly less black sky. I couldn't see anyone moving around out there. \"Amy,\" I called softly, \"Is that you?\" The whispering stopped. \"Amy,\" a voice came from somewhere in the darkness, but not from where I expected. It sounded farther away, near the edge of our campsite where the trees got thick. \"Just getting water.\" The voice was flat and hollow, like it was coming from the bottom of a well. It didn't sound quite right, but it was definitely Amy. \"Okay,\" I said, though I had no idea why she'd need to get water in the middle of the night without using a flashlight. We'd brought plenty of bottled water, and there wasn't exactly a stream nearby. I zipped the tent entrance back up and laid down again. Grace was still holding my hand, and I could feel her pulse racing against my palm. \"Just getting water,\" I repeated quietly. \"For an hour?\" Grace whispered back. I looked at my watch. It was almost 2:00 in the morning. The footsteps had started around 1:00, which meant Amy had been walking around out there for close to an hour. That was a long time to be getting water. The footsteps started up again, but this time they sounded different. More random, less like a pattern. They'd move in one direction for a while, then stop, then head off somewhere else. Sometimes they'd get close to our tent. Sometimes they'd fade away toward the trees. Grace's breathing had gotten shallow and anxious again. Every time the footsteps came near our tent, she'd tense up and squeeze my hand harder. I lay there listening. The steady rhythm of footsteps had finally stopped sometime before dawn. I drifted in and out of sleep, jerking awake each time Grace shifted beside me or a branch cracked in the distance. When real sleep finally came, it felt like I'd barely closed my eyes before the gray morning light started filtering through the tent fabric. I unzipped my sleeping bag and immediately felt the chill. The temperature had dropped overnight, and my breath came out in small puffs. Grace was still curled on her side facing away from me, her breathing deep and even. For the first time since we'd arrived, she looked peaceful. No tension in her shoulders, no restless movement, just sleep. I pulled on my jacket and carefully unzipped the tent entrance, trying not to wake her. The zipper seemed impossibly loud in the morning quiet. Each tooth catching and releasing with a metallic whisper. I slipped outside and stood up. My joints stiff from sleeping on the ground. The campsite looked different in daylight. Smaller somehow, less mysterious. The trees that had loomed so ominously in the darkness were just ordinary pines, their branches heavy with morning mist. Everything felt damp and cool. The kind of mountain morning that makes you want to get back inside where it's warm. Where our fire had burned the night before, only gray ash remained. I walked over and crouched beside the cold ring of stones, running my fingers through the powdery remains. Not even a hint of warmth left. The logs we'd carefully arranged had collapsed into themselves, leaving charred fragments scattered across the ash. Amy's tent sat about 20 feet away. Its blue fabric beaded with moisture. The zipper was pulled tight. No movement or sound from inside. I found myself staring at it, remembering the strange voice that had answered when I called out in the darkness, \"Just getting water.\" But the voice had come from the wrong direction, hadn't it? From over by the trees, not from her tent. I shook my head and walked back to our gear. No point dwelling on it. People did weird things when they couldn't sleep. Maybe she'd been restless, walking around to tire herself out. Maybe she'd been embarrassed about keeping us awake and didn't want to admit it. Our portable stove was packed in one of the duffel bags Grace had organized yesterday. I found it nestled between our extra clothes and the first aid kit, along with a small metal pot and packets of instant coffee. Setting up the stove took longer than I expected. The instructions were printed in tiny text on the side of the fuel canister, and my fingers felt clumsy in the cold air. When I finally got the flame adjusted properly, I filled the pot with water from one of our bottles and set it on the burner. The blue flame hissed steadily underneath and I crouched beside it, holding my hands over the heat. The coffee smell would be good when Grace woke up. Something normal and comforting after the strangeness of last night. Behind me, I heard the tent zipper opening. Grace emerged, her hair messy and her face creased from sleep. She was wearing the same clothes she'd slept in. Her jacket pulled tight around her shoulders.\"Morning,\" she said, her voice rough. \"Coffee's almost ready.\" She nodded and looked around the campsite, her eyes stopping on Amy's tent. \"She still asleep?\" \"I guess. Haven't heard anything from over there.\" Grace walked to the back of our tent and started pulling our sleeping bags through the entrance. She shook each one out and began rolling them into tight cylinders, her movements quick and efficient. I'd seen her pack before, and she always approached it like a project to be completed as fast as possible. The water started bubbling in the pot. I opened two packets of instant coffee and dumped the granules in, stirring with a plastic spoon. The smell was better than the taste would be but it was hot and caffeinated, which was all that mattered. \"Should we wake her up?\" I asked, nodding toward Amy's tent. Grace paused in her packing, a sleeping bag half-rolled in her hands. She looked at the tent for a long moment, and I caught something in her expression. Not concern exactly, but calculation. Like she was weighing options. \"Yeah,\" she said finally. \"We should probably get moving soon.\" She finished rolling the sleeping bag and set it aside, then walked across the campsite to Amy's tent. I poured coffee into two metal camping mugs and watched Grace approach the blue fabric wall. \"Amy?\" Grace called, her voice carrying easily in the still air. \"You awake?\" No response. The tent remained motionless. \"Amy, we're making coffee if you want some.\" Still nothing. Grace looked back at me, and I saw that calculating expression again. She was thinking about something, working through some kind of problem in her head. \"Amy?\" She called louder this time, an edge creeping into her voice. \"Come on. We need to start packing up.\" The silence stretched out between us. I set down the coffee mugs and walked over to stand beside Grace. Up close, I could see that the tent fabric was pulled tight, properly staked and secured. No sign that anyone had entered or left recently. \"Maybe she's a heavy sleeper,\" I suggested. Though even as I said it, I didn't believe it. Amy had been awake and moving around for hours during the night. If she was sleeping now, it was the kind of deep, exhausted sleep that comes after staying up too long. Grace reached for the tent zipper. \"Amy, I'm coming in.\" She pulled the zipper down slowly, the metal teeth separating with a series of tiny clicks. The tent entrance opened to reveal the dim interior, and Grace leaned forward to peer inside. \"She's not here,\" Grace said. The words hung in the air for a moment before their meaning sank in. I moved closer and looked over Grace's shoulder into the tent. Amy's sleeping bag was there, unzipped and spread out flat. Her small duffle bag sat in one corner. Clothes spilling out of the open top. I knelt beside Amy's sleeping bag, rolling it into a tight cylinder, the way Grace had shown me countless times during our weekend hiking trips. The fabric felt damp from the morning mist, and I had to work carefully to keep it from bunching up. Grace was already loading our gear into the car, making multiple trips back and forth with determined efficiency. My hands worked automatically, compressing the sleeping bag and securing the straps, but my mind kept circling back to last night. The footsteps, Amy's voice coming from the wrong direction. The way she told that story about betrayal and revenge, watching Grace's face crumble with each word. None of it made sense, and now Amy had vanished without a trace. I grabbed the corners of the sleeping bag to give it one final roll when something crinkled against my fingers. A piece of paper tucked deep into the corner where the fabric folded over itself. I worked it loose, expecting maybe a receipt or a forgotten note. But what I pulled out made my stomach drop. A photograph, four by six inches, slightly bent from being pressed against the sleeping bag's interior. The image was sharp, clearly taken with a decent camera rather than a phone. Grace was in the center of the frame. Her head thrown back in genuine laughter, the kind that made her eyes crinkle at the corners. She was wearing the blue sweater I'd bought her for her birthday three months ago, the one with the cable-knit pattern she admired in the store window. But it wasn't Grace that made my hand start shaking. It was the man beside her. I'd never seen him before in my life. Tall, probably six feet or so, with dark hair and the kind of easy smile that suggested he was comfortable being photographed. He wore a black jacket, expensive-looking, and his arm was draped around Grace's shoulders in a way that spoke of familiarity. Not the careful positioning of friends posing for a quick snapshot, but the relaxed intimacy of two people who touched each other regularly. Grace's haircut in the photo was identical to how she wore it now. The same length, the same subtle layers she'd gotten trimmed just two weeks ago. This wasn't some old picture from before we'd met. This was recent. Very recent. I stared at the image trying to process what I was seeing. Grace looked happier in this photo than I'd seen her in months. Radiant even. The way she used to look at me during our first year together before work stress and routine had settled over our relationship like dust on furniture. \"Levi? You're almost ready?\" Grace's voice carried across the campsite, and I quickly folded the photograph in half, then in half again, shoving it into my jacket pocket.\"Yeah, just finishing up,\" I called back, my voice sounding normal despite the way my heart was hammering against my ribs. I completed rolling the sleeping bag with mechanical movements, my mind racing. Why would Amy have this photograph? Had she taken it herself following Grace and this unknown man, or had someone else given it to her? The implications twisted through my thoughts like smoke, impossible to grasp but impossible to ignore. Grace appeared beside me, reaching for her backpack. \"Find everything?\" I looked at her face searching for some sign of guilt or nervousness, but she seemed focused on the task at hand. Her movements were quick and efficient, the same way she approached everything when she was anxious to leave a place behind. \"Actually, yeah, I found something.\" I pulled the photograph from my pocket, unfolding it carefully. \"This was tucked in Amy's sleeping bag.\" Grace's reaction was immediate and unmistakable. The color drained from her face so quickly I thought she might faint. Her lips parted slightly but no sound came out. She stared at the photograph like it was a snake that might strike her. \"Who is he?\" I asked, keeping my voice level despite the chaos in my chest. Grace's eyes darted from the photo to my face and back again. She opened her mouth, closed it, then swallowed hard. \"I... I don't know.\" The lie was so obvious it was almost insulting. Grace had many talents, but deception wasn't one of them. Her tells were subtle but consistent. The way her left hand moved to touch her throat, the slight tremor in her voice, the way she couldn't maintain eye contact. \"You don't know?\" I repeated. \"I mean, I don't know why Amy would have that picture.\" The words came out in a rush like she'd been rehearsing them. \"I have no idea where she got it or why she'd keep something like that.\" I studied her expression, noting how her gaze kept sliding away from mine. In four years of dating, I'd learned to read Grace's moods and reactions with reasonable accuracy. Right now, she looked like someone who'd been caught in a lie but was desperately hoping she could still talk her way out of it. \"So you do know who he is?\" Grace's silence stretched between us like a taut wire. She stared at the photograph in my hands, her breathing shallow and quick. Finally, she reached out and plucked it from my fingers with a sharp motion. \"Where did you say you found this?\" \"In Amy's sleeping bag, tucked way down in the corner.\" Grace turned the photo over, examining the back as if looking for writing or some other clue. Her hands were shaking slightly, barely perceptible unless you knew to look for it. \"This is so weird,\" she said, but her voice lacked conviction. \"Why would Amy have a picture of me? And why hide it in her sleeping bag?\" I held out my hand. \"Can I see it again?\" Grace hesitated for just a moment too long before handing it back. I looked at the image again, focusing on details I'd missed the first time. The background showed what looked like a restaurant patio with other diners visible at nearby tables. Grace was wearing earrings I recognized, small silver hoops she'd gotten for Christmas. The lighting suggested late afternoon or early evening. \"Your hair looks exactly like it does now,\" I said. \"So?\" \"So this picture was taken recently, within the last few weeks, I'd guess.\" Grace's jaw tightened. \"I get my hair cut every six weeks. It's looked like this for months.\" That was true, but it didn't explain the other details. The sweater I'd bought her in April, the earrings from December that she'd only started wearing regularly in the last month, the way her skin had the slight tan she'd developed from our hiking trips this summer. I folded the photograph carefully and slipped it back into my pocket. Grace watched the movement with obvious reluctance, like she wanted to snatch it away from me. \"We should go,\" she said. \"We need to figure out where Amy went.\" I nodded, but questions were forming in my mind faster than I could process them. Amy's story last night about betrayal and affairs, her obvious hostility toward Grace, the way she'd looked at Grace while telling that tale about pushing someone off a cliff. And now this photograph, hidden in Amy's belongings like evidence waiting to be discovered. We finished packing in silence. Grace moved with jerky, nervous energy, checking and rechecking that we'd gathered everything. I loaded the car methodically, my mind turning over possibilities I didn't want to consider. Had Grace been having an affair? Was that why Derek had suddenly needed space to figure things out? Had Amy discovered the truth and orchestrated this camping trip as some kind of confrontation? The pieces seemed to fit together with horrible clarity. Grace's recent distraction and phone checking, Derek's abrupt departure from Amy's life, Amy's barely contained rage during the drive up here, her story about revenge and murder told while staring directly at Grace. And now Amy was gone, leaving behind only her belongings and this photograph that Grace clearly recognized but refused to explain. We drove home in relative silence, the radio playing softly between us. Grace stared out the passenger window at the passing forest, her reflection ghostlike in the glass. I kept glancing at her profile, looking for some sign that she wanted to tell me the truth.... but her expression remained closed and distant. The photograph felt like it was burning a hole in my pocket. Every few miles, I'd shift in my seat and feel it crinkle against my leg, a constant reminder of the questions Grace wouldn't answer. The man in the picture had looked comfortable, confident, the kind of person who belonged in expensive restaurants and knew how to make women laugh the way Grace was laughing. I thought about Amy's story, the way she'd described following her friend to a motel on Highway 12. Had that been literal truth disguised as fiction? Had Amy actually followed Grace somewhere, camera in hand, documenting evidence of betrayal? The drive back to town felt endless. Grace dozed fitfully against the passenger door, her breathing uneven, and her hands clenched even in sleep. I found myself checking the rear view mirror more often than necessary, half expecting to see Amy's car following us, but the road behind remained empty. Two days passed in a strange kind of suspended animation. Grace went to work, came home, made dinner, watched television. We moved around each other with careful politeness like roommates rather than partners. She didn't ask about the photograph, and I didn't volunteer to discuss it, but I could feel its presence between us, an unspoken weight that made every conversation feel artificial. I kept thinking about Amy. Where had she gone? How had she left the campsite without us hearing her? Her car was presumably still at her apartment, which meant she'd either walked out of the forest or someone had picked her up. Neither option made much sense given the remote location and the early hour. Wednesday afternoon, I was at my desk reviewing quarterly reports when my phone rang. Grace's name appeared on the screen, and I answered automatically. \"Hey, what's up?\" \"Levi.\" Her voice was shaky, higher pitched than normal. \"I need to tell you something.\" I straightened in my chair, suddenly alert. \"What's wrong?\" \"Amy's mother just called me.\" Grace's words came out in a rush, like she was afraid she'd lose her nerve if she slowed down. \"Amy never came home from the camping trip.\" The report in my hand suddenly felt very heavy. \"What do you mean?\" \"She never went home Sunday. Her mother got worried when she didn't return her calls, so she went to check on her. Amy's car is still in the parking lot at her apartment. She never made it back.\" I set down the report and leaned back in my chair, staring at the ceiling tiles. \"Did you tell her mother what happened, about Amy leaving the campsite?\" \"I told her Amy was upset about Derek and that she left early Sunday morning, but Levi,\" Grace's voice dropped to almost a whisper. \"Her mother wants to call the police.\" The photograph in my jacket pocket seemed to grow heavier. I thought about Amy's story, about cliffs and bodies that were never found, about revenge and justice and secrets that people would kill to protect. \"Maybe that's a good idea,\" I said quietly. Grace was silent for a long moment. When she spoke again, her voice was barely audible. \"What are we going to tell them?\" The reality hit me like ice water spreading through my chest. Amy's mother hadn't heard from her. Amy's car was still at her apartment. Amy had never made it home. I set the quarterly reports aside, my hands moving automatically while my brain tried to process what Grace had just told me. Three days. It had been three days since we'd driven back from Pine Ridge, and Amy Manning had simply vanished into nothing. \"Her mother's really worried,\" Grace continued, her voice thin through the phone's speaker. She said, \"Amy always calls on Sundays. Always.\" And when she didn't answer Monday or Tuesday, I could hear Grace moving around wherever she was, probably pacing. She always paced when she was nervous. The sound of her footsteps came through faintly along with what might've been traffic in the background. \"Where are you?\" I asked. \"Downtown. I had to pick up some files from the courthouse.\" A pause. \"Levi, what if something happened to her after she left? What if she got lost hiking back to her car or...\" \"Her car's at her apartment,\" I said. \"You said her car's at her apartment.\" \"Right. Yes.\" \"So, she made it back to the parking lot.\" Grace's voice picked up slightly like she was grabbing onto this detail. \"She drove home, but then what?\" \"Maybe she went somewhere else. Maybe she decided to take a trip to clear her head about Derek.\" I pulled the photograph from my jacket pocket without really thinking about it. The man with dark hair smiled back at me. His arm around Grace's shoulders. The Christmas earrings caught the light from the restaurant patio. Her blue sweater looked soft and expensive. \"Grace,\" I said. \"We need to talk about that photo.\" Silence on the other end. Complete silence. Not even the sound of footsteps. \"I know you recognized him,\" I continued. \"I know you know who he is.\" \"Levi, this isn't the time. Amy is missing. Her mother wants to call the police. Maybe we should let her.\" Another pause, longer this time. When Grace spoke again, her voice had dropped to almost a whisper. \"What are we going to tell them?\" I opened my mouth to respond, but before I could say anything, my office phone rang. The harsh electronic sound cut through our conversation, making me jump slightly in my chair.\"Hold on,\" I told Grace, then answered the desk phone. \"Hello?\" \"Is this Levi Luna?\" The voice was male, professional, with the kind of measured tone that meant official business. \"Yes.\" \"This is Officer Ronnie Lawson with the County Sheriff's Department. I need to speak with you about Amy Manning. Are you available this evening for some questions?\" My mouth went dry. I looked at my cell phone, still connected to Grace, then back at the desk phone. \"Questions about what?\" \"Miss Manning was reported missing this afternoon. We understand you were one of the last people to see her. We'd like to get a statement from you and your girlfriend about your recent camping trip.\" I felt the world shift slightly, like someone had tilted the building just a few degrees. \"We're available,\" I heard myself say. \"What time?\" \"Would 7:30 work? We can come to your apartment if that's convenient.\" \"That's fine.\" I gave him the address, my voice sounding strange and distant, even to myself. \"Officer Lawson, is Amy... Do you think something's happened to her?\" \"We're just gathering information at this point, Mr. Luna. We'll see you at 7:30.\" The line went dead. I stared at the desk phone for a moment, then picked up my cell. \"Grace, the police just called.\" \"What?\" Her voice shot up an octave. \"What did they say?\" \"They want to question us tonight, about the camping trip. About Amy.\" I could hear Grace breathing on the other end, quick and shallow. \"Oh, God. Oh, God, Levi, what are we going to tell them?\" \"The truth.\" I slid the photograph back into my jacket pocket. \"We're going to tell them the truth.\" \"But what about... What about the photo? What about what Amy said around the fire?\" I closed my eyes and rubbed my forehead. Amy's story came back to me in vivid detail. Two best friends. One discovers the other is sleeping with her boyfriend. A camping trip for revenge. A cliff. A body that was never found. \"We tell them Amy was upset about Derek,\" I said slowly. \"We tell them she seemed angry and withdrawn. We tell them we found her tent empty in the morning and assumed she'd hiked out early.\" \"That's all true,\" Grace said quickly. \"That's all completely true.\" \"Grace.\" I kept my voice level, careful. \"Is there anything else I should know before the police get here?\" The pause stretched so long I thought the call might have dropped. Finally, Grace spoke, her voice barely audible. \"No, there's nothing else.\" But I could hear the lie in her voice as clearly as if she'd announced it. The rest of the afternoon crawled by. I tried to focus on work, but every few minutes, my mind would drift back to Amy's empty tent, to Grace's obvious deception about the photograph, to the flat, hollow sound of Amy's voice when she'd called out, \"Just getting water,\" from the darkness. I left the office at 5:00 and drove home through downtown traffic that seemed heavier than usual. Every red light felt like it lasted forever. Every pedestrian crossing the street moved too slowly. By the time I pulled into our apartment complex parking lot, my hands were gripping the steering wheel so tightly, my knuckles had gone white. Grace was already home when I walked in. She was sitting on the couch, still wearing her work clothes, staring at her hands folded in her lap. She looked up when I entered, and I could see she'd been crying. \"How long have we got?\" she asked. I checked my watch. \"About an hour and a half.\" She nodded and went back to staring at her hands. I sat down beside her, leaving some space between us. The photograph felt heavy in my jacket pocket. \"Grace,\" I said. \"Whatever's going on, whatever happened, we can figure it out, but I need you to be honest with me.\" She looked at me then, her eyes red-rimmed and exhausted. \"I can't,\" she whispered. \"I can't talk about it right now. After the police leave, maybe, but not now. I can't fall apart right now.\" I wanted to push. I wanted to demand answers about the photograph, about Derek, about why Amy had hated her so much. But looking at Grace's face, seeing how close she was to breaking completely, I just nodded. \"Okay,\" I said. \"After.\" We spent the next hour and a half in careful, artificial preparation. Grace changed into jeans and a sweater. I made coffee, then realized my hands were shaking too much to pour it properly. We went over our story again, sticking to the basic facts. Amy seemed upset. Amy was angry about Derek. Amy's tent was empty in the morning. We assumed she'd left early. At exactly 7:30, there was a knock on our door. Officer Ronnie Lawson was a stocky man in his mid-30s with short, black hair and a mustache. He wore the standard county sheriff uniform and carried a small notebook. He shook both our hands and accepted Grace's offer of coffee before settling into our armchair. \"I want to thank you both for making time for this,\" he said, pulling out his notebook and a pen. \"I know this must be concerning for you.\" The words hung in the air between us. Officer Lawson's pen poised over his notebook, waiting for our response. I tried to piece together what Grace had just told him about Amy leaving early Sunday morning, but something fundamental wasn't adding up. The timeline felt wrong in a way that made my stomach clench.I remembered Saturday night with perfect clarity. Amy had emerged from her tent after we built the fire, positioned herself on that log, and told her story about the two friends. The betrayal story. The cliff story. The story that had made Grace cry and shake until she couldn't speak. Amy had looked directly at Grace the entire time. Her voice steady and cold as she described one friend pushing the other off a cliff edge. Then she'd announced she was tired, walked to her tent, and zipped herself inside. But Grace had just told Officer Lawson that Amy had been upset about Derek and left early in the morning, that we'd assumed she'd hiked out before we woke up. I pulled the photograph from my wallet, the one I'd found in Amy's sleeping bag. The edges were worn from my handling it over the past few days, turning it over and over while trying to make sense of everything. Grace's face smiled back at me from the glossy surface, radiant and intimate with the dark-haired man who definitely wasn't me. Her Christmas earrings caught the restaurant lighting, the same ones she'd been wearing constantly for months. The blue sweater I'd bought her last spring. Everything about the photo screamed recent, screamed affair, screamed betrayal. Amy's voice echoed in my memory from that night around the campfire. The way she described the betrayed friend discovering text messages, following the cheating couple to a motel on Highway 12, watching through a window. The clinical precision with which she detailed the camping trip invitation, the hike to the cliff overlook, the final confrontation, the push, the body falling into an unreachable ravine, never to be found. My hands started trembling as the pieces clicked into place. Amy hadn't been telling a scary story for entertainment. She'd been confessing. She'd been telling Grace exactly what had happened between them, and exactly what Grace had done to her. I stared at Grace sitting beside me on our couch, answering Officer Lawson's questions about Amy's emotional state during the camping trip. Grace's voice sounded steady and concerned, the perfect worried friend helping with the missing person investigation. But I remembered how she'd looked across the fire when Amy told her story. The way her face had gone white, her breathing shallow, her hands gripping that sandwich wrapper until her knuckles went bloodless. Grace hadn't looked surprised by Amy's accusations. She'd looked caught. The whispered words outside our tent came flooding back. Those deliberate footsteps circling our campsite for over an hour. The measured pace, the pauses at specific locations. Grace had grabbed my hand inside the sleeping bag, her pulse racing against my palm. When I'd called out, asking if it was Amy, that voice had responded from the wrong direction. \"Just getting water.\" But the voice had come from near the tree line, not from Amy's tent, and it had sounded hollow, distant, like it was traveling from somewhere much farther away than 20 feet. I began to understand something that made my vision blur around the edges. Amy had been dead when she told us that story. Amy had been dead when she circled our tent, whispering in the darkness. Amy had been dead, and somehow she'd found a way to come back and make sure someone knew the truth about what Grace had done to her. The impossibility of it should've made me dismiss the thought entirely. Dead people don't sit around campfires telling stories. Dead people don't walk in circles outside tents. Dead people don't leave photographs in sleeping bags for boyfriends to find. But I'd experienced all of it firsthand. I'd watched Amy's lips move as she spoke, seen her lean forward toward the fire, observed her stand up and walk to her tent. I'd heard her footsteps on the pine needles, listened to her voice claim she was getting water. Grace had killed Amy, probably pushed her off some cliff overlook during a confrontation about the affair, just like Amy had described in her story. Amy's body was lying at the bottom of some ravine where it would never be found, exactly as she'd predicted. But somehow Amy had managed to arrange one final camping trip, one last chance to sit across from her murderer and tell the truth about what had happened between them. I looked at Grace with completely new eyes. The woman I'd been living with for two years, sharing a bed with, making coffee for every morning. The woman who'd seemed nervous and distracted for months, who'd been checking her phone constantly, who'd been having an affair with Amy's boyfriend, Derek. The woman who'd convinced me to go camping to help Amy heal from her breakup, when really, she'd been responding to some supernatural summons from the friend she'd murdered. Grace noticed me staring and gave me a questioning look while Officer Lawson flipped through his notebook pages. Her expression was concerned and slightly puzzled, the look of someone wondering why their boyfriend was acting strange during a police interview. But I could see something else underneath now that I knew what to look for, a wariness, a calculation, the constant assessment of someone who'd committed murder and was working to keep it hidden. Officer Lawson asked about Amy's belongings, whether she'd taken everything with her when she left. Grace explained that Amy had left her tent and sleeping bag behind, which we'd packed up and brought home. She gestured toward the closet where we'd stored Amy's camping gear, her voice carrying just the right note of concern for a missing friend. But Amy hadn't left anything behind. Amy had never been there to leave anything behind.Amy had been dead before we'd even driven to her apartment building to pick her up. What we packed into our car was the camping gear of a dead woman, items that had somehow manifested for this final supernatural confrontation, the sleeping bag where I'd found the photograph, the tent that had stood empty because its owner was already lying broken at the bottom of some ravine. I tried to remember details from that first day, looking for signs I'd missed, Amy's hollow appearance when she'd emerged from her apartment building, wearing dark sunglasses despite the overcast weather, her complete lack of engagement during the car ride, the flat emotionless responses to Grace's attempts at conversation, the way she'd seemed diminished, reduced to something fragile and strange, the hostility that it felt too intense for a simple boyfriend betrayal. Amy had been trying to tell me something even then. The sunglasses hiding whatever dead eyes might've looked like, the silence because speaking required enormous effort when you were calling across the divide between life and death, the hostility because she was sitting three feet away from the person who'd murdered her, forced to maintain some semblance of normal interaction until she could reveal the truth. Grace was still talking to Officer Lawson about Amy's emotional state, describing her as withdrawn and angry about Derek's sudden need for space. She mentioned that Amy had seemed particularly bitter about being betrayed by someone she trusted. The irony of Grace's words made me dizzy. She was describing Amy's feelings about discovering Grace's affair with Derek but presenting it as if Amy had been betrayed by Derek alone. Officer Lawson asked if we'd noticed anything unusual during the camping trip, anything that might explain why Amy would disappear afterward. Grace shook her head, maintaining that Amy had simply been dealing with heartbreak and [suspenseful music]"
}