{
  "title": "I Went Camping in The Woods With My Family. I Saw Something I'll Never Forget.",
  "upload_date": "",
  "duration_sec": 5430.0,
  "segments": [],
  "full_text": "I shoved another sleeping bag into the back of our Honda Pilot, trying to fit everything Catherine had deemed essential for three days in the woods. The cargo area looked like a sporting goods store had exploded. Tents, coolers, camp chairs, enough food to feed a small army, and what appeared to be every piece of outdoor gear we'd accumulated over the years but never actually used. This whole camping thing wasn't my idea. I'd been perfectly content with our usual family vacations, hotel pools, room service, air conditioning that actually worked. But Catherine had been pushing for months about getting the kids closer to nature and making real memories away from screens. Hard to argue with that logic, even if the thought of sleeping on the ground for three nights made my back ache preemptively. \"Dad, where does this go?\" Orion appeared at my elbow, holding up a mesh bag full of marshmallows, chocolate bars, and graham crackers. \"Anywhere you can find space, buddy.\" I moved a lantern to make room. The kid had been buzzing with excitement for weeks, ever since we'd booked the campsite. He'd checked out every camping book the library had, watched YouTube videos about knot tying, and packed his backpack approximately 15 times. His enthusiasm was infectious, even if it didn't completely override my own reservations. Catherine emerged from the house carrying Kerry's pink sleeping bag and a small duffle bag. \"I think that's everything,\" she said. But I caught her doing a mental inventory, lips moving slightly as she counted items. \"We're going camping, not colonizing Mars,\" I said, gesturing at our overloaded vehicle. She laughed and bumped my shoulder. \"Better to have too much than not enough. Besides, this is the kids' first real camping experience. I want it to be perfect.\" That made two of us, though my definition of perfect probably involved fewer bugs and more indoor plumbing. But watching Kerry carefully arrange her stuffed animals in the back seat, making sure each one could see out the window, I had to admit Catherine was right. The kids deserved this kind of adventure, even if their old man preferred adventures that didn't involve portable toilets. \"Can we go now?\" Orion bounced on his toes beside the car. \"It's already past 9:00, and we still have to drive there and set everything up. Patience, kiddo.\" I did one final check of the cargo area, making sure nothing would go flying if I had to brake hard. \"Your mom's just grabbing the last few things.\" Catherine reappeared with a first aid kit and a bag of what looked like enough snacks for a week. \"Okay, now I think we're really ready.\" The drive to Pine Ridge Campground took about two hours, winding through increasingly dense forest as we left the suburbs behind. The kids pressed their faces to the windows, pointing out hawks circling overhead and deer grazing in distant meadows. Catherine navigated from the passenger seat, consulting the printed directions she'd gotten from the campground's website. She didn't trust GPS out here, and honestly, neither did I. Cell service had dropped to one bar about 30 minutes ago. Pine Ridge sat in a valley surrounded by towering evergreens that seemed to block out half the sky. The campground office was a small log building with a hand-painted sign and a gravel parking area. I checked us in with a friendly woman who looked like she'd been running the place for decades, got our site assignment and a map, then drove slowly along the narrow campground road. Site 23 was tucked back among a cluster of massive pine trees, far enough from the main road that we'd have privacy but close enough to the bathhouse that the kids wouldn't get lost trying to find it in the dark. A picnic table and fire ring marked the boundaries of our temporary home. \"This is perfect,\" Catherine said, stepping out and breathing deeply. \"Just listen to how quiet it is.\" She was right. After the constant hum of traffic and air conditioners back home, the silence felt almost overwhelming, just wind moving through the pine branches and the distant sound of water running somewhere deeper in the woods. \"Where do we put the tent?\" Kerry asked, clutching her favorite stuffed rabbit. Good question. I pulled the tent bag from the car and spread the instructions on the picnic table, trying to make sense of the diagram. The tent was supposed to sleep four people comfortably, though the definition of comfortable was apparently open to interpretation. \"How about over there?\" I pointed to a relatively flat area between two large trees. Far enough from the fire ring that we won't get smoke, but close enough to the picnic table. What followed was 45 minutes of me wrestling with tent poles, stakes, and a rain fly that seemed designed by someone who'd never actually used a tent. Catherine offered helpful suggestions while keeping the kids occupied, but I could tell she was fighting back laughter as I tried to figure out why the tent kept collapsing on one side. \"Maybe if you try putting that pole through the other loop,\" she suggested gently. \"I know what I'm doing,\" I muttered, though clearly I didn't. The instructions might as well have been written in ancient Greek. Eventually, through some combination of luck and stubborn persistence, we got the tent standing. It looked slightly lopsided and the rain fly had a suspicious wrinkle, but it would keep us dry if it rained. \"Can we explore now?\" Orion was practically vibrating with excitement. \"Let's get the rest of our stuff set up first,\" Catherine said. \"We'll need firewood before it gets dark.\"The kids took off into the surrounding trees with Catherine supervising, collecting fallen branches and pine cones while I organized our camp kitchen on the picnic table. The Coleman stove looked simple enough, and Catherine had planned our meals carefully. Nothing too complicated for our first camping attempt. By the time they returned with armloads of wood, I had the stove assembled and our food organized. The sun was starting to sink behind the trees, casting long shadows across our campsite. \"Dad, look what I found.\" Carrie held up a pine cone the size of a softball. \"It's huge.\" \"That's from a sugar pine,\" Catherine said, examining it. \"See how long it is? They can grow up to 20 inches.\" I had no idea how she knew that, but the kids were impressed. They spent the next few minutes arranging their collection of pine cones, interesting rocks, and a piece of bark that supposedly looked like a dinosaur. Dinner was surprisingly successful. Hotdogs and baked beans cooked on the camp stove with chips and fruit Catherine had precut at home. We ate at the picnic table as darkness settled around us. The battery-powered lantern casting a warm circle of light. \"This is the best dinner ever,\" Orion declared through a mouthful of hotdog. \"Better than pizza?\" I asked. He considered this seriously. \"Different kind of good, like adventure good.\" Adventure good. I could live with that. After dinner, I got our first campfire going with some help from the fire starting cubes Catherine had insisted we bring. The flames caught quickly, sending sparks up into the darkening sky. The kids pulled their camp chairs close, marshmallow roasting sticks at the ready. \"Tell us a story, Dad,\" Carrie said, settling into her chair with her stuffed rabbit on her lap. \"What kind of story?\" \"A scary one.\" Orion grinned. \"But not too scary.\" So I launched into an elaborate tale about the Ghost of Pine Ridge, a friendly spirit who protected campers from wild animals but sometimes played harmless pranks like hiding people's shoes or making their marshmallows disappear. I made my voice dramatic for the scary parts and silly for the funny ones, watching the kids' faces in the firelight as they hung on every word. Catherine smiled at me over their heads, her expression soft in the flickering light. This was what she'd wanted, all of us together. No distractions, just family time. And despite my earlier reluctance, I had to admit it felt good. Different from our usual routine, but good. \"Is the ghost here right now?\" Carrie whispered, looking around at the dark trees surrounding our campsite. \"Only friendly ghosts around here,\" I assured her. \"The mean ones don't like the smell of roasted marshmallows.\" That got a giggle and the mood lightened as we finished making s'mores and Catherine told them about the constellations starting to appear overhead. By 9:30, both kids were yawning despite their protests that they weren't tired. Getting everyone ready for bed in a tent was more complicated than I'd anticipated. The kids had to brush their teeth at the campground's bathhouse, which meant a short walk with flashlights. Then there was the logistics of four people changing into pajamas in a space the size of our walk-in closet at home. But eventually we were all settled in our sleeping bags, the battery-powered lantern dimmed to its lowest setting. Catherine and I had zipped our bags together with the kids on either side of us. Carrie fell asleep almost immediately, clutching her rabbit. Orion lasted a few minutes longer, whispering questions about whether we'd see any deer in the morning. \"Go to sleep, buddy,\" I murmured. \"Big day tomorrow.\" Catherine's breathing evened out next, leaving me alone with my thoughts in the darkness. I clicked off the lantern and the tent filled with complete blackness. Outside, the wind moved through the pine branches with a sound like rushing water. That's when I really noticed how isolated we were. During the day with the kids laughing and Catherine chatting, the campground had felt cozy and welcoming. But now in the darkness, I became aware of just how far we were from civilization. The nearest town was at least 30 minutes away, and our campsite felt tucked away from the rest of the world. The silence wasn't really silence at all. Small sounds carried through the night air. Branches creaking, something rustling in the underbrush, the distant call of an owl. Normal forest sounds, I told myself, but they seemed amplified in the darkness. Every noise made me wonder what was moving around out there beyond our small circle of safety. The dense woods pressed in around our campsite, and I found myself listening intently to the unfamiliar sounds echoing from the forest. I woke to the sound of Carrie stirring beside me, her small hand patting around for her stuffed rabbit. Gray morning light filtered through the tent fabric, and I could hear birds calling from somewhere high in the pine trees. My back ached from sleeping on the ground, and my neck felt stiff from the makeshift pillow I'd made from a rolled up sweatshirt. Catherine was already awake, sitting up in her sleeping bag and staring at the tent wall. That struck me as odd since she usually slept later than the rest of us, especially on weekends. Her dark hair was messy from sleep, but her eyes looked alert, almost too alert for someone who'd just woken up. \"Morning,\" I whispered, trying not to wake Orion, who was still dead to the world.She turned toward me, and for a second, her expression seemed startled, like she'd forgotten I was there. Then she gave me a quick smile that didn't quite reach her eyes. \"Morning.\" Something felt off about her voice, but I couldn't pinpoint what. Maybe she was just groggy. Camping wasn't exactly her usual routine, and the hard ground probably hadn't done her any favors either. I helped get the kids up and dressed and we made our way to the bathhouse for morning routines. The air was crisp and clean with that pine scent that seemed to get stronger in the morning. Orion was already chattering about what we might do today, full of energy despite having stayed up later than usual the night before. Back at the campsite, I fired up the camp stove and started breakfast while Catherine sat at the picnic table with the kids. I'd brought pancake mix and bacon, figuring a hot breakfast would be a nice treat on our second day. The bacon sizzled in the cast iron pan and I mixed up the pancake batter in a plastic bowl. That's when I really noticed something was wrong with Catherine. She sat at the far end of the picnic table, her plate in front of her with a single pancake and two strips of bacon that she'd barely touched. Instead of eating or talking with Orion and Carrie, she kept turning to look over her shoulder toward the woods behind our campsite. Not just casual glances, but long focused stares, like she was watching something specific. The kids were busy with their food, Orion drowning his pancakes in syrup while Carrie carefully cut hers into small, precise squares. They didn't seem to notice their mother's distraction, but I couldn't stop watching her. Every few minutes, Catherine would turn back to her plate, take a small bite, then her attention would drift again to that same spot in the forest. The dense trees stood maybe 30 feet behind our campsite. Their trunks thick and dark in the morning shadows. I followed her line of sight, but saw nothing unusual. Just pine trees, undergrowth, and the kind of deep forest that stretched for miles in every direction. \"You feeling all right?\" I asked, settling down beside her with my own plate. Catherine's head snapped back toward me, and for a moment, she looked confused like she'd been pulled out of deep thought. \"What? Oh, yes, I'm fine.\" The smile she gave me felt forced, the kind of expression you put on when you're trying to convince someone everything's normal when it's not. I'd been married to her for 12 years, and I knew the difference between her genuine smiles and the ones she used when she didn't wanna worry me. \"You sure? You seem a little distracted.\" \"Just tired, I guess. Didn't sleep as well as I thought I would.\" That made sense. The ground was hard and the sounds of the forest at night were different from what we were used to at home. But even as she said it, her eyes drifted back toward the trees, and I caught her doing that intense staring thing again. I decided not to push it. Maybe she really was just tired or maybe camping was more stressful for her than she wanted to admit. Some people weren't comfortable being this far from civilization and Catherine had never been much of an outdoors person to begin with. The rest of breakfast passed quietly. Orion finished his pancakes and immediately started planning our day, suggesting we explore more of the campground or maybe try to spot some wildlife. Carrie nodded along with whatever her brother proposed, content to follow his lead like she usually did. But Catherine remained distant, picking at her food and continuing those strange glances toward the forest. After breakfast, I cleaned up the dishes while Catherine helped the kids get ready for the day. We decided to take a walk around the campground, maybe check out the small lake I'd seen marked on the map they'd given us at check-in. The morning was warming up nicely and it seemed like a good way to spend a few hours before lunch. The walk should've been relaxing. The campground was bigger than I'd realized with dozens of sites spread throughout the pine forest. Most were occupied by other families and we passed several groups setting up for the day or tending to their own campfires. Orion and Carrie enjoyed seeing the different types of tents and RVs, and Orion struck up conversations with a few other kids we encountered along the way. But Catherine's behavior only got more concerning as the morning went on. We'd be walking along one of the campground's dirt paths, talking about something completely normal when Catherine would suddenly stop mid-sentence. Not just pause to think of a word or get distracted by something the kids were doing. She'd stop talking entirely and turn to stare at some random spot in the woods. Her whole body going still like she was listening for something. The first time it happened, I thought maybe she'd heard an animal or was looking at something interesting. But when I followed her line of sight, I saw nothing. Just trees and undergrowth, the same forest that surrounded the entire campground. \"What is it?\" I asked. Catherine blinked and looked at me like she was surprised to find me standing there. \"What's what?\" \"You were staring at something.\" She glanced back toward the trees, then shook her head. \"Nothing. I thought I saw... Never mind.\" But it kept happening. Every 10 or 15 minutes, Catherine would stop whatever she was doing and focus intently on some spot in the forest. Always the same kind of concentrated attention, like she was watching something move or waiting for something to appear.... and always followed by that same confused expression when I asked her about it, like she couldn't quite explain what had caught her attention. The kids didn't seem to notice at first. They were too busy exploring and enjoying the novelty of being in such a different environment. But by the time we reached the small lake at the center of the campground, even Orion was starting to pick up on his mother's strange behavior. \"Mom, what are you looking at?\" he asked when Katherine stopped again, this time staring across the lake toward a stand of particularly dense pine trees. \"Oh, I just... I thought I saw a deer.\" Orion immediately perked up and started scanning the tree line, excited at the possibility of spotting wildlife. But there was no deer, and after a few minutes of searching, he lost interest and went back to throwing rocks into the water with Kerry. I pulled Katherine aside while the kids were distracted. \"Seriously, what's going on? You've been acting weird all morning.\" She looked at me with an expression I couldn't quite read, not angry or defensive, but something closer to uncertainty, like she wasn't sure how to explain what was happening to her. \"I don't know. I keep feeling like someone's watching us.\" That sent a chill through me, but I tried to keep my voice calm. \"Watching us? What do you mean?\" \"I can't explain it. It's just a feeling, like there's someone in the trees following us around.\" I looked across the lake toward the area where she'd been staring. The forest was thick and dark with plenty of places where someone could conceivably hide and watch without being seen. But the idea seemed paranoid, and nothing I'd observed suggested we were being followed. \"Have you actually seen anyone?\" Katherine hesitated. \"No, not exactly. But I keep getting this feeling, and when I look...\" She trailed off, shaking her head. \"It's probably nothing. You're right, I'm probably just tired.\" I wanted to believe that, but her behavior didn't feel like simple fatigue. The way she kept focusing on specific spots in the forest suggested she was seeing or sensing something, even if she couldn't articulate what it was. We spent another hour at the lake, then headed back to our campsite for lunch. The afternoon passed more normally with Katherine seeming to relax somewhat as we played card games and the kids worked on a nature scavenger hunt I'd found in one of Orion's camping books. But I caught her doing the staring thing a few more times, always directed toward the dense woods that surrounded our site. By evening, I was starting to think maybe she was right about being tired. Camping was a big change from our usual routine, and being surrounded by unfamiliar sounds and environments could make anyone feel on edge. I figured a good night's sleep would help reset things, and tomorrow we'd pack up and head home with some good memories of our first family camping trip. After dinner, we had another campfire, and Katherine seemed more like herself as we roasted marshmallows. And I told the kids another story about the fictional ghost of Pine Ridge. But even then, I noticed her attention occasionally drifting toward the tree line, though she was more subtle about it with the kids around. When it came time to get ready for bed, I took Orion and Kerry to the bathhouse while Katherine stayed at the campsite to bank the fire and secure our food supplies. The kids were tired but happy, chattering about their favorite parts of the day as we walked back through the dark campground with our flashlights. Inside the tent, I helped both kids into their sleeping bags and made sure they had everything they needed for the night. Kerry found her stuffed rabbit and settled in quickly, while Orion asked his usual stream of questions about what we might see or do the next day. \"Will we see any bears?\" he asked, his voice already getting drowsy. \"Probably not,\" I said, tucking his sleeping bag around him. \"Bears usually stay away from campgrounds where there are lots of people.\" \"What about deer?\" \"Maybe, if we're quiet and lucky.\" Katherine had been moving around outside the tent, and I could hear her putting away the last of our camping gear. The fire was down to glowing embers, casting just enough light to see her silhouette through the tent fabric. \"Dad?\" Kerry's small voice came from my left. \"What is it, sweetheart?\" \"Is Mom okay? She seems sad today.\" Kids picked up on things adults thought they were hiding. Kerry had obviously noticed her mother's distracted behavior, even if she couldn't understand what it meant. \"She's fine. Just tired from all the camping activities. Tomorrow, we'll head home and she'll feel better.\" That seemed to satisfy Kerry, and within a few minutes, both kids were breathing deeply, well on their way to sleep. I was organizing my own sleeping bag when Katherine unzipped the tent flap and crawled inside. In the dim light from my flashlight, her face looked tense, almost worried. \"Lewis,\" she said, her voice low but urgent. \"We need to pack up and leave tonight.\" I stopped what I was doing and looked at her more carefully. Her expression was serious, not the tired uncertainty I'd been seeing all day, but something more intense. \"Leave? What are you talking about?\" \"We need to go now. We can pack everything up and be on the road in an hour.\" The urgency in her voice caught me off guard. This wasn't about being tired or uncomfortable with camping. This was something else entirely. \"Katherine, it's almost 10 o'clock at night. The kids are already asleep, and we're supposed to check out tomorrow morning anyway. What's the rush?\"She moved closer, her eyes wide and earnest. \"Something's wrong here. I can can feel it. We're not safe.\" \"Not safe? What do you mean we're not safe?\" I kept my voice low, mindful of the sleeping children, but Katherine's sudden panic was starting to worry me. This was way beyond anything I'd observed during the day. \"I can't explain it, but we need to leave right now. Please, Louis, just trust me on this.\" \"You have to give me more than that. What exactly do you think is dangerous? Is it another camper? Did someone say something to you?\" Katherine's face crumpled with frustration. \"No, it's not. It's not like that. It's just this feeling I've been having all day, like something's watching us, waiting for something, and it's getting stronger.\" I studied her face in the flashlight beam. She looked genuinely frightened, but I couldn't understand what had triggered such an extreme reaction. We were in a public campground surrounded by other families. The worst thing we'd encountered was some loud teenagers at a site near the bathhouse. \"Katherine, I think you're letting your imagination run away with you. It's dark. We're in an unfamiliar place, and you're probably just feeling anxious about being so far from home.\" \"This isn't anxiety,\" she said, her voice getting more insistent. \"Something is wrong here. I know how that sounds, but I'm telling you, we need to go.\" \"And I'm telling you, we're not waking up two exhausted kids to pack up our entire campsite in the dark because you have a bad feeling.\" The words came out harsher than I'd intended, but Katherine's panic was starting to feel irrational. We'd had a perfectly normal day aside from her distracted behavior, and the idea of abandoning our camping trip in the middle of the night seemed like a massive overreaction. Katherine stared at me for a long moment, and I could see the conflict playing out across her face. She wanted me to take her seriously, but she couldn't provide any concrete reason why we should uproot everything and leave. \"Please,\" she said again, but her voice had lost some of its urgency. \"I know it doesn't make sense, but I really think we should go.\" I reached over and squeezed her hand. \"Look, I know camping isn't really your thing, and maybe being out here is more stressful than you expected, but we've got one more night, and then we'll head home tomorrow morning as planned. You can make it one more night, right?\" Katherine looked like she wanted to argue further, but something in my tone must have told her I wasn't going to be swayed. She nodded reluctantly, though her expression remained troubled. \"One more night,\" she said quietly. I turned off the flashlight and settled into my sleeping bag, assuming the conversation was over. Katherine was probably just overwhelmed by the whole camping experience, and by tomorrow, she'd be laughing about her middle-of-the-night panic attack. Some people weren't cut out for sleeping in the wilderness, and there was nothing wrong with that. But as I lay there in the darkness listening to the familiar sounds of the forest around us, I couldn't completely shake the memory of Katherine's frightened expression or the genuine urgency in her voice when she'd begged me to pack up and leave immediately. I jerked awake to the sound of a zipper. My brain took a few seconds to catch up, processing the dim, gray shapes of the tent around me and the soft breathing from where Orion and Kerry slept. The sound came again, a quiet, deliberate pull of fabric against fabric. Katherine's sleeping bag lay flat and empty beside me. My chest tightened. I blinked hard, hoping I was still half-asleep and seeing things wrong, but the empty space where she should've been remained stubbornly real. The sleeping bag looked like she'd climbed out carefully, deliberately, not like someone getting up to use the bathroom. I pushed myself up on my elbow and listened. Nothing from outside the tent except the usual forest sounds, wind through the pines, the distant hoot of an owl. No footsteps. No voices. No indication of where she might've gone or why. This wasn't like Katherine. Even when we were dating, she never wandered off without saying something. And after her behavior yesterday, after she'd begged me to pack up and leave because she felt like something was watching us, the empty sleeping bag sent a chill straight through me. I checked my watch, 3:12 in the morning. \"Katherine?\" I whispered, keeping my voice low enough not to wake the kids. Silence. I unzipped my sleeping bag as quietly as possible and crawled toward the tent entrance. Maybe she was sitting outside by the fire ring, unable to sleep. Maybe she'd just needed some air and didn't wanna wake us. That had to be it, the logical explanation. But when I unzipped the tent flap and peered out, the campsite sat empty. Our camp chairs remained folded and leaning against the picnic table where I'd left them. The fire had died down to cold ashes hours ago. No sign of Katherine anywhere. My pulse picked up speed. I grabbed my flashlight from beside my sleeping bag and slipped my feet into my hiking boots without bothering with socks. The kids were still breathing steadily. Kerry clutched her stuffed rabbit, and Orion had one arm flung over his face, the way he always slept at home. I stepped out into the cool night air and swept the flashlight beam around our campsite. Everything looked exactly as we'd left it before going to bed. Food secured in the car, camp stove stored under the picnic table, our water bottles lined up on the bench. \"Katherine?\" I called, louder this time, but still trying to keep my voice from carrying too far.... nothing. The beam of my flashlight caught something near the edge of our campsite, where the packed dirt gave way to the softer forest floor. I walked over and crouched down, angling the light to get a better look. Footprints, bare feet pressed into the damp earth between the pine needles. Small enough to be Katherine's and definitely fresh. The edges were still sharp and clear. I followed the prints with my flashlight beam. They led away from our campsite and into the woods, heading in the direction Katherine had been staring at all day, the direction she claimed something was watching us from. My stomach dropped. This was exactly what I'd been afraid of when she started acting strange yesterday. The stress of camping, the unfamiliar environment, being away from home, it had gotten to her more than I'd realized. People did weird things when they were anxious or sleep-deprived. Sleepwalking wasn't uncommon, especially in stressful situations. But knowing that didn't make it any less terrifying to follow those bare footprints into the dark woods at 3:00 in the morning. I glanced back at our tent. Orion and Kerry were safe inside, still sleeping soundly. I could hear them breathing from here. The campground, the campground had other families nearby if something happened. I'd be gone for just a few minutes, long enough to find Katherine and bring her back. I stepped into the woods, following the footprints with my flashlight beam. The pine needles crunched softly under my boots, and branches caught at my shirtsleeves as I pushed deeper between the trees. The prints were easy to follow at first, clear impressions in the patches of bare earth between the roots and fallen logs. This was insane. What was Katherine thinking, wandering into the forest barefoot in the middle of the night? The ground out here was rough, full of sharp rocks and broken twigs. She could cut her feet, twist an ankle, get completely lost in the darkness. I tried to push down the growing panic in my chest. She couldn't have gone far. The prints were fresh, and she'd only been gone maybe 10 or 15 minutes at most. I would find her, bring her back to the tent. And in the morning, we'd pack up and head home early. No more camping for our family. \"Katherine,\" I called, louder now that I was away from the campsite. \"Where are you?\" My voice echoed off the tree trunks and faded into the darkness. I stopped and listened, hoping to hear her voice calling back, but only the wind answered me. The footprints led me deeper into the woods, winding between massive pine trunks and over fallen logs. I had to duck under low-hanging branches and step carefully around holes and root systems. My flashlight beam felt pathetically small against the vast darkness surrounding me. After what felt like 20 minutes of following the trail, I was starting to lose track of which direction led back to our campsite. The trees all look the same in the narrow circle of my flashlight, and I'd taken so many turns following Katherine's path that I wasn't sure I could retrace my steps. Then my light caught something ahead, a pale shape between two enormous pine trees, maybe 30 feet away. Katherine. She stood perfectly still, her back to me, wearing the same pajamas she'd gone to sleep in. Her feet were bare and dirty, and her hair hung loose around her shoulders. She wasn't moving at all, not even the slight sway of someone who was awake and standing. \"Katherine,\" I called, relief flooding through me. \"Thank God. I've been looking everywhere for you.\" She didn't respond, didn't turn around, didn't acknowledge my voice at all. She just stood there between those two trees like a statue. I walked closer, my boots crunching on the pine needles. \"Katherine, are you okay?\" Still nothing. As I got within 10 feet of her, I could see that she was staring straight ahead into the darkness between the trees. Her posture was rigid, unnatural, like she was frozen in place. \"Katherine, you're scaring me. Say something.\" I moved around to her side so I could see her face, and my blood went cold. Her eyes were wide open but completely vacant, not the look of someone who was awake and aware but not quite the peaceful expression of sleep either. Something in between, something wrong. Her lips were moving slightly, barely perceptible in the flashlight beam. At first, I couldn't hear anything. But as I leaned closer, I caught the faint sound of her voice. She was muttering something under her breath, the same words over and over again, so quietly I had to strain to make them out. \"It will all be over soon. It will all be over soon. It will all be over soon.\" The repetition sent ice through my veins. Her voice was flat, emotionless, like she was reading from a script. Not Katherine's voice at all, even though it was coming from her mouth. \"Katherine.\" I grabbed her shoulders and shook her gently. \"Wake up. You're sleepwalking. You need to wake up.\" She didn't react to my touch, didn't blink, didn't stop staring into the darkness, just kept muttering that same phrase over and over, \"It will all be over soon. It will all be over soon.\" I'd never seen anything like this. This wasn't normal sleepwalking. This was something else entirely, something that made every instinct in my body scream that we needed to get away from this place immediately.I wrapped my arms around Katherine's shoulders and tried to turn her away from whatever she was staring at. She moved when I guided her, but like a mannequin. No resistance, but no cooperation either. Her feet shuffled forward when I pulled her, but her eyes remained fixed on that same spot between the trees until I physically turned her head away. The walk back to our campsite felt like it took forever. I had to support most of Katherine's weight, and navigate by memory and instinct since I needed one hand to guide her and the other to hold the flashlight. She never stopped muttering that phrase, never showed any sign of awareness that I was there or that we were moving. When I finally saw the glow of our campsite through the trees, I nearly collapsed with relief. The tent sat exactly where we'd left it, and I could still hear the soft sounds of Orion and Kerry sleeping inside. I guided Katherine to the tent entrance and helped her climb inside. She moved mechanically like she was following some internal program rather than making conscious decisions. Once she was in her sleeping bag, she lay down and closed her eyes, and the muttering finally stopped. I sat beside her for a long time watching her face in the dim light of my flashlight. Her breathing had returned to the normal rhythm of sleep, and her expression looked peaceful again, like nothing had happened at all. But I couldn't shake the image of her standing between those trees, staring into the darkness with those vacant eyes, or the sound of her voice repeating those words over and over. \"It will all be over soon.\" I turned off my flashlight and lay down in my sleeping bag, but I knew I wouldn't be sleeping again tonight. Katherine climbed into her sleeping bag without a word. The scent of pancakes pulled me from the restless half-sleep I'd managed after Katherine's midnight episode. I blinked against the gray morning light filtering through the tent fabric, my body stiff from lying awake most of the night replaying the image of her standing motionless between those trees. Katherine's sleeping bag was empty again. My heart jumped, but then I heard her voice outside the tent, bright, cheerful, completely normal. She was talking to the kids. Her tone animated in a way that made last night feel like some kind of fever dream. \"Who wants extra chocolate chips in their pancakes?\" \"Me,\" Orion's voice came from right outside the tent wall. \"Me too,\" Kerry chimed in. I unzipped the tent flap and stepped into the morning air. Katherine stood at the camp stove, spatula in hand, hair pulled back in a neat ponytail. She wore clean clothes, jeans, and a light blue sweater, and her face looked refreshed like she'd gotten a full night's sleep. The kids sat at the picnic table, already dressed and chattering about something they'd seen near the bathhouse. \"Morning, sleepyhead,\" Katherine said, glancing over with a genuine smile. \"I thought I'd get breakfast started early so we could make the most of our last day.\" I stared at her, searching for any sign of the vacant-eyed woman I'd found in the woods hours earlier. Nothing. Her eyes were clear and focused, her movements purposeful and energetic. She flipped a pancake with practiced ease, completely present in the moment. \"You're up early,\" I said carefully. \"I woke up feeling great. Must've slept better than I thought.\" She poured more batter into the pan. The kids were already stirring, so I figured why not get a head start on the day? The casual way she said it made my stomach tighten, like she had no idea she'd been anywhere but in her sleeping bag all night. I watched her face for any flicker of recognition, any hint that she remembered our walk through the dark woods. \"Katherine,\" I said, keeping my voice low so the kids wouldn't hear. \"Do you remember getting up last night?\" She paused, spatula halfway to the pan. \"Getting up? When?\" \"Around 3:00 in the morning. You left the tent.\" Her brow furrowed and she turned to face me fully. \"I left the tent? What do you mean?\" The confusion in her voice sounded completely genuine, not like someone trying to avoid talking about something embarrassing, but like someone hearing about an event they had no knowledge of. \"You don't remember going into the woods?\" \"Louis, what are you talking about?\" She set the spatula down, her expression shifting to concern. \"I slept through the night. I mean, I think I had some weird dreams, but I never left the tent.\" I studied her face looking for any tell that she was lying or covering something up. Her eyes met mine directly, no hesitation or evasion. Either she was an incredible actress or she genuinely had no memory of what happened. \"Dad, are the pancakes ready?\" Orion called from the table. \"Almost, honey,\" Katherine answered, turning back to the stove. She lowered her voice. \"Louis, are you feeling okay? Maybe you had a bad dream?\" Maybe I did. Looking at her now, cheerful and normal and completely herself, the whole thing felt surreal. Had I really found her standing between those trees muttering about everything being over soon? The memory felt vivid and real, but Katherine's genuine confusion made me question what I'd actually experienced. \"Yeah,\" I said finally. \"Maybe it was just a dream.\" She reached over and squeezed my arm. \"You've been worried about me being anxious out here. Maybe you're the one who needs to relax.\" Her touch felt warm and reassuring, exactly like the Katherine I'd married.... not the hollow-eyed stranger from the woods. I wanted to believe it had been a dream, some kind of stress-induced nightmare brought on by her behavior yesterday. \"You're probably right,\" she smiled and turned back to the pancakes. \"Besides, look at this beautiful morning. Perfect for our last day here.\" I helped serve breakfast, watching Catherine interact with the kids. She was completely engaged, asking Orion about the bird sounds he'd been cataloging and helping Carrie plan what she wanted to add to her nature collection. No distant stares toward the woods, no sudden stops in conversation. Just the woman I knew enjoying time with our children. By the time we finished eating and cleaned up, I'd almost convinced myself it really had been a nightmare. Catherine's amnesia disturbed me more than I wanted to admit, but her cheerful demeanor and the kids' excited energy for our final day made it easier to push my doubts aside. We were supposed to check out tomorrow morning anyway. One more day couldn't hurt. \"So, what's the plan for today?\" Catherine asked, folding the camp chairs. \"I thought we could do that longer hike we talked about,\" I said. \"The one that goes deeper into the forest.\" \"Perfect. The kids have been wanting to explore more.\" We packed water bottles and snacks into my backpack, made sure the campsite was secure, and set off on the marked trail that led away from the campground into the denser woods. Orion and Carrie practically bounced with excitement, running ahead to examine every interesting rock or unusual tree they spotted. The trail wound through towering pines, their canopy filtering the sunlight into shifting patterns on the forest floor. Catherine walked beside me, pointing out wildflowers and commenting on the peaceful atmosphere. She seemed more relaxed than she'd been since we arrived, like whatever had been bothering her yesterday had completely lifted. \"This was a good idea,\" she said, breathing in the pine-scented air. \"I'm glad we came.\" The kids ranged ahead of us, their voices carrying back through the trees as they discovered things to add to their collections. Orion found a piece of bark with an interesting pattern. Carrie collected smooth stones that caught her eye. Their laughter echoed through the forest, a sound that made the woods feel welcoming instead of threatening. We'd been hiking for about an hour when the trail curved around a massive fallen log and opened into a small clearing. I stopped abruptly, my breath catching in my throat. In the center of the clearing, maybe 30 feet ahead, was a pile of dead animals. Rabbits, squirrels, and birds were stacked in an unnatural heap, their bodies twisted and torn apart. Some were missing limbs. Others had been ripped open, their insides spilling onto the ground. Flies swarmed around the display in thick clouds. And the smell hit me a second later, the sweet, nauseating stench of decay and death. My mind reeled, trying to process what I was seeing. The animals weren't just dead, they'd been mutilated, arranged deliberately in a grotesque pile like some kind of offering or warning. Blood had soaked into the earth around the heap, turning the dirt dark and sticky. \"Dad, look at this cool...\" Orion's voice came from somewhere ahead. \"Stop!\" I shouted, louder than I'd intended. \"Both of you, come back here right now.\" The kids turned, startled by my tone. They were only about 20 feet from the clearing. Close enough that they'd see the pile if they took a few more steps. \"Head back toward the campsite,\" I said, trying to keep my voice calm, but firm. \"I need to check something here.\" \"But, Dad...\" Orion started. \"Now, Orion, take your sister and go back the way we came. Wait for us on the trail.\" Catherine stepped up beside me, following my gaze toward the clearing. I heard her sharp intake of breath. \"Oh my God,\" she whispered. The kids reluctantly started back down the trail, Orion grumbling about not getting to explore more. I waited until their voices faded before moving closer to the horrific display. The animals had been dead for different amounts of time. Some were fresh, maybe killed within the last day or two. Others were further along in decay. Their fur matted and skin darkened. But they'd all been arranged in the same deliberate pattern, stacked on top of each other like a macabre sculpture. What could've done this? What kind of animal killed this many creatures and then arranged them in a pile? Bears didn't do this. Mountain lions didn't do this. This looked intentional, calculated, almost ritualistic. My mind raced with questions about what could've created such a horrific arrangement. I kept staring at the pile, trying to make sense of it all, when I heard a heavy thud behind me. Catherine had collapsed. She lay crumpled on the forest floor, her body completely limp. My heart jumped as I rushed to her side, dropping to my knees beside her still form. Her eyes were closed, face pale, but I could see her chest rising and falling in steady rhythm. She was breathing. Thank God she was breathing. \"Catherine?\" I shook her shoulder gently, then more firmly. \"Catherine, can you hear me?\" Nothing. Her body felt like dead weight in my hands, completely unresponsive.What the hell had just happened? One second she was standing there looking at that horrific pile of animals, the next she was on the ground. Had she fainted? Was it the smell? The shock of seeing something so disturbing? I checked her pulse at her wrist, strong and steady. Her breathing remained normal. No visible injuries, no blood. She just collapsed like someone had flipped a switch and turned her off. The smell from that pile of dead animals kept hitting me in waves, making my stomach turn. I couldn't leave her here, not in this place with whatever had created that nightmare display potentially still around. The kids were waiting back on the trail, probably getting worried about how long we'd been gone. I slid my arms under Katherine's knees and shoulders, lifting her as carefully as I could. She was heavier than I expected. Her body completely limp and uncooperative. Her head lolled back against my shoulder as I stood, and I had to adjust my grip to keep her secure. The walk back felt endless. Every few steps, I had to stop and readjust my hold on her. My arms burned from the strain, and sweat dripped down my back despite the cool forest air. I kept checking her face, looking for any sign that she was coming around, but her expression remained slack and peaceful, like she was in the deepest sleep of her life. \"Come on, Katherine,\" I whispered as I navigated around a fallen branch. \"Wake up. Please wake up.\" When I finally reached the trail where Orion and Kerry were waiting, their faces went white. \"What happened to Mom?\" Kerry's voice was tiny, scared. \"She just felt a little dizzy,\" I lied, trying to keep my voice calm and reassuring. \"She's going to be fine. Let's get back to camp so she can rest.\" The walk back to the campsite was torture. Both kids kept asking questions I couldn't answer, their worry evident in every word. Katherine remained unconscious in my arms, her weight making my shoulders ache and my back strain. I focused on putting one foot in front of the other, on getting us all back to safety. I laid her down on top of her sleeping bag in our tent, propping her head up with a small pillow. The kids hovered at the tent entrance, watching with wide, frightened eyes as I checked her pulse again and felt her forehead for fever. Everything seemed normal except for the fact that she wouldn't wake up. \"Is Mom going to be okay?\" Orion asked, his voice cracking slightly. \"She's going to be fine,\" I said, hoping I sounded more confident than I felt. \"Sometimes people faint when they get too hot or see something that upsets them. She just needs to rest.\" I sat beside Katherine, holding her hand and talking to her softly, telling her she was safe, that we were back at camp, that the kids needed her to wake up. After what felt like hours but was probably only 10 or 15 minutes, her eyelids fluttered. \"Katherine?\" I squeezed her hand. \"Can you hear me?\" Her eyes opened slowly, blinking several times as she tried to focus. She looked confused, disoriented, like someone waking up in a strange place. \"What happened?\" Her voice was groggy, weak. \"Why am I in the tent?\" Relief flooded through me. \"You fainted back on the trail. How do you feel?\" She sat up slowly, rubbing her temples. \"I feel fine, just a little tired.\" She looked around the tent, then at me, then at the kids who were still watching anxiously from the entrance. \"I fainted? I don't remember fainting.\" \"What's the last thing you remember?\" Katherine frowned, concentrating. \"We were hiking. The kids were ahead of us on the trail. We were talking about wildflowers.\" She paused, her brow furrowing deeper. \"Then nothing. I don't remember anything after that.\" She didn't remember the clearing. She didn't remember seeing that pile of mutilated animals. She didn't remember collapsing to the ground. It was like those memories had been completely erased. \"You're sure you feel okay now?\" I studied her face, looking for any sign of lingering confusion or distress. \"I feel fine, really.\" She reached out and hugged both kids, who immediately climbed into the tent to be closer to her. \"I'm sorry I scared you guys. Mommy just got a little tired.\" The rest of the day passed quietly. Katherine seemed completely back to normal, playing with the kids, helping prepare lunch, laughing at Orion's jokes. But I couldn't shake the image of that pile of dead animals from my mind. What kind of creature could do that? What kind of intelligence was behind such deliberate arrangement? And why couldn't Katherine remember any of it? As evening approached, I found myself watching her more carefully, looking for any signs that something was still wrong. But she seemed fine. Better than fine, actually. She was more relaxed and cheerful than she'd been since we arrived. After dinner, I built another fire while Katherine helped the kids get ready for bed. They brushed their teeth at the bathhouse, changed into pajamas, and settled into their sleeping bags with their usual bedtime routine. Katherine read them a story from one of the books we'd brought, her voice warm and soothing in the firelight. Once the kids were asleep, Katherine and I sat by the fire together,I'd opened a beer from our cooler, hoping the alcohol might help calm my nerves after the day we'd had. The flames danced and crackled, casting shifting shadows across our campsite. \"This has been a good trip,\" Katherine said, leaning back in her camp chair. \"The kids are having such a great time.\" I nodded, taking a sip of my beer. Part of me wanted to tell her about what we'd found in that clearing, but another part of me didn't want to burden her with something so disturbing, especially when she couldn't even remember being there. Maybe it was better if she didn't know. \"I'm glad we came,\" I said, though I wasn't entirely sure I meant it anymore. Katherine smiled and reached over to squeeze my hand. \"The kids will remember this forever.\" I hope that was true. I hoped they'd remember the good parts, the campfire stories, the s'mores, the adventure of sleeping in a tent. I hope they wouldn't remember the fear in their voices when they saw their mother unconscious in my arms. I was still processing everything that had happened when I noticed Katherine had gone very still beside me. She was sitting in her camp chair, but her body had that same rigid posture I'd seen yesterday when she kept staring into the woods. \"Katherine?\" I followed her gaze toward the treeline. She didn't respond. Her eyes were fixed on the same spot she'd been staring at the day before, that patch of forest about 30 feet behind our campsite. Her expression was completely blank, like she was seeing something I couldn't see. \"Katherine.\" I said her name louder, but she didn't even blink. This was exactly what had been happening yesterday. The same intense stare, the same complete disconnection from everything around her. My stomach tightened as I remembered finding her in the woods at 3:00 in the morning, muttering those same disturbing words over and over. I stood up and moved toward her chair. \"Katherine, what are you looking at?\" Without any warning, she bolted upright and sprinted toward the forest. \"Katherine,\" I shouted, but she was already disappearing between the trees. I grabbed my flashlight from the picnic table and took off after her, my heart pounding. Behind me, I could hear Orion and Carrie stirring in the tent, probably woken by my shouting. \"Stay by the fire,\" I called back to them as I plunged into the woods. \"Don't follow me.\" Katherine was moving fast, faster than I'd ever seen her run. My flashlight beam bounced wildly as I tried to keep up with her, catching glimpses of her pale pajamas flashing between the dark tree trunks. She was running barefoot over roots and rocks like she couldn't feel the pain, like something was pulling her forward. \"Katherine, stop,\" I yelled, but she didn't slow down. She was heading deeper into the forest than we'd gone before, past the trail we'd hiked earlier, past the clearing where we'd found those dead animals. I stumbled over a fallen branch and nearly lost my footing. The flashlight beam swinging wildly before I regained my balance. I could hear her crashing through the underbrush ahead of me, but I was losing ground. She knew exactly where she was going, moving with purpose and certainty while I struggled to navigate the dark forest. My lungs burned from the effort of keeping up, and panic was setting in as I realized how far we were getting from the campsite, from the kids. Finally, the sounds ahead of me stopped. I pushed through a thick cluster of pine trees and found myself in another clearing smaller than the one where we'd discovered the animal pile. My flashlight beam swept across the open space until it found her. Katherine stood in the center of the clearing, completely motionless. Her bare feet were planted in the dirt, her arms hanging loosely at her sides. Her eyes were wide open, staring straight ahead into the darkness beyond my flashlight's reach. And she was muttering under her breath the same words I'd heard last night, \"It will all be over soon.\" I moved toward Katherine without any of the hesitation from the night before. Whatever was happening to her, whatever had taken hold of her mind, I wasn't going to let it continue, not with my kids waiting back at camp. \"Katherine.\" I grabbed her shoulders firmer than I had before. She didn't respond to her name, didn't even blink when I shook her. The muttering continued, that same flat repetition about everything being over soon. Her body felt rigid under my hands, like she was fighting against something I couldn't see. This wasn't sleepwalking. This wasn't some kind of anxiety episode. Something was seriously wrong with my wife, and I needed to get her away from this place. I wrapped my arm around her waist and pulled her against my side, supporting most of her weight. She moved when I guided her, but there was no cooperation, no awareness that I was even there. Her bare feet scraped against roots and rocks as I half carried, half dragged her through the trees toward our campsite. The walk back felt endless. Every few steps, Katherine would try to stop. Her body pulling against my grip like she wanted to return to that clearing. I tightened my hold and kept moving. The flashlight beam bounced ahead of us, illuminating patches of forest floor and tree trunks, but I barely registered the path. All I could think about was getting Katherine back to the kids and then getting all of us out of here. When we finally emerged from the woods, Orion and Carrie were exactly where I'd left them, sitting close together by the dying fire.They looked up as we approached, and I saw the confusion and fear in their faces. \"Mom?\" Kerry's voice was small, uncertain. Katherine said nothing. She sat down heavily on one of the logs we'd arranged around the fire pit. Her hands folded in her lap, staring straight ahead at the cold ashes. The muttering had stopped, but she looked completely vacant, like nobody was home behind her eyes. I couldn't waste time trying to figure out what was wrong with her, not here, not in this place that seemed to be doing something to her mind. \"We're leaving,\" I announced, grabbing the nearest camping chair and folding it shut. \"Right now. Both of you, go get your things from the tent.\" \"But Dad,\" Orion started. \"Now.\" I didn't look at him as I stacked the chair against the picnic table. \"Get your clothes. Get your sleeping bags. Get everything. We're going home.\" The kids scrambled toward the tent without another word. I think the tone in my voice made it clear this wasn't up for discussion. I grabbed the camp stove and shoved it into its carrying case, my hands working automatically while my mind raced. Katherine hadn't moved from the log. She sat perfectly still, her hair hanging loose around her shoulders, dirt smudged on her bare feet. Whatever had happened to her in those clearings, whatever she'd seen or heard or felt, it was like it had carved something out of her and left this empty shell behind. I dumped water on the fire pit, sending up a hiss of steam and smoke. The camping chairs went into the back of the Honda, followed by the cooler and the camp stove. Orion and Kerry emerged from the tent carrying arm-loads of sleeping bags and clothes, their movements quick and nervous. \"Is Mom sick?\" Kerry whispered as she handed me her pink sleeping bag. \"She's going to be fine,\" I said, though I wasn't sure I believed it. \"We just need to get home.\" The tent came down faster than it had gone up. I yanked out stakes and collapsed poles, not caring about being careful or methodical. Everything got stuffed into the back of the SUV in a jumbled pile. The kids sat in the back seat, still in their pajamas, watching me with wide eyes. Katherine moved when I took her arm and guided her to the passenger seat. She buckled her seatbelt when I asked her to, but her movements were mechanical, like she was following commands without really understanding them. When I started the engine, she didn't react to the sound. I backed out of the campsite and drove toward the main road, gravel crunching under our tires. The headlights swept across empty campsites and dark trees, and I felt a profound relief as we left Pine Ridge Campground behind. Whatever was in those woods, whatever had been affecting Katherine, we were getting away from it. The kids fell asleep before we reached the highway. Katherine stared out the passenger window, silent and still, her reflection ghostlike in the glass. I kept the radio off and drove in the quiet darkness, checking the rear-view mirror more often than I needed to. That's when I saw it. At the edge of the campground, just where the woods met the gravel road, a figure stood watching our departure. The headlights had moved past it, but in that brief moment of illumination, I'd seen enough. It looked exactly like Katherine, same height, same build, same long, dark hair, same blue sweater and jeans she'd been wearing earlier that day. The figure stood in the same rigid posture I'd found her in both nights, arms at its sides, perfectly motionless. My hands tightened on the steering wheel. I forced myself to look at the road ahead, forced myself not to glance at the real Katherine sitting beside me, still staring out her window. My heart hammered against my ribs, but I kept driving. Whatever I'd seen, whatever trick of light or shadow or exhausted imagination it had been, I wasn't going to think about it. I wasn't going to mention it to anyone. We drove through the night and reached home just as the sun was coming up. Katherine seemed to come back to herself gradually during the drive, blinking and looking around like she was waking up from a long sleep. By the time we pulled into our driveway, she was asking normal questions about getting the kids breakfast and whether we should unpack right away. I told her we'd deal with everything later. The kids went straight to their rooms and collapsed into their own beds. Katherine took a shower and then slept for 14 hours straight. When she woke up, she claimed she felt fine, though she couldn't remember much about our last night at the campground. I didn't push her for details. I was just grateful to have my wife back, to have all of us home and safe. I packed away the camping gear and tried to put the whole experience behind us. Three days later, my phone rang while I was at work. The caller ID showed a number I didn't recognize. \"Louis Acosta?\" The voice was professional, official. \"Yes.\" \"This is Detective Aiden Perry with the County Sheriff's Office. I need you to come down to the station, sir. We found a woman's body in the woods near Pine Ridge Campground, and we'd like you to take a look, see if you can help us with identification.\" My hands wouldn't stop shaking as I hung up the phone. The detective's words kept echoing in my head, \"Body in the woods, need you to identify, Pine Ridge Campground.\" I stared at my desk for what felt like hours, but was probably only minutes, trying to make sense of what he'd said.The drive to the police station felt like moving through thick fog. Every turn, every red light, every mundane detail of the route I'd driven hundreds of times before seemed wrong somehow, too bright, too normal. How could the world just keep functioning when Detective Perry had just asked me to identify a body? My mind kept trying to rationalize it. Maybe it was someone else. Maybe it was a mistake. Maybe they'd found some other woman who'd gotten lost in those woods. But I knew. Deep down, I already knew. The county sheriff's office sat on the edge of town in a brown brick building that looked more like a DMV than anything you'd see on television. Detective Perry met me in the lobby. A stocky guy with wire-rimmed glasses and graying temples, who looked like he'd done this too many times before. He shook my hand with the kind of firm grip that was probably meant to be reassuring. \"Mr. Acosta, thank you for coming in. I know this is difficult.\" I nodded because speaking seemed impossible. My throat felt like I'd swallowed sand. He led me down a hallway lined with fluorescent lights and beige walls covered in departmental notices I couldn't focus on. The smell of burnt coffee and industrial cleaning supplies made my stomach turn. We stopped at a door marked with a number I immediately forgot. \"Before we go in,\" Perry said, \"I want you to know that we're going to show you a photograph. The remains were discovered by hikers yesterday morning, approximately two miles from the campground. Based on the condition of the body, we estimate she'd been deceased for several days.\" Several days. The words hit me like a physical blow. We'd been at Pine Ridge three days ago. We'd left early that morning because Katherine had been acting strange, because something had felt wrong, because I'd seen that figure standing at the edge of the woods that looked exactly like... \"Mr. Acosta?\" I realized Perry was waiting for some kind of response. \"Yeah.\" \"Okay. I'm ready.\" But I wasn't ready. How could anyone be ready for this? The room was exactly what you'd expect. White walls, metal table, uncomfortable chairs that squeaked when you moved. Perry gestured for me to sit, then opened a manila folder. His movements were practiced, efficient. He'd done this before. \"I need you to look at this photograph and tell me if you recognize this person.\" He slid a color photograph across the table. My eyes found it before my brain could catch up, and refused to process what I was seeing. Katherine's face stared back at me from the image, but it wasn't Katherine, not really. Her skin had taken on a grayish pallor that made her look like a wax figure left in the sun too long. Her eyes were closed, thank God, but her mouth hung slightly open. Her hair, that beautiful black hair I'd run my fingers through thousands of times, was matted and dirty and filled with leaves and debris. The worst part was how peaceful she looked, like she was just sleeping badly. \"Sir, can you identify this person?\" I tried to speak, but no sound came out. My throat had completely seized up. All I could do was stare at the photograph and try to understand how this was possible. Katherine was at home. I'd seen her that morning making breakfast for the kids, humming while she buttered toast. She'd kissed me goodbye when I left for work, the same quick peck on the cheek she'd given me every morning for the past 12 years. \"Mr. Acosta?\" I managed a nod. Just a small movement of my head, but Perry saw it. \"Can you state for the record who this is?\" \"Katherine,\" the word came out as barely a whisper. \"Katherine Acosta, my wife.\" Perry made a note in his folder. \"I'm sorry for your loss, Mr. Acosta. I know this is incredibly difficult. We'll need you to sign some paperwork, and there will be more questions later, but for now...\" I stopped listening. My brain had shut down completely, refusing to process any more information. All I could think about was getting home, getting back to Katherine and the kids and proving to myself that this was all some horrible mistake. The drive home was a complete blur. I have no memory of leaving the police station, no memory of getting in my car, no memory of the route I took. One moment I was sitting in that sterile room staring at a photograph that couldn't possibly be real, and the next I was pulling into my driveway. The house looked exactly the same as when I'd left that morning. Same blue shutters, same flower boxes Katherine had planted last spring, same basketball hoop Orion had begged for last Christmas. Everything normal. Everything exactly as it should be. But as I sat in the car with the engine ticking as it cooled, one thought kept repeating in my head like a broken record. If Katherine was dead in those woods, decomposing for days, then who had been living in my house? Who had made breakfast this morning? Who had kissed me goodbye? Who had I been sharing a bed with for the past three nights? My legs felt like rubber as I walked to the front door. The key shook in my hand so badly it took three tries to get it in the lock. I stepped into the entryway and called out, \"Katherine, I'm home.\" No response. The house felt different somehow. Too quiet. Usually I could hear the television or the kids playing or Katherine moving around in the kitchen, but now there was nothing except the hum of the refrigerator and the tick of the grandfather clock in the living room.I found her sitting at the kitchen table. She was facing the window that looked out over our backyard, her hands folded in her lap, her posture perfectly straight. She didn't turn when I walked in, didn't acknowledge my presence at all. \"Katherine?\" Nothing. She just sat there motionless, staring out at the yard where Orion's bike lay on its side next to Carrie's chalk drawings on the patio. I stood, and I stood in the doorway, afraid to move closer. Something was wrong. Katherine never just sat like that, never ignored me when I came home. She was always moving, always busy with something. \"Honey, are you okay?\" Still nothing, not even a blink. Her breathing was so shallow I could barely see her chest rise and fall. The afternoon light coming through the window cast shadows across her face, but from where I stood, I couldn't see her expression. My mind kept flashing back to that photograph, the gray skin, the matted hair, the peaceful, horrible stillness of death. But this was Katherine, sitting right here in our kitchen. She was wearing the same yellow blouse she'd had on when I left for work. Her hair was pulled back in the same ponytail. This had to be some kind of mistake. Maybe the body they'd found was someone else entirely. Maybe Detective Perry had gotten it wrong. Bodies decompose, faces change. Maybe I'd been so shocked that I'd seen what I expected to see instead of what was actually there. That had to be it because Katherine was right here. I took a step into the kitchen, then another. The floorboard by the sink creaked the way it always did. Katherine usually turned when she heard that sound, usually smiled and asked about my day. She didn't move. \"Katherine, you're scaring me.\" I was close enough now to see her profile. Her skin looked pale, almost translucent in the afternoon light. Her eyes were open but completely unfocused, staring at something beyond the window that I couldn't see. \"Where are the kids?\" For the first time since I'd entered the kitchen, she responded. Her head turned toward me with a mechanical precision that made my stomach lurch. The movement was too smooth, too controlled, like a doll being positioned by invisible hands. When her eyes met mine, I felt the blood drain from my face. They were empty, completely vacant, not the warm brown eyes I'd fallen in love with 15 years ago, not the eyes that crinkled at the corners when she laughed at my terrible jokes. These were the eyes of something that had never been alive. Her mouth opened, and when she spoke, it was in Katherine's voice. The exact tone, the exact inflection she'd used that night by the campfire and in the woods when I'd found her standing between those trees. \"It will all be over soon.\" The words hit me like a physical blow. Every instinct I had was screaming at me to run, to get out of the house, to grab the kids and drive as far away as possible, but I couldn't move. I was frozen in place, staring into those dead eyes while my wife's voice repeated the same phrase that had haunted me for three days. Whatever was sitting at my kitchen table wearing Katherine's clothes and speaking with Katherine's voice, it wasn't my wife. Katherine was dead, rotting in the woods near Pine Ridge Campground, and I had no idea what this thing was. My feet felt like they were nailed to the kitchen floor. Every muscle in my body screamed at me to move, to run, to get out of there, but I couldn't make myself take a single step backward. The thing at my table kept staring at me with Katherine's face, those dead eyes boring into mine like it was studying me, like it was trying to figure out what I was thinking. How long had this been going on? How many days had I been living with this thing, eating dinner across from it, sleeping next to it? The real Katherine had been rotting in those woods for days while I'd been having conversations with whatever this was. My stomach twisted as I remembered coming home from work yesterday, how it had asked about my day in Katherine's voice, how it had helped Carrie with her homework, how it had kissed me goodnight. The entity tilted its head slightly, still watching me, still breathing in that shallow, mechanical way. \"It will all be over soon,\" it said again, and the sound of Katherine's voice coming from that empty shell made my skin crawl. I forced myself to take one step backward, then another. The floorboard near the doorway creaked under my weight, and the thing's eyes tracked the movement, but its head didn't turn. It just sat there, hands folded, like some horrible mannequin someone had posed at my kitchen table. Where were the kids? My mind raced through possibilities. Orion had been planning to ride his bike to his friend Jake's house after school. Carrie usually stayed after for art club on Thursdays. What time was it? I glanced at the clock on the microwave. 3:47. Carrie's art club ended at 4:00. Orion would probably be at Jake's until dinner. I had maybe an hour before they came home to this thing. Another step backward. My shoulder bumped against the doorframe, and I used it to steady myself. The entity hadn't moved except for that slight head tilt, but something about its posture had changed.\n... it looked more alert now, like it was listening for something. What if it knew where the kids were? What if it had already done something to them? The thought hit me like a punch to the chest. I'd been at work all day. This thing had been here alone in my house with access to everything. It could have called the school. It could have picked them up early. It knew their schedules, their friends, their routines because Catherine knew all those things. I pulled my phone from my pocket with shaking hands and scrolled to Jake's mom's number. The entity's vacant eyes followed the movement, but it didn't speak. I hit call and pressed the phone to my ear, keeping my eyes on the thing at my table. \"Hello?\" Jake's mom answered on the third ring. \"Hi, this is Louis Acosta. Is Orion there with Jake?\" \"Oh, hi, Louis. Yes, they're in the backyard building some kind of fort. Do you need to talk to him?\" Relief flooded through me so fast I almost dropped the phone. \"No, that's okay. I just wanted to make sure he made it there safely. Could you maybe keep him for dinner? Something's come up at home.\" \"Of course, no problem. Jake loves having him over.\" \"Thank you. I'll pick him up later tonight.\" I hung up and immediately called the school. The secretary confirmed that Carrie was in art club and would be there until 4:00. I told her I'd be there to pick her up early and hung up before she could ask questions. One kid accounted for, one kid to collect, then we'd figure out what came next. The thing at my table hadn't moved during either phone call, but when I looked at it now, its mouth was slightly open, not speaking. Just open, like it was tasting the air. The sight made my skin crawl. I backed out of the kitchen slowly, keeping my eyes on it until I reached the hallway. Then I turned and walked as quietly as I could toward the front door. My keys were hanging on the hook by the garage entrance. I grabbed them without making a sound and slipped out the front door. The afternoon air felt like a slap after the suffocating atmosphere inside the house. I practically ran to my car, fumbling with the keys until I got the door unlocked. I started the engine and backed out of the driveway fast enough to leave rubber on the concrete. In my rear view mirror, I could see the kitchen window. The thing that looked like Catherine was no longer at the table. It was standing at the window now, perfectly still, watching me drive away. The elementary school was only a 10-minute drive, but it felt like an hour. I kept checking my mirrors, half-expecting to see Catherine's Honda following me, but the road behind me stayed empty. When I pulled into the school parking lot, my hands were still shaking. The hallways smelled like floor wax and children's lunches. I followed the signs to the art room, my footsteps echoing off the tile floors. Through the open doorway, I could see Carrie at a table covered in construction paper and glue sticks. Her tongue poking out in concentration as she worked on some kind of collage. \"Mr. Acosta?\" The art teacher, Mrs. Henderson, looked up from helping another student. \"You're early. Carrie's got another 15 minutes.\" \"I need to take her now. Family emergency.\" Carrie looked up at the sound of my voice, her face lighting up with a smile that made my chest ache. She looked so normal, so innocent. She had no idea what had been sitting at our kitchen table wearing her mother's face. \"Daddy, look what I made.\" She held up her artwork, a colorful mess of paper flowers and glitter. \"That's beautiful, sweetheart. We need to go now, though. Grab your backpack.\" Something in my voice must have worried her because her smile faded slightly. \"Is everything okay?\" \"Everything's fine. We're just going to pick up Orion and go somewhere fun for dinner.\" She gathered her things quickly, stuffing the artwork into her backpack along with her folders and pencil case. I signed her out at the office and led her to the car, trying to keep my pace normal even though every instinct told me to run. \"Where are we going for dinner?\" she asked as I buckled her into her booster seat. \"It's a surprise.\" I got behind the wheel and started the engine. \"We're going to pick up your brother first.\" The drive to Jake's house gave me time to think. I couldn't take the kids home, not with that thing there, but I couldn't exactly tell them their mother was dead and something else was wearing her skin. They were eight and 10 years old. How do you explain something like that? Jake lived in a subdivision about 15 minutes away. Normal houses with normal families doing normal things. I pulled into the driveway behind a blue minivan and tried to compose myself before getting out. Carrie skipped beside me up the front walkway. I rang the doorbell and waited, listening to the sound of children's voices coming from the backyard. Jake's mom, Linda, opened the door with a dish towel in her hands. \"Louis, that was fast. I thought you said later tonight.\" \"Plans changed. I hope that's okay.\" \"Of course.\" She called toward the back of the house. \"Jake, Orion, your dad's here.\" The boys appeared a few minutes later, grass stains on their knees and dirt smudged on their faces. Orion was grinning, clearly having had a great time. \"Dad, Jake's dad is going to help us build a real tree house this weekend. Can I come back?\" \"We'll see, buddy. Right now we need to go.\" \"But we're not done with the fort.\" \"You can finish it another time. Come on.\" Something in my tone must have gotten through to him because he stopped arguing and hugged Jake goodbye. I thanked Linda and herded both kids back to the car.\"Why do we have to leave so fast?\" Orion asked as I pulled out of the driveway. \"And where's mom? Isn't she supposed to pick me up?\" My throat felt tight. \"Mom's busy with something. We're going to go get some dinner, just the three of us.\" \"Can we go to Chuck E. Cheese?\" Carrie asked from the back seat. \"Sure, sweetheart. Whatever you want.\" I drove toward the highway, putting distance between us and our house. In the rear view mirror, I could see both kids looking confused, but not worried yet. They trusted me to take care of them, to keep them safe. The weight of that responsibility felt crushing. We stopped at a gas station, so I could fill the tank and grab some snacks. While the kids picked out chips and candy, I stood at the counter trying to figure out what came next. I couldn't go to the police. What would I tell them? That my dead wife's doppelganger was sitting in my kitchen? They'd think I'd lost my mind. Maybe I had lost my mind. Maybe the stress of Katherine's death had finally broken something in my brain, and I was seeing things that weren't there, but the photograph Detective Perry had shown me was real. Katherine's gray face, her matted hair, her open mouth, that was real. And the thing in my kitchen speaking with Katherine's voice, that felt real too. I paid for the gas and snacks, and got back in the car. The kids were arguing about which movie to watch on Carrie's tablet. Their voices are comforting background noise as I pulled back onto the highway. Chuck E. Cheese was loud and bright, and full of screaming children. Perfect cover for figuring out my next move. I bought a pile of tokens and let Orion and Carrie loose on the arcade games while I sat at a sticky table and tried to think. I couldn't go home, that much was clear. But I couldn't run forever either. The kids had school, friends, lives. I had a job, a mortgage, responsibilities. Everything that made up our normal existence was tied to that house, that town, that life. But normal was over. Normal had died in the woods near Pine Ridge Campground. My phone buzzed with a text message. I pulled it out expecting work email or some automated notification. Instead, I saw Katherine's name on the screen. \"Where are you?\" The message read. \"The children need to come home.\" My hands started shaking again. I stared at the phone, watching the dots appear that meant someone was typing another message. \"It will all be over soon.\" I turned the phone off and shoved it in my pocket. Across the restaurant, Carrie was laughing as she tried to catch plastic balls in some kind of game. Orion was focused intently on a racing simulator, his tongue sticking out the same way Carrie's had during art class. They looked so normal, so innocent. They had no idea their world had just ended. I made a decision. We'd stay here until closing time, then find a motel for the night. Tomorrow I'd figure out something more permanent. Maybe we'd drive to my brother's place in Oregon. Maybe we'd disappear entirely, start over somewhere new with new names and new lives. The important thing was keeping them safe, keeping them away from whatever was wearing Katherine's face. The arcade games chimed and beeped around us. Children ran past our table clutching prizes and pizza slices. Everything looked normal, but I kept checking the entrance watching for a familiar figure in a yellow blouse. It never came. When Chuck E. Cheese finally closed at 10:00, I loaded two exhausted kids into the car and drove to a motel on the outskirts of town, the kinda place that took cash and didn't ask too many questions. I got us a room with two beds and let the kids fall asleep watching cartoons while I sat in a chair by the window watching the parking lot. Every set of headlights made my heart race. Every car door slamming made me jump, but the night passed quietly. And when morning came, we were still safe. I knew we could never go home again. I knew our old life was over, that we'd spend the rest of our lives looking over our shoulders, waiting for that thing to find us. But we were alive. We'd survived the camping trip, survived learning the truth about what happened to Katherine, survived the encounter with whatever had taken her place. That had to be enough. For now, it had to be enough. I gathered my sleeping children and carried them to the car as the sun came up over the motel parking lot. In the distance, I could see the mountains where Pine Ridge Campground sat hidden among the trees, where Katherine's body was slowly returning to the earth. I started the engine and drove away from everything we'd ever known, carrying the truth with me like a weight in my chest, the truth about what was really out there in the woods. The truth about what had come home with us. The truth that would haunt me forever."
}