{
  "title": "I Found an Abandoned Fallout Shelter. Something TERRIFYING Was Down There.",
  "upload_date": "",
  "duration_sec": 6122.0,
  "segments": [],
  "full_text": "I'd been thinking about River's comment for three days straight. He'd mentioned it so casually, just tossed it out there while cramming for his thermodynamics exam, something about seeing this weird rusted grate behind the engineering building during one of his late night study sessions. Most people would've forgotten about it by morning, but I wasn't most people. The idea of something hidden beneath campus had been gnawing at me ever since. That's how I ended up spending my entire weekend buried in the university archives, scrolling through decades of construction records and campus development plans. Most of it was mind-numbing bureaucratic paperwork, but I'd learned to dig through the boring stuff to find the interesting bits. That's when I found the reference that made everything click into place, a brief mention in a 1961 budget report about emergency shelter construction, Cold War paranoia at its finest. The more I researched, the clearer the picture became. Riverside University had built their own little piece of the nuclear age, a fallout shelter tucked away beneath the campus where administrators and essential personnel could ride out the atomic apocalypse. The paperwork was sparse, probably classified back in the day, but I managed to piece together enough details to know I was onto something real. Finding the actual entrance took another day of careful reconnaissance. River's description had been vague. He'd just noticed something metallic gleaming near the foundation while walking back from the library. I spent hours circling the engineering building, trying to look casual while scanning every corner and shadow. Finally, spotted it tucked behind a cluster of overgrown bushes on the building's north side. The grate was exactly what River had described, rusted iron bars set into what looked like a concrete frame, partially hidden by years of accumulated debris and plant growth. Getting it open proved more challenging than I'd expected. The metal had corroded badly over the decades, and the hinges fought me every inch of the way. I'd brought a small crowbar, the kind that fits easily in a backpack, and worked at the edges methodically. Each creak and groan of stressed metal made me glance around nervously, but the area stayed empty. Students didn't usually hang around behind buildings at 2:00 in the afternoon, especially not in the dead zones between major walkways. When the grate finally gave way, it revealed exactly what I'd hoped to find, concrete stairs descending into absolute darkness. The opening was narrow, maybe three feet wide, but clearly designed for human passage. Cold air drifted up from below, carrying that distinctive underground smell of damp concrete and stagnant air. I pulled out my flashlight and checked the beam twice before committing to the descent. The stairs were solid, built to last, 12 steps down, each one carefully poured and finished despite being hidden away from any public view. Someone had taken real care with this construction, which told me the shelter below was probably the genuine article. My footsteps echoed strangely in the confined space, and I found myself moving more quietly without really thinking about it. The main shelter room opened up beyond the stairwell like stepping into a museum exhibit. My flashlight beam swept across a space that had been frozen in time for over 60 years. Everything was exactly as it should be, exactly as I'd imagined it would be based on my research. Long, metal tables arranged in neat rows, their surfaces still bearing the geometric patterns typical of early '60s institutional furniture. Folding chairs stacked against one wall, their chrome legs dulled but intact. Filing cabinets lined the far wall, their olive drab paint job screaming government issue. But it was the posters that really sold the authenticity of the place. Civil defense propaganda covered nearly every available wall surface, their bright colors faded but still legible in my flashlight beam. Duck and cover instructions illustrated with cartoon families. Radiation safety guidelines printed in that distinctive '50s graphic design style. Emergency supply checklists that read like paranoid fever dreams. Water purification tablets, radiation detection cards, instructions for decontamination procedures. I spent at least 20 minutes just documenting everything with my camera, each poster, every piece of furniture, all the emergency equipment still sitting exactly where someone had placed it decades ago. The shelter had clearly been sealed well. No water damage, minimal dust accumulation, just the slow decay of time working on materials that had been built to endure. Whoever designed this place had done their job right. The emergency supplies fascinated me most. Metal containers lined shelves along the eastern wall, their labels still readable despite the years. Water storage barrels sat in one corner, bone-dry now, but showing no signs of rust or deterioration. Medical supplies and sealed boxes, their contents probably long expired but the packaging intact. Even found a Geiger counter in its original case, the device looking like something out of a science fiction movie with its analog dials and heavy construction. Everything about the room spoke to the genuine terror people had felt during the height of the Cold War. This wasn't just bureaucratic box-checking or political theater. Someone had spent serious money and effort creating a space where human beings could actually survive nuclear fallout. The attention to detail was remarkable.... ventilation shafts built into the ceiling, communication equipment mounted on dedicated tables, even a small kitchen area with what looked like a military-grade hotplate. I was photographing the communication setup when my flashlight beam caught something that didn't fit the 1960s aesthetic. A dark opening in the far wall, maybe four feet high and just wide enough for a person to squeeze through. At first glance, it looked like it might be another ventilation shaft or utility access, but the construction was all wrong. Where everything else in the shelter showed the clean lines and smooth finishes of professional construction, this opening had rough edges and uneven stonework. The difference was immediately obvious once I focused on it. The shelter itself was all poured concrete and precision engineering. Every surface carefully finished and painted. This passage looked older, much older. The edges were cut stone rather than concrete, and the workmanship had that hand-built quality you see in much earlier construction. Someone had broken through the shelter's wall to connect it to something that had already been there. My curiosity kicked into high gear. The shelter was fascinating, but it was also exactly what I'd expected to find based on my research. This passage was something else entirely, something that wasn't in any of the university records I'd reviewed. That made it infinitely more interesting than another Cold War relic, no matter how well-preserved. I approached the opening carefully, playing my flashlight beam into the darkness beyond. The passage sloped downward at a steep angle, following what looked like natural stone stairs carved directly into bedrock. The air coming up from below felt different too, colder and somehow heavier, with an earthy smell that suggested real depth. This wasn't just a basement or utility tunnel. This was something that went down into the actual bones of the earth beneath the campus. Every rational part of my brain was telling me to document what I'd already found and get out. The shelter alone was an incredible discovery, the kind of thing that would make urban exploration forums buzz for months. I had enough photographs to prove the find and enough historical context to write it up properly. The smart thing would be to retreat, do more research, maybe come back with better equipment and a partner for safety. But rational thinking had never been my strong suit when it came to unexplored spaces. The passage was right there, clearly leading to something even older and more mysterious than the shelter. I'd come this far, spent days researching and planning, finally found something genuinely unknown. Walking away without at least seeing where it led would be like stopping a book halfway through the best chapter. I checked my equipment one more time. Flashlight was still strong. Backup batteries in my pocket. Chalk for marking my route. Phone for emergency contact if I could get signal. Everything I needed for a careful reconnaissance. I wasn't planning to go far, just enough to get a sense of what lay beyond the opening. The stone stairs were definitely hand-carved, probably dating back to the university's earliest days or even before. Each step showed tool marks where someone had shaped the rock by hand, and the wear patterns suggested they'd seen regular use at some point in the past. The passage itself was narrow enough that I could touch both walls with my arms extended, but the ceiling was high enough that I didn't need to duck. After maybe 20 steps, the character of the space changed completely. The walls went from worked stone to natural rock face, and the air grew noticeably colder. I was definitely moving deeper underground, following what seemed to be a natural fissure in the bedrock that someone had improved with those carved stairs. My flashlight beam couldn't penetrate far enough ahead to show me where the passage was leading. Just more stone walls disappearing into darkness. I started marking my path with chalk every few yards, small arrows pointing back toward the shelter. Getting lost underground was the kind of mistake that turned exploration into emergency rescue, and I had no intention of becoming that kind of statistic. The chalk marks also helped me track how far I'd gone, maybe 50 yards from the shelter when the passage branched for the first time. The branch was subtle, just a slight widening where another tunnel joined the main passage from the left. I played my light down both routes, trying to decide which way to go. The main passage continued straight ahead, following the same downward slope I'd been following. The branch seemed to level out and curve away into darkness. Both looked equally mysterious and equally dangerous. I chose to stick with the main passage, partly because it seemed like the primary route and partly because I didn't want to complicate my navigation on this first exploration. The chalk marks would get me back to the shelter, but only if I kept my route simple enough to follow in reverse. Adding side passages to the mix was a good way to get confused in the dark. The walls around me were definitely natural stone now, shaped by geological processes rather than human tools. The rock had layers and textures that spoke to millions of years of sedimentary formation. And in some places, I could see mineral veins running through the stone like frozen lightning. This was old rock, the kind of deep foundation that lay beneath most of the Midwest. Whatever I was exploring had been carved out of the Earth's actual bones. The air was getting colder with each step downward. Not just cool like a basement, but genuinely cold in a way that made me grateful for my jacket.The temperature difference suggested I was getting deeper underground, moving into spaces that never felt the warmth of surface weather. My breath wasn't quite visible yet, but it was heading in that direction. The passage curved slightly to the right, following what must've been a natural weakness in the rock. My flashlight beam swept across walls that showed no signs of recent human activity. No graffiti, no trash, no evidence that anyone else had been down here in years or possibly decades. Whatever this tunnel system was, it had been forgotten by the modern world. That's when I realized just how far I'd come from anything resembling safety. The shelter above me was already an unknown space, hidden from campus security and completely off any official map. This passage took me even further from civilization, deeper into something that might not have been explored since the shelter was built. If something went wrong down here, if I got injured or lost, nobody would know where to look for me. The smart thing would've been to turn around right then, mark the passage for future exploration with proper equipment and backup, but the tunnel kept leading downward into darkness. And my curiosity was stronger than my caution. I wanted to know where this led, what lay hidden beneath the familiar world of campus life above. The mystery was too compelling to abandon after coming this far. The passage ahead split into three different routes, each one disappearing into its own pocket of darkness. I stopped at the junction, playing my flashlight beam across each opening to get a sense of what I was dealing with. The leftmost tunnel angled sharply downward. Its floor worn smooth by what looked like centuries of water flow. The middle passage stayed level but narrowed considerably, forcing anyone who entered to walk single file. The right tunnel curved away from my light, hiding its destination completely. I chose the middle route, mostly because it seemed the most manageable. The walls pressed closer as I moved forward, close enough that I could touch both sides if I stretched my arms out. The stone here was different from what I'd seen in the main passage. Darker, with veins of some mineral that caught my flashlight and threw back tiny sparkles. Whoever had carved these tunnels had done it by hand, probably over years. The tool marks were everywhere, overlapping scratches and gouges that told the story of incredible patience and determination. Every few yards, I stopped to mark the wall with chalk. The arrows were my lifeline back to the surface, and I made sure each one was clear and visible. The last thing I wanted was to get turned around down here. The thought of wandering these tunnels until my flashlight died wasn't something I cared to dwell on, but it stayed in the back of my mind anyway. A constant reminder of how far I'd already come from anything resembling safety. The tunnel branched again, then again. Each split forced me to make another choice, and each choice took me further into a maze that was becoming more complex by the minute. Some passages were so narrow I had to turn sideways to squeeze through. Others opened into small chambers before continuing on. A few dead-ended completely, forcing me to backtrack and try a different route. The whole system felt organic, like it had grown rather than been planned, following the natural weaknesses in the rock. I found alcoves carved into the walls at irregular intervals. Most were empty, just dark recesses that vanished beyond the reach of my light. A few contained what looked like the remains of old storage, rotted wood that might've been shelving. Rusted metal brackets still anchored to the stone. One alcove held what looked like the remnants of a wooden crate, its boards warped and split with age. I didn't investigate too closely. Something about those dark spaces made me want to keep moving. The air was getting colder as I went deeper. My breath started forming small clouds in the beam of my flashlight, and the moisture I'd noticed earlier was becoming more pronounced. Water seeped through cracks in the stone, leaving dark stains on the walls and creating small puddles on the uneven floor. The sound of dripping echoed from somewhere ahead, a steady rhythm that seemed to come from multiple sources. I'd been walking for maybe 20 minutes when I heard it, a voice, faint but unmistakably human. I stopped so suddenly I nearly dropped my flashlight. The sound came from somewhere ahead, carried by the tunnel's acoustics in a way that made it impossible to judge distance. But what I heard made my stomach drop. It was a child crying for help. The voice was thin, scared, echoing off the stone walls in a way that distorted it but couldn't hide the fear. \"Help me,\" it called, the words bouncing through the tunnels and reaching me as a series of overlapping whispers. \"Please, somebody help me.\" I stood frozen, trying to process what I was hearing, a child down here in these tunnels. How was that possible? The entrance I'd used was hidden behind the engineering building, covered by a rusted grate that had taken effort to open. The passages I'd followed were narrow, difficult, requiring equipment and determination to navigate. No child should be down here. No child could've made it this far alone. But the voice came again, clearer this time. \"Help me, please. I can't find my way out.\" Every rational part of my mind was screaming warnings. This wasn't right. The situation didn't make sense. But the voice was real, and it belonged to someone who was scared and lost and calling for help.I couldn't just ignore that. If there was even a chance that a child had somehow gotten lost down here, I had to do something. \"Hello?\" I called out, my voice echoing through the tunnels. \"Can you hear me? Where are you?\" The crying stopped immediately. The silence that followed was complete, broken only by the distant sound of dripping water. I waited, listening, hoping for a response that would help me locate the source of the voice. Nothing. Then after what felt like minutes but was probably only seconds, the crying started again. Same voice, same desperate plea for help, but now it seemed to be coming from a different direction. The acoustics down here were playing tricks on me, bouncing sound around in ways that made it impossible to pinpoint where it was coming from. I started moving toward where I thought the voice was strongest, marking my path with chalk as I went. The tunnel curved to the right then split again. I chose the left branch, following what sounded like the clearest path to the source of the crying. But as I moved, the voice seemed to move too, always staying just ahead of me, just out of reach. \"I'm coming,\" I called out. \"Keep talking so I can find you.\" The response wasn't words, just more crying, more pleas for help that echoed through the stone passages and seemed to come from everywhere and nowhere at once. I picked up my pace, moving as quickly as I dared through the narrow tunnels. The beam of my flashlight swept back and forth, searching for any sign of movement, any indication of where the child might be. The tunnels were getting more complex. What had started as a simple branching system was becoming a true maze, with passages that doubled back on themselves, chambers that opened onto multiple routes, dead ends that forced me to retrace my steps. I was marking everything with chalk, but the sheer number of turns and choices was becoming overwhelming. My mental map of the area was fragmenting, becoming less reliable with each new branch. The voice continued to call out, and I continued to follow it. But something was bothering me about the whole situation, something I couldn't quite put my finger on. The voice never got closer, no matter how far I traveled toward it. It never changed in character or tone despite the fact that I'd been responding, letting the child know that help was coming. And it always seemed to be just around the next corner, just through the next passage, leading me deeper into the maze. I stopped at another junction, this one offering four different routes. The crying was coming from the second tunnel on the right, or at least that's where it sounded strongest. But as I stood there listening carefully, I realized something that made my blood run cold. The voice wasn't getting tired. It had been calling for help for at least 10 minutes now with the same intensity, the same desperation, the same exact phrasing. A real child, scared and lost, would be getting hoarse by now, would be varying the words, trying different approaches, maybe responding more directly to my calls. This voice was like a recording, playing the same message over and over again. But that was impossible. There was no technology down here, no speakers or recording devices, just stone tunnels carved by hand decades or centuries ago. And the voice was definitely coming from ahead of me, moving as I moved, leading me deeper into the underground maze. I stood at the junction, flashlight beam playing across the four tunnel mouths, trying to decide what to do. Every instinct I had was telling me to turn around, to follow my chalk marks back to the surface, to get out of these tunnels as quickly as possible. But the voice was still calling, still pleading for help, and I couldn't shake the possibility that I was wrong about everything, that there really was a child down here who needed help and I was overthinking the situation because of the strange acoustics and my own growing fear. The crying came again, definitely from the right-hand tunnel. I made my decision and started forward, marking the wall with a clear arrow and the number four to indicate which route I'd chosen from this junction. The tunnel sloped downward and the walls pressed closer together. I had to duck my head to avoid scraping it on the low ceiling, and my shoulders brushed the stone on both sides. The voice was getting clearer, or at least it seemed that way, but it was also leading me further from any chance of easy retreat. I'd been walking for nearly 30 minutes now, following a route that twisted and turned through solid rock. Even if I turned around right now and moved as quickly as possible, it would take me at least that long to get back to the surface, and that was assuming I could follow my chalk marks correctly, assuming I didn't take a wrong turn or miss a crucial arrow in the maze of passages. The tunnel opened into a small chamber, maybe eight feet across and twice as long. Three more passages led out of it, each one disappearing into darkness. The crying was coming from the middle passage, but it sounded exactly the same as it had 20 minutes ago. Same words, same tone, same desperate plea that never varied or changed. I stood in the chamber, playing my flashlight beam across the walls and trying to think rationally about what was happening. The smart thing to do was obvious, turn around, follow my marks back to the surface and report what I'd found to someone with more experience and better equipment. Let professionals handle whatever this was.But the voice continued to call for help, and despite all my doubts and fears, I couldn't bring myself to abandon the possibility that someone really needed my help. I checked my equipment, flashlight still strong, backup batteries in my pocket, chalk supply holding up. Phone showed no signal, which wasn't surprising given how deep underground I was. I had enough supplies to continue for a while longer as long as I was careful and didn't do anything stupid. The voice called out again, and I made my choice. I marked the chamber wall with a clear indication of which passage I was taking, then stepped into the middle tunnel and continued deeper into the maze. The middle tunnel stretched ahead of me, and I pushed forward, following that persistent crying that seemed to drift through the stone like it belonged here. My chalk marks dotted the walls behind me in a trail of white arrows, each one a small promise that I could find my way back if things went wrong. The voice pulled me deeper, and I let it. Something was changing in the tunnels around me. The walls felt different now, closer somehow, even though my flashlight showed the same rough stone surfaces I'd been walking past for the last however long. Time had become elastic down here, stretching and compressing until I couldn't tell if I'd been following the voice for 20 minutes or two hours. My watch said it had been about an hour since I'd entered the middle passage at that four-way junction, but that couldn't be right. It felt like I'd walked miles. The stone pressed in on both sides of me now, close enough that I had to turn sideways in some sections. The walls seemed to pulse in my peripheral vision, expanding and contracting like they were breathing. When I turned my flashlight directly on them, they looked normal, just carved rock with tool marks and mineral veins. But the moment I looked away, that sense of movement returned. My rational mind kept insisting it was just shadows playing tricks, the way darkness always made familiar shapes look wrong. But down here, surrounded by tons of earth and rock, rational thinking felt like a luxury I couldn't afford. The child's voice echoed from somewhere ahead, bouncing off the tunnel walls in ways that made it impossible to pinpoint. \"Help me, please. I can't find my way out.\" The same words over and over with that same desperate tone that cut straight through my chest. I'd been calling back periodically, telling the kid to keep talking, that I was coming, but the voice never responded to me directly, just kept repeating those same phrases like a mantra. Turn after turn, the tunnels branched and twisted. I marked each choice with chalk, following the voice down passages that curved back on themselves, through chambers that opened up just long enough for me to catch my breath before narrowing again. Some sections required me to duck my head. Others forced me to squeeze through gaps barely wide enough for my shoulders. The temperature had dropped enough that my breath came out in visible puffs, and the dampness in the air made everything feel clammy against my skin. My heart was pounding harder now, not just from the physical exertion, but from something else, a creeping anxiety that seemed to seep out of the walls themselves. Every shadow looked wrong. Every echo sounded like footsteps following behind me. I kept glancing over my shoulder, sweeping my flashlight back the way I'd come, but the beam only showed empty tunnel stretching back into darkness. The chalk marks were still there, white and reassuring, but they looked smaller somehow, like the darkness was already starting to swallow them. The voice came again, definitely from up ahead now, though it seemed to be coming from multiple directions at once. The acoustics down here were completely unpredictable. Sound bounced off stone surfaces and traveled through connecting passages in ways that made no sense. A whisper could seem to come from right beside your ear while a shout might sound muffled and distant. I'd lost track of how many times I thought I was getting closer to the source only to find another empty passage. I stopped at what looked like a T-junction, playing my flashlight down both options. The left passage angled downward sharply, disappearing into blackness that seemed to swallow my light. The right curved away, following what might have been a natural fissure in the rock. The voice seemed to be coming from both directions now, or maybe from neither. The echo made it impossible to tell. That's when I realized the shadows at the edge of my vision weren't staying still anymore. They moved when I wasn't looking directly at them, shifting and flowing like they had substance. I'd catch glimpses of movement in my peripheral vision, but when I turned my head, there was nothing there except empty tunnel, just stone and darkness and the steady drip of water from somewhere I couldn't see. My hands were shaking now, making the flashlight beam dance across the walls. The rational part of my brain kept trying to explain what I was experiencing, fatigue, stress, oxygen levels, the psychological effects of prolonged isolation and confined spaces. But that rational voice was getting quieter, overwhelmed by the growing certainty that something was fundamentally wrong down here. The tunnels felt alive in a way that had nothing to do with geology or engineering. I chose the right passage, marking my decision with a particularly large chalk arrow.... and continued following the voice deeper into the maze. The walls pressed closer, and I had to turn sideways again to make progress. Stones scraped against my jacket, and I could feel the weight of the earth above me like a physical presence. How far down was I now? How far from that hidden shelter entrance? The questions circled in my mind without answers. The voice called out again, clearer now, and I pushed forward with renewed urgency. Maybe I was finally getting close. Maybe there really was a child down here, lost and terrified, and all my paranoid thoughts were just the product of too much time in the dark. I called back, my voice echoing strangely in the narrow space, and hurried toward the sound. The passage opened up into another small chamber, and I swept my flashlight around the space, looking for any sign of the voice's source. Empty. Just more tunnels leading off in different directions, more choices to make, more chances to get hopelessly lost. The voice seemed to be coming from everywhere and nowhere, bouncing off the walls until it sounded like a choir of lost children all crying for help at once. That's when I saw him. A man stepped out of a side passage I hadn't even noticed, moving with calm confidence that seemed completely out of place in this underground maze. He was maybe in his 40s, average height, wearing what looked like a business suit that had seen better days. The fabric was dusty and worn, but I could tell it had been expensive once. Narrow lapels, thin tie, the kind of tailoring you saw in old movies. His hair was graying brown, styled in a way that looked neat despite everything, and his eyes were a serious blue that seemed to take in everything at once. He looked at me with an expression that was part concern, part resignation, like he'd been expecting to find me here, but wasn't happy about it. The strangest thing was how normal he seemed, how completely unaffected by the oppressive atmosphere that had been building around me for the last hour. He stood there in his dusty suit like he belonged in these tunnels, like he'd been waiting for me. \"Stop following the voice,\" he said quietly, his words cutting through the echoing cries that still seemed to come from every direction. His voice had traces of local accent, but something older about it, like he'd learned to speak in a different time. \"There's no child down here.\" I stared at him, my flashlight beam playing across his pale face. He didn't squint or shield his eyes from the light, just looked back at me with that same calm seriousness. The rational questions started firing in my mind. Who was he? How had he gotten down here? Why wasn't he lost like I was? But something about his presence made those questions feel less urgent than they should have. \"They're trying to lure you deeper,\" he continued, glancing toward the passages where the voice still echoed, \"into the tunnels where you won't find your way back.\" The way he said it, matter of fact and certain, made my skin crawl. Not because I didn't believe him, but because I did. Some part of me had been recognizing the truth of what he was saying for the last 20 minutes, even as I kept following the voice deeper into the maze. The mechanical repetition, the way it never got closer, the complete lack of human variation in the cries. I'd noticed all of it, but I'd pushed those observations aside because the alternative was admitting I'd been chasing something that wasn't real. \"Who are you?\" I managed to ask, my voice sounding strange in the confined space. \"Tony Turner,\" he said, like that explained everything. \"And if you go much further, you won't find your way back to the surface,\" the voice cried out again from somewhere in the darkness, and Tony's expression tightened slightly. He gestured for me to follow him, already turning toward a passage I hadn't seen before, moving with the kind of confidence that only came from knowing exactly where you were going. In a place where I'd been lost for an hour, following false voices and marking my path with increasingly desperate chalk arrows, his certainty was both reassuring and deeply unsettling. I hesitated for a moment, playing my flashlight over his retreating figure. The business suit, the old-fashioned styling, the way he moved through these tunnels like he'd been walking them for years, none of it made sense. But the alternative was continuing to follow a voice that apparently wasn't real, deeper into a maze I was already struggling to navigate. The crying echoed from multiple directions now, a chorus of identical pleas that made the hair on my arms stand up. Tony was already disappearing into the passage, moving with surprising speed through the darkness. I could follow him, or I could keep chasing phantom voices until my flashlight died and my chalk ran out. I made my choice and hurried after him, leaving the crying voices behind in the darkness. I stayed close behind Tony as he moved through the passage, his confident steps a stark contrast to my earlier fumbling through these tunnels. The crying voices we'd left behind in the chamber grew fainter with each step, but they didn't disappear entirely. They seemed to follow us, echoing through the stone corridors in ways that made no sense acoustically. \"Don't listen to them,\" Tony said without turning around. His voice carried clearly in the confined space, calm and authoritative.\"Don't look back. And don't respond to anything you hear.\" I wanted to ask him what exactly we were dealing with, but something in his tone suggested this wasn't the time for questions. The way he moved through these tunnels showed an intimacy with the underground maze that went far beyond casual exploration. Every turn he took was deliberate, every choice of passage made without hesitation. He navigated like someone who had walked these routes countless times, who knew exactly where each tunnel led and which ones to avoid. The children's voices began to change as we walked deeper into the passages. What had started as simple crying and please for help evolved into something more complex. Laughter echoed from tunnels we passed by. The kind of innocent giggling that should have been comforting but instead, raised every alarm in my head. The sound bounced off the stone walls, creating an effect where it seemed to come from everywhere at once. Tony kept moving at a steady pace, never slowing, never acknowledging the sounds that grew louder around us. I tried to match his focus, keeping my eyes on his back and my feet moving forward, but the voices were becoming harder to ignore. They weren't just random children anymore. The sounds were getting more specific, more targeted. Whispers trailed just behind us, so close I could almost feel breath on my neck, words I couldn't quite make out, spoken in hushed tones that suggested secrets being shared. I fought the urge to turn around, remembering Tony's warning about not looking back. The whispers seemed to know I was listening, growing more insistent when I slowed my pace or tilted my head slightly in their direction. The tunnel system Tony led us through was even more complex than what I had experienced on my own. We passed through chambers I hadn't seen before, down passages that branched in directions I hadn't explored. Some tunnels were so narrow we had to turn sideways to squeeze through. Others opened into spaces large enough that my flashlight beam couldn't reach the far walls. Tony navigated all of it with the same unwavering confidence, never pausing to consider which way to go. I tried to keep track of our route, but the turns came too quickly and the passages twisted in ways that defeated my attempts at mental mapping. We went down stone steps carved directly into the rock through natural fissures that barely accommodated our bodies, and along corridors that showed clear evidence of deliberate construction. The variety of architecture suggested these tunnels had been built and modified over decades, maybe longer. The voices around us continued to multiply. What had started as one child crying had become a chorus of different sounds. Children laughing, children calling out, children singing songs I almost recognized but couldn't quite place. The acoustic properties of the tunnels made it impossible to determine where any of the sounds actually originated. They seemed to come from ahead of us, behind us, above us, and from passages we weren't even taking. Tony maintained his steady pace through all of it, showing no reaction to the increasing cacophony. His indifference to the sounds was almost as unsettling as the voices themselves. Either he'd grown completely accustomed to whatever was happening down here, or he was operating under a different set of rules than I was. The voices began to shift again, becoming more insistent and demanding. The children's laughter took on an edge that made my skin crawl. The whispers grew louder, more urgent, though I still couldn't make out specific words. And then something changed that made me stumble slightly in my stride. \"Anthony?\" The voice was clear, distinct from the chorus of children's sounds. It came from a passage to our left, echoing with perfect clarity through the stone corridors. I knew that voice. \"Anthony, where are you?\" River. It was definitely River's voice, calling my name with the same tone he used when he couldn't find something in our apartment. The same inflection, the same slight concern mixed with mild annoyance. It sounded exactly like him. I slowed my pace involuntarily, my head turning toward the sound before I caught myself. Tony's warning echoed in my mind, but hearing River's voice was like a physical pull. He sounded close, maybe just around the corner in that side passage. He sounded real. \"Anthony, I've been looking everywhere for you. Where did you go?\" The voice came again, and this time, there was worry in it, real worry. The kind River would have if he'd come home to find me missing with no explanation. It was so perfectly him that every instinct I had screamed at me to respond, to call out and let him know where I was. But Tony kept walking, never slowing, never acknowledging the voice that was calling my name. His steady movement forward was the only thing that kept me moving too. I forced myself to look away from the side passage to keep following Tony's lead through the maze. \"Anthony, please, I need help. I'm lost down here.\" The desperation in River's voice was unmistakable. It was the same tone he'd used when he'd called me after getting turned around in an unfamiliar part of the city, genuinely scared and needing assistance. Every fiber of my being wanted to respond, to go to him, to help. But I remembered the mechanical repetition of the children's voices, the way they never varied or responded to my calls. This felt different, more sophisticated. But the timing was too convenient. More voices joined River's.... a woman calling my name from another passage, her voice carrying the warm familiarity of family. \"Anthony. Anthony, where are you? I need you to come help me.\" \"Rosie.\" My sister's voice clear and unmistakable coming from somewhere to our right. She sounded scared, genuinely frightened in a way that made my chest tighten. Rosie rarely admitted to being afraid of anything, so hearing that vulnerability in her voice was like a knife twisting in my gut. \"Please, Anthony, I don't know where I am. It's dark and I can't find my way out.\" The pleading in her voice was heartbreaking. It was exactly how she'd sounded when we were kids and she'd had nightmares, coming to my room for comfort and protection. The same slight tremor, the same need for her big brother to make things safe again. Tony continued forward without any acknowledgement of the voices calling my name. His determination never wavered. His pace never changed. He moved like someone who had heard all of this before, who knew exactly what these sounds were and why they shouldn't be trusted. The voices of River and Rosie grew more desperate as we continued through the tunnels. They called my name repeatedly, their pleas for help becoming more frantic and specific. River described being trapped in a collapsed section of tunnel. Rosie talked about being surrounded by darkness, about being scared and cold, and needing me to find her. Each word was perfectly crafted to pull at my emotions, to make me want to abandon Tony's guidance and go searching for the people I cared about. The voices knew exactly what to say, exactly how to sound genuine and desperate and real. But I kept remembering Tony's warnings, kept focusing on his steady movement through the tunnels. The journey felt much longer than my original descent into these depths. We'd been walking for what seemed like an hour, though time was difficult to judge in the underground darkness. The voices around us had become a constant presence, no longer just children, but a mix of familiar and unfamiliar sounds. Some I recognized as clearly as River and Rosie. Others were voices I almost knew, people who sounded like they should be familiar but weren't quite right. The malevolent quality of the sounds became more obvious as they grew more desperate. The children's laughter turned harsh and mocking. The whispers became aggressive, though still incomprehensible. And the voices of River and Rosie took on an edge of anger mixed with their pleas. \"Anthony, why won't you answer me? I know you can hear me. You're just going to leave me here? Your own sister?\" The guilt and manipulation in their words was becoming more obvious, less subtle than it had been initially. Real River would never sound that accusatory. Real Rosie wouldn't try to manipulate me with guilt, even in a genuinely frightening situation. The voices were losing their perfect mimicry, showing cracks in their facade. Tony led us through passages that began to look familiar. Not familiar in the sense that I remembered them clearly, but familiar in the way that suggested we were retracing paths I'd taken earlier. The stone walls showed the same weathering patterns, the same mineral veins I'd noticed during my initial exploration. Then I saw them, small white marks on the tunnel walls barely visible in my flashlight beam, chalk arrows pointing in the direction we were traveling. My chalk arrows, the ones I'd made to mark my route when I'd first ventured into these tunnels hours ago. The sight of my own navigation marks was like a lifeline thrown to a drowning person. We were on the right track, heading back toward the surface and safety. Tony had successfully guided us through the maze of passages, avoiding whatever traps or dead ends the voices had been trying to lead me into. The voices seemed to sense our progress toward escape. They became more frantic, more desperate in their attempts to distract us from our path. The children's sounds turned into screams and wails. River and Rosie's voices became increasingly angry and accusatory, demanding to know why I was abandoning them, why I wouldn't help them when they needed me most. But seeing those chalk marks had broken whatever spell the voices had been weaving. They were clearly not real, clearly something designed to trap explorers in these tunnels. Tony had known exactly what they were and how to avoid their influence. His confident navigation through the underground maze had brought us back to familiar territory, back to the route that would eventually lead to the surface. The tunnel walls opened up around us as we climbed, and I could feel something shifting in the air itself. That crushing weight that had been pressing down on me for what felt like hours was starting to ease, like surfacing from deep water. My breathing came easier with each step upward. And the oppressive darkness that had seemed so alive and hostile was becoming just ordinary darkness again. Tony moved ahead of me with that same confident stride, his footsteps echoing off the stone in a steady rhythm that I found reassuring. The sound was normal, predictable, nothing like the twisted acoustics we'd left behind where voices could come from everywhere and nowhere at once. I kept my flashlight trained on the steps ahead, watching the beam illuminate the hand-carved stone that had seemed so ominous on my way down but now looked like simple craftsmanship. Someone had spent considerable time cutting these steps probably decades ago, and they'd built them to last. The voices were still there behind us, but they were fading.The desperate cries and angry accusations were becoming distant echoes, then whispers, then nothing at all. The silence that replaced them wasn't the heavy threatening quiet from before. This was just the normal absence of sound you'd expect in an underground passage. My footsteps and Tony's, the occasional drip of water somewhere in the distance, the rustle of my jacket as I moved, ordinary sounds that belonged to the real world. I found myself thinking about what had just happened down there, trying to make sense of it. The voices had been so convincing, so perfectly crafted to get under my skin. River's voice especially, every inflection had been exactly right, the way he said my name when he was worried about something, that particular tone he used when he needed help with a problem. But it hadn't been him. Whatever those things were, they'd studied people somehow, learned to mimic not just voices, but the emotional patterns that would be most effective. The thought made my skin crawl. How long had they been down there waiting for someone to wander into their territory? How many other explorers had followed those voices deeper into the maze, never to find their way back out? I'd come so close to being one of them, drawn further and further from any hope of escape by the promise of helping someone who didn't exist. Tony had known exactly what they were though. He'd moved through those tunnels like he'd been walking them for years, completely immune to whatever psychological effects the voices were designed to create. When I'd been ready to chase after what I thought was a child in need, he'd appeared out of nowhere with a warning that probably saved my life. But who was he? How did he know so much about this place? The stone steps leveled out, and I recognized the passage ahead. We were back in the section I'd explored on my own, the part that connected to the shelter. The walls here showed the same mineral veins and weathering patterns I'd noted on my way down, and I could see my chalk marks on the stone, those white arrows that had been my lifeline back to the surface. The sight of them filled me with relief so intense it was almost physical. I'd been so afraid I'd never see them again. \"Almost there,\" Tony said without turning around, his voice carrying that same calm authority it had held throughout our escape. He seemed to know exactly where we were going even though I couldn't remember seeing him check any of my chalk marks for direction. We rounded the familiar curve and there it was, the opening I'd broken through from the shelter side. The rough stone edges where someone had connected this ancient tunnel system to the Cold War bunker were exactly as I'd left them. Light from my flashlight revealed the concrete construction beyond, modern and utilitarian compared to the hand-carved passages we'd been traveling through. Tony stepped through the opening first and I followed him into the main shelter room. The contrast was startling. After hours in narrow stone passages with walls that seemed to press in from all sides, the rectangular concrete space felt enormous. My equipment was exactly where I'd left it, camera on one of the metal tables, backpack leaning against a folding chair, the spare batteries I'd laid out before entering the tunnel system still in their neat row. Everything was normal, unchanged, as if the terrifying experience in the tunnels had been some kind of dream. The civil defense posters still covered the walls with their cheerful instructions for surviving nuclear war. The olive drab filing cabinets stood in their orderly line along the far wall. The emergency supplies remained stacked on their shelves, decades old but still waiting for a crisis that never came. I turned to thank Tony, the words already forming in my mouth. I owed him everything. Without his intervention, I'd probably still be wandering those tunnels, chasing phantom voices deeper and deeper into a maze with no exit. But when I looked around, the shelter was empty. \"Tony?\" I called out, my voice echoing off the concrete walls. \"Tony, where did you go?\" Nothing, no response, no sound of footsteps, no indication that anyone else was in the room with me. I swept my flashlight across every corner of the shelter, checking behind the stacked chairs, around the filing cabinets, even in the small kitchen area where someone might conceivably hide. But there was nowhere to hide really. The shelter was one rectangular room with clear sight lines to every corner. He was simply gone. I walked back to the tunnel opening and shined my light into the stone passage beyond. \"Tony, are you back there?\" My voice bounced off the stone walls and came back to me unchanged. No answer, no movement in the shadows beyond my flashlight beam. The tunnel was as empty as the shelter. This didn't make sense. Tony had been right beside me when we entered the shelter. I'd heard his footsteps on the concrete floor, seen him move through the opening ahead of me. He couldn't have left without me noticing. There was only one exit from the shelter, and that was the way we'd come in from the surface, unless he'd gone back into the tunnels. But why would he do that? And why wouldn't he have answered when I called? I spent several minutes searching, becoming increasingly agitated. I checked every possible hiding spot twice, called his name repeatedly, even examined the walls for some kind of hidden passage I might've missed during my initial exploration.But the shelter was exactly as I'd found it hours earlier, a simple concrete room with no secrets and no other occupants. The rational part of my mind was starting to whisper uncomfortable possibilities. Had Tony been real at all? The voices in the tunnels had been convincing illusions, perfectly crafted to manipulate me. What if Tony had been another kind of illusion, designed to guide me back to safety for some reason I didn't understand? But that didn't feel right. The voices had been obviously artificial once I'd recognized their pattern. But Tony had been completely human. He'd had weight and presence, cast shadows in my flashlight beam, left footprints in the dust on the tunnel floors. Hadn't he? I tried to remember specific details, but the more I focused on them, the less certain I became. Had I actually seen his footprints, or had I just assumed they were there? Had he cast shadows, or had I been too focused on following him to notice? The entire escape was a blur of adrenaline and relief, and I realized I hadn't been paying attention to those kinds of details. But he'd spoken to me. We'd had conversations. He'd warned me about the voices, told me his name when I asked. That had to be real. I was starting to feel panicked again, the same helpless confusion I'd experienced in the tunnels. Nothing about this situation made sense, and standing in the empty shelter, calling for someone who'd apparently vanished into thin air wasn't helping. I needed to get out of here, back to the surface where things followed normal rules and people didn't disappear without explanation. I gathered my equipment quickly, shoving batteries into my backpack and slinging my camera around my neck. My hands were shaking slightly as I packed, and I kept glancing over my shoulder at the tunnel opening, half expecting to see Tony emerge from the darkness with some perfectly reasonable explanation for where he'd been. But the opening remained empty, and the stone passage beyond was silent. The concrete stairs to the surface felt like a lifeline. I climbed them two at a time, eager to put distance between myself and the underground maze that had nearly trapped me. Each step upward was a step back toward the normal world, toward explanations that made sense and experiences that followed predictable patterns. The iron grate was exactly as I'd left it, propped open against the concrete frame. Cool night air flowed down through the opening, carrying the familiar scents of the campus. Cut grass, fallen leaves, the faint smell of pizza from the dining hall. Normal smells from a normal place where voices came from actual people, and mysterious rescuers didn't vanish without explanation. I climbed through the opening and emerged into the night, breathing deeply of the fresh air. The relief was overwhelming, so intense it made me dizzy for a moment. I was back on the surface, back in the real world. The familiar bulk of the engineering building rose up beside me, its windows dark, but reassuring in their solidity. Street lights cast pools of yellow illumination across the campus walkways. In the distance, I could see the warm glow of dormitory windows where students were studying or socializing, or doing any of the thousand normal things that college students did on a Tuesday night. It felt surreal after what I'd experienced underground. The ordinary campus surrounding seemed almost too normal, too peaceful. How could this quiet academic environment exist directly above that maze of tunnels with their phantom voices and mysterious inhabitants? The contrast was jarring like stepping from a nightmare into a pleasant dream. I replaced the iron grate carefully, making sure it settled back into its frame the same way I'd found it. The rust flakes and overgrown bushes would hide any evidence of my passage, and in a few days, even I might have trouble finding this entrance again. Part of me thought that might be for the best. The walk back to my dormitory took less than 10 minutes, but it felt like a journey between worlds. Every step carried me further from the underground experience and deeper into the familiar rhythms of campus life. I passed a few other students on the walkways. Late-night library refugees heading back to their rooms, a couple walking hand-in-hand toward the coffee shop that stayed open until midnight. Normal people doing normal things, completely unaware of what lay beneath their feet. My dormitory building was mostly quiet when I entered, though I could hear music playing softly from someone's room and the distant sound of laughter from the common area. The elevator carried me up to the third floor where my room waited at the end of a hallway, lined with the usual collection of door decorations and dry erase message boards. River was still awake when I opened the door, hunched over his desk with textbooks spread around him and his laptop glowing in the dim light from his desk lamp. He looked up when I entered, blinking behind his wire-rimmed glasses. \"Hey,\" he said, stretching and rubbing his eyes. \"How was your evening? You've been gone for hours.\" I stood in the doorway for a moment looking at him. Here was the person whose voice had called to me from those tunnels, whose perfectly mimicked concern had almost lured me deeper into the maze. But this was the real River, tired from studying, genuinely curious about where I'd been, completely innocent of any knowledge about underground passages or phantom voices.\"Just went for a walk,\" I said finally, closing the door behind me. \"Needed some air.\" He nodded and turned back to his books. \"I know the feeling. This thermodynamics problem set is killing me.\" I set my backpack down and began unpacking my equipment, keeping my movements casual and normal. River glanced over at the camera and spare batteries, but didn't comment. He was used to my photography hobby, even if he didn't know about the more adventurous aspects of it. As I put my gear away, I found myself studying his profile in the lamplight. The real River, sitting at his desk and struggling with engineering homework, not the desperate, frightened version that had called my name from the darkness begging for help that would've led me to my doom. The contrast was unsettling in a way I couldn't quite articulate. I didn't tell him about the tunnels, about the voices, about Tony Turner or the shelter or any of it. How could I? The story sounded impossible even to me, and I'd lived through it. River would think I'd had some kind of breakdown, and honestly, I wasn't entirely sure he'd be wrong. The whole experience had a dreamlike quality that made me question what had actually happened and what might have been hallucination or stress-induced fantasy. But the dust on my clothes was real. The photos on my camera were real. The chalk residue under my fingernails from marking the tunnel walls was real. Whatever had happened down there, it hadn't been entirely in my imagination. River yawned and started gathering his books. \"I think I'm done for tonight,\" he said. \"My brain's too fried to process any more of this.\" \"Good idea,\" I replied. Though I doubted I'd be able to sleep anytime soon. My mind was still racing, replaying the events in the tunnels and trying to make sense of Tony's disappearance. As River got ready for bed, I sat on my own bed and stared out the window at the campus below. Somewhere out there, beneath the peaceful walkways and well-lit buildings, that maze of tunnels was still waiting. The voices were probably still echoing through the stone passages, calling out to anyone who might wander within range. And Tony Turner, whoever or whatever he was, might still be down there, helping lost explorers find their way back to safety. Or maybe not. Maybe I'd never see him again, never get answers to the questions that were multiplying in my mind. Maybe the whole experience would remain a mystery, filed away with all the other inexplicable things that happen to people who spent too much time exploring places they weren't supposed to go. River turned off his desk lamp and settled into bed with a tired sigh. \"Night, Anthony.\" \"Goodnight,\" I replied, but I remained sitting by the window, looking out at the campus and thinking about the hidden world that lay beneath it. I couldn't get Tony Turner out of my head. Three days had passed since I climbed out of that grate behind the engineering building, and I kept replaying every detail of our encounter. The way he moved through those tunnels with absolute certainty, his calm voice cutting through the chaos of those fake children's cries, the outdated cut of his suit, the formal way he spoke, and then his complete disappearance from the shelter, as if he'd never been there at all. River had noticed my distraction during our thermodynamics study sessions. I'd catch myself staring at the same page for 20 minutes, my mind wandering back to that underground maze. Every time he asked if I was okay, I gave him the same answer about being tired from midterms. The lie came easier each time I told it, but I needed answers. Real ones. Thursday morning found me back in the university archives, claiming research for a history paper on Cold War preparedness. The librarian, Mrs. Chen, had helped me before with campus construction records. She led me to the same basement storage room where I'd first discovered the 1961 budget report mentioning emergency shelter construction. \"You're becoming quite the expert on our institutional history,\" she said, pulling out additional boxes from the early 1960s. \"Most students never dig this deep into the archives.\" I thanked her and waited until her footsteps faded up the stairs before opening the first box. The musty smell of old paper filled my nostrils as I lifted manila folders containing meeting minutes, budget reports, and correspondence between university administration and Federal Civil Defense officials. The first hour yielded nothing new. Budget allocations for concrete and steel, architectural plans I'd already seen, letters discussing the necessity of protecting essential personnel during potential nuclear attacks, standard bureaucratic documentation from an era when the world felt perpetually on the brink of destruction. Then I found the incident reports. The folder was thicker than the others, stuffed with carbon copies of memos, handwritten notes, and what looked like internal investigation documents. The tab read Safety Incidents 1962-1963 in faded blue ink. I opened it carefully, and Tony Turner's name jumped out at me from the very first page. Incident Report, October 15th, 1962. Missing person, Anthony Turner, maintenance supervisor, Physical Plant Department. My hands went still on the paper. Anthony Turner, not Tony. But the rest of the details made my stomach drop.Subject failed to return from routine safety inspection of emergency shelter facilities. Last seen entering lower level access at approximately 1430 hours. Search conducted by campus security and local fire department. No trace found. I read the paragraph three more times, my mind racing. The date was significant. October 1962, right in the middle of the Cuban Missile Crisis when tensions between the United States and Soviet Union had pushed the world closer to nuclear war than ever before. The university would have been conducting regular drills, testing their emergency procedures. The next document was a handwritten report from the search team leader, Fire Chief Robert Manning. His account was more detailed and far more unsettling. \"Searched main shelter room and adjacent storage areas. Found Turner's clipboard and flashlight on metal table, but no sign of struggle or disturbance. Discovered unauthorized opening in east wall leading to unknown tunnel system. Opening appears to have been created by breaking through concrete, possibly during original construction. Attempted to search tunnel system, but encountered acoustic anomalies that prevented thorough investigation. Team reported hearing voices and sounds that could not be accounted for. Search discontinued due to safety concerns and potential psychological effects on personnel.\" Acoustic anomalies. Voices and sounds that could not be accounted for. I set the report down and rubbed my eyes. The fire chief had encountered the same phenomena I'd experienced. Those fake children's voices, the perfect mimicry of familiar people calling for help. Even in 1962, those things had been down there luring people deeper into the tunnels. The next page contained a black and white photograph clipped to a personnel file. I recognized him immediately. The same serious blue eyes, the same neatly styled graying hair, the same facial structure I'd memorized during our journey through the underground maze. The photograph showed him in a white dress shirt and narrow tie standing next to some kind of industrial equipment. The caption read, \"Anthony Turner, Maintenance Supervisor, 1961.\" My breathing became shallow as I stared at the image. Every detail matched my memory of the man who'd guided me to safety. The way he carried himself, the confident expression, even the style of his clothing. Though in the photograph, it was clean and new instead of dusty and worn. But according to this file, Anthony Turner had disappeared on October 15th, 1962, 61 years ago. I flipped through more documents looking for any mention of his body being recovered or the case being solved. Nothing. The file contained a few follow-up memos from the weeks after his disappearance, but they all reached the same conclusion. No trace found. Case suspended pending new evidence. The final document in the folder was a typed memo from the university president to the board of trustees dated November 1962. The language was careful and bureaucratic, but the message was clear. The incident was being classified to avoid panic during an already tense period of international crisis. The tunnel system would be sealed and no further mention of the disappearance would be made in public records. Except they hadn't sealed it. Someone had replaced the concrete with that iron grate probably years later when the immediate crisis had passed and people had forgotten about Anthony Turner's disappearance. I sat back in the metal chair trying to process what I'd discovered. The man who'd saved me from those voices had been dead for over 60 years. He'd vanished in the same tunnel system where I'd encountered him, probably falling victim to the same trap that had almost claimed me. But somehow he was still down there, still helping people find their way out. I picked up the photograph again, studying every detail, the confident smile, the professional demeanor. This was a man who took his job seriously, who felt responsible for maintaining the safety systems that protected the campus community. When the crisis hit and the shelter needed to be inspected, he'd gone down there alone to do his duty, and he'd never come back up. The voices had gotten him just like they'd almost gotten me. But instead of becoming another victim, he'd somehow found a way to fight back to help others escape the same fate. I thought about his behavior in the tunnels, the way he'd moved with such certainty, never hesitating at intersections or dead ends, the complete immunity to the psychological effects that had nearly overwhelmed me. His urgent warnings about not listening, not looking back, not responding to the voices. He'd learned how to navigate that underground hell through decades of experience, 60 years of helping lost people find their way back to the surface, 60 years of standing guard against whatever force created those false voices and acoustic traps. The realization hit me like a physical blow. When I'd turned around in the shelter to thank him, he'd already vanished because he couldn't leave those tunnels. He was bound to that underground realm, trapped there just as surely as his targets, but fighting against the darkness instead of surrendering to it. I carefully photographed each document with my phone, making sure to capture every detail clearly, the incident report, the search team's account, the personnel file, and especially that photograph of Anthony Turner in 1961, back when he was alive and had no idea what fate awaited him in those tunnels. Mrs. Chen's voice echoed down the stairs telling someone about closing procedures.I quickly returned the documents to their folders and packed everything back into the storage boxes. My hands were shaking slightly as I carried them back to their proper shelves. Walking across campus in the late afternoon sun felt surreal. Students hurried between classes, focused on exams and assignments, and all the normal concerns of college life. None of them knew about the man who'd been protecting them for 60 years, standing watch in the darkness beneath their feet. I stopped at the engineering building and looked toward the north side where the grate was hidden behind overgrown bushes. From here, it looked like any other campus building. Ordinary, safe. But I knew better now. Anthony Turner was still down there, probably would always be down there. The university had forgotten about him, filed away his disappearance as an unsolved case from a turbulent era. But he hadn't forgotten about his responsibility to keep people safe. I pulled out my phone and looked at the photograph I'd taken of his personnel file, the same face that had emerged from the shadows to guide me home, the same calm authority that had cut through the chaos of those false voices. He'd saved my life, and I didn't even know if he was aware that I'd learned his identity. Did ghosts know when the living discovered their stories? Could he tell that someone finally understood what had happened to him in October 1962? The questions multiplied in my mind as I stood there in the fading daylight. How many others had he helped over the decades? How many people had stumbled into those tunnels and found their way out because Anthony Turner refused to abandon his post? And what exactly were those voices? What force had created that underground trap, and why did it seem so determined to lure people deeper into the earth? I looked at the photograph one more time before putting my phone away. Anthony Turner had been 42 years old when he disappeared, wearing the same style of business suit I'd seen in the tunnels. The impossible truth settled over me like a weight I'd carry forever. I had been rescued by a ghost who had been protecting people in those tunnels for decades. I closed the archive folder and slipped my phone back into my pocket. But the weight of what I'd discovered stayed with me. Anthony Turner's photograph burned in my memory as I walked back across campus that evening. The serious blue eyes, the graying hair, the narrow tie, every detail matched the man who had guided me through those tunnels. The man who had died 61 years ago. Sleep didn't come easily that night. I lay in bed staring at the ceiling while River's steady breathing filled the room. Every time I closed my eyes, I saw Turner's face in that 1961 personnel photo. Then the same face emerging from the shadows in that underground chamber. The impossible reality of it made my chest tight. I had been saved by someone who shouldn't exist, guided to safety by a ghost who had been protecting people in those tunnels for decades. The next morning brought thermodynamics class, but I couldn't focus on Professor Kellman's lecture about entropy and heat transfer. The equations on the whiteboard blurred as my mind drifted back to those dark passages. River nudged me twice when I stopped taking notes entirely. During the break, he asked if I was feeling sick. I told him I was fine, just tired. Another lie to add to the growing collection. That weekend, I should've been planning my next exploration. My laptop contained a folder full of potential sites, abandoned factories on the outskirts of town, forgotten maintenance tunnels beneath the old hospital, even rumors of Cold War bunkers in the surrounding hills. Urban exploration had been my passion for three years, the thing that made me feel most alive. But now, the thought of entering any dark, hidden space made my stomach clench. I tried to rationalize it away. Posttraumatic stress from getting lost underground, I told myself. A perfectly normal reaction to a dangerous situation. But I knew it went deeper than that. The voices I'd heard down there, River's voice, Rosie's voice, the crying children, they had been so convincing, so perfectly crafted to draw me deeper into that maze. Whatever intelligence had created those sounds understood exactly how to manipulate human psychology, how to exploit our instinct to help others. The realization that I had been prey, that something had been hunting me through those tunnels changed everything. River noticed my withdrawal first. We'd always shared information about interesting sites around campus, traded stories about successful explorations. But when he mentioned seeing construction barriers around the old steam plant, suggesting we check it out together, I made excuses. Too much studying to do, midterms coming up, maybe later. \"You haven't taken any photos in weeks,\" he said one evening, looking up from his thermodynamics textbook. \"That's not like you.\" I glanced at my camera, sitting unused on my desk. The memory card still contained those images from the fallout shelter, the civil defense posters, the emergency supplies, the dark opening in the wall where everything had gone wrong. \"Just taking a break,\" I said. \"Focusing on classes.\" River gave me a look that said he didn't believe me, but he didn't push. That was one thing I appreciated about him. He respected boundaries, even when he was clearly concerned.The real test came two weeks later when Marcus Chen, a junior I'd met through online Urbex forums, approached me in the library. He'd heard I knew the campus well, he said. Had I ever found anything interesting in the older buildings? He was particularly curious about underground access points, maintenance tunnels, that sort of thing. My throat went dry. \"Why do you ask?\" \"There are rumors about Cold War bunkers,\" Marcus said, leaning forward with the same excitement I used to feel about hidden spaces. \"Someone on the forums mentioned seeing a grate behind one of the engineering buildings. Thought you might know something about it.\" The words hit me like ice water. Someone else had noticed the grate. Someone else was planning to go down there, to follow the same path I had taken. I thought about Marcus descending those concrete steps, finding the tunnel opening, hearing the first faint cries for help. I imagined him following those voices deeper and deeper, past the point where chalk arrows could guide him home. \"Don't,\" I said, more sharply than I intended. \"Stay away from that area.\" Marcus blinked. \"What? Why?\" I struggled to find words that wouldn't sound insane. \"It's dangerous, unstable. You could get hurt.\" \"Have you been down there?\" The question hung between us. I could see the curiosity burning in his eyes, the same hunger for discovery that had driven me to pry open that grate. How could I explain what waited in those tunnels without sounding completely unhinged? How could I tell him about voices that mimicked people you cared about, about passages that led deeper than any map suggested, about a man who had died in 1962 but still walked those dark corridors? \"Promise me you won't go there,\" I said finally. \"There are plenty of other sites, safer ones.\" Marcus studied my face, clearly puzzled by my intensity. \"Okay, sure. If you say so.\" But I could see the questions in his expression, the way his curiosity had only been sharpened by my warning. I'd handled it badly, made the forbidden area seem even more intriguing. That night, I lay awake, wondering if I should have told him everything, given him the full truth about what lurked beneath the campus. But who would believe such a story? And if they did believe it, would that knowledge protect them or just make them more reckless? Over the following weeks, I found myself avoiding the northeast section of campus entirely. I took longer routes to classes, chose different study spots, made sure my daily path never brought me near the engineering building. The few times I accidentally wandered too close, I felt that familiar weight in my chest, the memory of crushing darkness and whispering voices. My hands would start shaking, and I'd have to sit down until the feeling passed. River finally confronted me about it on a Thursday evening in November. He'd been watching me pace around our room for 20 minutes, unable to settle down to studying. \"Anthony, what's going on with you?\" I stopped pacing. \"What do you mean?\" \"You've been different for weeks, jumpy, distracted. You won't talk about photography anymore. You avoid half the campus. And yesterday, I saw you turn around and walk the other direction when we were heading to the library. What happened?\" The concern in his voice almost broke me. This was the person whose voice had called to me from those tunnels, whose perfectly replicated pleas for help had nearly convinced me to abandon Tony Turner's guidance. But this was the real River, my roommate and friend, not some malevolent echo designed to lead me astray. \"I can't explain it,\" I said quietly. \"Not in a way you'd believe.\" \"Try me.\" I looked at him, really looked at him. River had always been straightforward, practical, grounded in the physical world of engineering and mathematics. How could I tell him about ghosts and voices that shouldn't exist? How could I explain that his own voice had been weaponized against me in those tunnels? \"I went somewhere I shouldn't have gone,\" I said finally. \"Saw things that changed how I think about exploration. Some places are better left alone.\" River waited for more, but I couldn't give him more, not without sounding delusional. \"Are you okay though? Physically, I mean.\" \"Yeah, I'm okay.\" He nodded slowly. \"If you ever want to talk about it, whatever it was, I'm here.\" The offer meant more than he could know, but some experiences couldn't be shared. Some knowledge was too dangerous to pass on. I had learned that there were places in the world where the normal rules didn't apply, where something hungry and patient waited for curious people to venture too deep. That knowledge was a burden I would have to carry alone. My nightmares began in December. Always the same sequence, following those crying voices through endless branching passages, my chalk arrows disappearing from the walls, the flashlight growing dimmer with each step. Sometimes I would find myself back in that chamber where Tony Turner had first appeared, but he wouldn't be there. Just the voices multiplying and growing more desperate, more convincing. I would wake up gasping, my sheets soaked with sweat, the sound of children crying still echoing in my ears.During one particularly vivid nightmare, I dreamed that I had ignored Turner's warnings and followed the voices deeper. The tunnels kept branching, kept leading me down until I was so far beneath the Earth that my phone had no signal and my chalk had run out. When I tried to turn back, every passage looked the same. The voices laughed then, no longer bothering to mimic human distress. They had what they wanted. I woke from that dream with the absolute certainty that it had been more than imagination. Somehow, I had glimpsed what would've happened if Tony Turner hadn't intervened. I would've joined whatever collection of lost souls fed those voices, become another lure to draw future victims deeper into the maze. The thought haunted me through finals week. While other students stressed about exams and term papers, I found myself thinking about Turner's sacrifice. He had died in those tunnels in 1962, but instead of becoming part of whatever darkness lived down there, he had chosen to fight it. For 60 years, he had been protecting people, guiding them back to safety when they wandered too far into that underground trap. How many others had he saved? How many curious explorers, maintenance workers, or lost students had encountered those voices over the decades? Turner had given up any chance of rest or peace to stand guard against something that fed on human curiosity and compassion. The magnitude of that sacrifice was staggering. Spring semester arrived, and with it came a new crop of urban exploration enthusiasts. I watched them in online forums sharing photos of abandoned buildings and discussing potential sites. Several mentioned the campus, speculating about tunnels and hidden spaces. Each post made my stomach tighten. I wanted to warn them all, but how could I do it without revealing too much? How could I protect them without putting myself at risk? The solution came to me gradually. I began participating in forum discussions again, but only to steer people away from certain areas. When someone posted about underground exploration near universities, I would mention safety concerns, suggest better sites elsewhere, emphasize the legal risks of trespassing on campus property. I became known as the cautious voice in the community, the one who always advocated for proper permits and official access. Some people listened. Others dismissed my warnings as overcautiousness. But I kept posting, kept trying to redirect curiosity towards safer outlets. It wasn't much, but it was something, a small way of honoring Turner's protection by extending it to others. My own relationship with exploration had changed permanently. The passion that had once driven me to seek out hidden places was gone, replaced by a deep wariness of forgotten spaces. I still felt the pull sometimes, the old excitement when I glimpsed a promising doorway or heard rumors of abandoned tunnels. But now, that excitement was tempered by the knowledge of what might be waiting in the darkness. I completed my degree at Riverside University that spring, walking across the stage to receive my diploma while carefully avoiding eye contact with the engineering building in the distance. During the ceremony, I thought about Turner again. Was he still down there? Still protecting people who wandered into those tunnels? Did he know that someone finally understood what he had sacrificed? Did it matter to him that his heroism was remembered, even if it could never be officially acknowledged? After graduation, I moved away from Riverside, taking a job in a city where the buildings were newer and the underground infrastructure was well-mapped and maintained. But I never forgot those tunnels or the man who had saved my life in them. Sometimes late at night, I would think about other hidden places around the world, other forgotten spaces where curious people might venture. I wondered if Turner was unique or if there were others like him, guardians standing watch in the darkness, protecting the living from things that should not be. The nightmares faded over time, but they never completely disappeared. Once or twice a month, I would dream of tunnels and voices, of chalk arrows that led nowhere and lights that failed at the worst possible moment. But now, Turner was always there in those dreams, emerging from the shadows with his calm authority and serious blue eyes. Even in sleep, he continued to guide me to safety. I learned to live with the knowledge of what existed beneath that campus. Some doors should never be opened. Some places were meant to remain forgotten. But I also learned that even in the darkest spaces, there could be guardians, heroes who chose to stand against the darkness rather than surrender to it. Turner had saved more than my life that night. He had shown me that some mysteries were too dangerous to pursue, that curiosity without wisdom could lead to destruction. It was a hard lesson, one that had cost me my passion for exploration, but it was also a necessary one. Some places were meant to remain hidden, and some people were brave enough to make sure they stayed that way. The phone call came on a Tuesday morning in March, three years after I'd graduated from Riverside University. I was sitting at my kitchen table in my apartment downtown, scrolling through news headlines while my coffee cooled when my phone buzzed with a number I didn't recognize. \"Anthony Meyer?\" The voice was unfamiliar, professional.Yeah. That's me. This is Detective Sarah Hoffman with the Riverside Police Department. I'm calling about a missing person case. Your name came up in our investigation. My stomach dropped. The coffee mug felt suddenly heavy in my hands. Missing person? A student named Marcus Chen, he disappeared three days ago. According to his roommate, he mentioned your name before he went missing, said you'd warned him about something on campus. Marcus. I remembered him from the library, remembered the way his eyes had lit up when I'd tried to warn him away from the engineering building. I'd seen that same curiosity in my own reflection once, that hunger for hidden places and forgotten secrets, the hunger that had nearly killed me. \"I haven't spoken to Marcus in years,\" I said, which was true. \"What happened?\" \"His roommate says he was obsessed with exploring campus infrastructure, tunnels, maintenance areas, that sort of thing. Ring any bells?\" Everything about it rang bells. The detective's words brought back the weight of those stone passages, the echo of children's voices calling from the darkness, the feeling of being watched by something that wanted to drag me deeper into places where no one would ever find me. I closed my eyes and saw Tony Turner's serious face, his dusty business suit, the way he'd moved through those tunnels like he'd been walking them for decades, which I supposed he had been. \"Detective, where exactly did Marcus disappear?\" \"Near the engineering building. Campus security found his backpack behind the building along with some tools. Looks like he was trying to access something.\" The grate. Marcus had found the grate, just like I had, just like Tony Turner had 61 years ago when he was still alive and still thought he could handle whatever was waiting in the dark. \"I need to tell you something,\" I said. \"But you're not going to believe it.\" Detective Hoffman listened while I explained about the tunnels, about the voices that mimicked people you cared about, about the way the passages twisted and branched until you couldn't find your way back. I didn't mention Tony Turner. That part of the story felt too personal, too impossible to share with someone who hadn't been there. Instead, I focused on the danger, on the way the tunnels could trap someone who went in unprepared. \"Mr. Meyer,\" she said when I finished, \"Are you saying you think Marcus is still down there?\" \"I'm saying those tunnels are dangerous, more dangerous than anyone realizes. If Marcus went in alone...\" I didn't finish the sentence, didn't want to think about Marcus wandering through those stone passages, following voices that sounded like his friends, his family, while something malevolent led him deeper and deeper until his flashlight died and he was lost forever in the dark. After I hung up, I sat at my kitchen table for a long time, staring at my phone. Three years had passed since I'd crawled out of that grate and sworn I'd never go back. Three years of avoiding abandoned buildings, of taking well-lit routes through familiar streets, of keeping my camera in its case because the thought of exploring dark places made my hands shake. But Marcus was down there, a kid who'd asked the wrong questions and ignored the right warnings, just like I had. I opened my laptop and booked a flight to Riverside. The campus looked the same when I arrived that evening. Same brick buildings, same tree-lined paths, same clusters of students hurrying between classes with backpacks slung over their shoulders. I'd driven straight from the airport to the university, not bothering to check into a hotel first. The engineering building sat exactly where I remembered it, its windows glowing yellow in the gathering dusk. I parked across the street and walked around to the north side of the building. The bushes had grown thicker in the three years since I'd been here, creating better cover for the iron grate. I pushed through the branches and found it exactly as I'd left it. The metal still corroded and stained, the concrete frame still cracked from decades of weather. Someone had forced it open recently. The rust flakes around the edges were fresh, and I could see scratches in the metal where tools had been applied. Marcus's tools probably, the same kind of small crowbar I'd used when I was stupid enough to think curiosity was worth any risk. I knelt beside the opening and shone my phone's flashlight down the concrete stairs. The beam barely penetrated the darkness below, but I could see the first few steps, the same carefully constructed descent that led to the Cold War shelter. Somewhere beyond that, past the broken wall and through the stone passages, Marcus was either still alive and terrified or he was something else entirely. The smart thing would be to call Detective Hoffman, tell her I'd found the entrance, let the professionals handle it. Campus security, the fire department, maybe even the state police. They had equipment, training, backup. They could map the tunnels properly, set up communication lines, do everything the safe and rational way. But I knew what would happen if they went down there unprepared. The voices would start calling, mimicking the searchers' loved ones, leading them away from each other and deeper into the maze. Some of them might make it out, others wouldn't. And Marcus, if he was still alive, might be lost forever while they tried to figure out what they were dealing with. I thought about Tony Turner trapped in those tunnels for 60 years, fighting against whatever darkness lived in the deep places.\nI thought about the way he'd appeared when I needed him most, the calm authority in his voice when he told me to stop following the voices. He'd saved my life, but he'd done more than that. He'd shown me that some people chose to stand guard against the things that wanted to hurt others. Maybe it was time for me to make that choice. I went back to my car and opened the trunk. I'd brought everything I could think of on the flight, a powerful LED flashlight with extra batteries, chalk for marking routes, rope, a first aid kit, emergency flares, even a hand crank radio in case I needed to signal for help. I'd learned from my first trip into those tunnels. This time, I was going prepared. I also brought something else. In the bottom of my backpack, wrapped in a towel, was my camera. I hadn't used it in three years, hadn't even taken it out of its case since the day I'd photographed the civil defense posters in the shelter. But if something happened to me down there, if I didn't make it back, I wanted there to be evidence, photos of the tunnels, documentation of what was really lurking beneath the campus. Maybe it would help the next person who had to make this choice. The sun had set completely by the time I finished checking my equipment. The campus was quieter now. Most students are either in their dorms or at the library. I could see lights in the engineering buildings windows, but the north side was dark and empty. Perfect conditions for someone to slip through a hidden entrance and disappear into the underground maze. I shouldered my backpack and walked back to the grate. My hands were shaking as I pulled it open, the metal hinges creaking in the night air. The concrete stairs descended into absolute darkness, just as they had three years ago. But this time, I wasn't going down out of curiosity. I was going down because someone needed help, and because I might be the only person who understood what was waiting in the dark. I turned on my flashlight and started down the steps. The beam cut through the blackness, illuminating the familiar concrete walls of the shelter. My footsteps echoed in the enclosed space, a hollow sound that reminded me of all the times I'd heard those same echoes bouncing back from stone passages that seemed to go on forever. The shelter looked exactly as I'd left it. Same metal tables, same folding chairs, same civil defense posters warning about nuclear attacks that never came. But there were new signs of disturbance. A backpack in the corner that didn't belong to me. Fresh footprints in the dust. A water bottle sitting on one of the tables. Marcus had been here. He'd made it this far, at least. I walked to the far wall where the opening led to the stone tunnels. The jagged hole in the concrete was just as I remembered it, a rough break that someone had made decades ago to connect the official shelter to the much older passages beyond. I shone my light through the opening and saw the hand-carved steps leading down into the bedrock. That was where the real danger started. That was where the voices lived, where something ancient and hungry waited for people like Marcus, people like me, people who couldn't resist the pull of hidden places and forgotten secrets. I checked my equipment one more time, made sure my chalk was easily accessible, verified that my backup batteries were secure. Then I ducked through the opening and began my descent into the stone tunnels beneath Riverside University. The steps felt the same under my feet, worn smooth by decades of use. The walls showed the same tool marks, the same evidence of careful excavation by people who'd worked these passages long before the university was built. But now I knew I wasn't alone down here. Somewhere in the maze ahead, Marcus was either still fighting to find his way out or he'd become part of whatever malevolent presence called these tunnels home. And somewhere else in the darkness, if I was lucky, Tony Turner was still standing guard."
}