{
  "title": "I Guide Tours Through the Canadian Wilderness. Yesterday I Saw Something TERRIFYING.",
  "upload_date": "",
  "duration_sec": 4310.0,
  "segments": [],
  "full_text": "I checked my watch, 7:30 in the morning, right on schedule. The parking area at the trailhead buzzed with that familiar pre-hike energy as my group of six gathered around me, adjusting straps and checking their gear one last time. Three days in the Canadian wilderness ahead of us, and from what I could tell, this looked like a solid bunch. \"All right, everyone,\" I called out, hefting my pack higher on my shoulders. \"Before we head out, let's make sure you've all got what you need.\" I pulled out my checklist and started distributing the last-minute supplies. Eddie Cruz stepped forward first. Middle-aged guy with wire-rimmed glasses, the kind of tourist who actually read the packing list twice. His wife, Hazel, hung back slightly, looking nervous but determined. Their daughter, Nicole, bounced on her toes, camera already in hand like most 17-year-olds on their first real wilderness trip. \"Eddie, here's your emergency whistle,\" I said, handing him the small device. \"Hope you won't need it, but better to have it.\" \"Thanks.\" Eddie clipped it to his jacket with the kind of careful precision that told me he was the type to follow instructions. Good. I like that in a client. Robert Herrera stepped up next, and I could tell immediately he was former military or maybe a teacher. Something about the way he carried himself. 68 years old according to my roster, but he moved like someone 20 years younger. \"Water purification tablets,\" I said, passing him a small packet. \"One per liter if we run into any issues with our main supply.\" \"Understood.\" Robert tucked them into his front pocket with practiced efficiency. Deborah Cunningham approached with that eager photographer's energy I recognized from dozens of previous trips. Young, blonde, probably here for the Instagram shots as much as the experience. Nothing wrong with that as long as she stayed safe doing it. \"Extra batteries for your camera equipment,\" I told her, handing over a small waterproof case. \"These temperatures can drain them faster than you'd expect.\" \"Oh, perfect. Thank you so much.\" Deborah's enthusiasm was genuine at least. She immediately started reorganizing her camera bag to fit the new supplies. Derek Miles waited at the back of the group, looking like he'd walked straight out of an outdoor gear catalog. Everything too new, too expensive, too perfect. Corporate type, probably. But he seemed eager enough, and the gear would do its job regardless of how recently he'd bought it. \"Derek, here's your backup compass,\" I said. \"I know you've got GPS, but electronics fail. This won't.\" \"Makes sense.\" Derek examined the compass with the kind of focused attention that suggested he actually planned to learn how to use it. Another good sign. I turned to address the whole group, running through my standard safety briefing. \"We're looking at roughly 15 kilometers today with about 400 meters of elevation gain. The trail is well marked for the first half. Then we'll be following older paths that require a bit more attention.\" Nicole raised her hand like she was still in school. \"How long until we reach the first campsite?\" \"About six hours, accounting for breaks and photo stops.\" I caught her excited grin. \"Yes, there will be plenty of photo opportunities. Just remember, safety first, pictures second.\" The morning air carried that crisp bite that promised a perfect hiking day. Clear skies, light wind, temperatures that would warm up nicely once we got moving. I'd guided this route probably 50 times over the past eight years, and it never got old. The Canadian wilderness had a way of putting things in perspective, stripping away all the noise and complexity of regular life. \"Everyone's got their water?\" I did a quick visual check. \"We'll hit our first refill point around noon, but make sure you're drinking regularly before then.\" Hazel adjusted her pack straps, wincing slightly. \"Is it normal for these to feel so heavy at the start?\" \"Completely normal,\" I assured her. \"Your body adjusts after the first hour or so. If it's still bothering you later, we can redistribute some weight.\" That was the thing about guiding, half the job was reading people, figuring out who needed encouragement, who needed firm direction, who was going to push too hard, and who might hold the group back. This bunch seemed pretty balanced. Eddie and Hazel looked like they'd done their homework. Nicole had that teenage invincibility thing going. Robert clearly knew how to handle himself outdoors. Deborah seemed competent with her gear, and Derek had at least invested in proper equipment. \"All right, let's move out.\" I shouldered my pack and headed toward the trailhead marker. \"We'll take it easy for the first kilometer while everyone finds their rhythm.\" The trail started with a gentle incline through mixed forest, pine, birch, and maple, creating a canopy that filtered the morning light into shifting patterns on the forest floor. I set a comfortable pace, checking over my shoulder every few minutes to make sure the group stayed together. Eddie and Hazel walked side by side, talking quietly. Nicole had already stopped twice to photograph interesting tree formations, but she was keeping up without any problems. Robert maintained steady progress about 10 meters behind me, while Deborah and Derek brought up the rear, chatting about camera settings and lens choices. The rhythm of hiking settled over us. Boots on packed earth, the occasional rustle of wildlife in the underbrush, the soft murmur of conversation.This was what I loved about the job. Take people out of their normal environment, give them something real and immediate to focus on, and watch them discover parts of themselves they'd forgotten existed. We'd been walking for about two hours when I spotted the turnoff for Lookout Point. Not part of our planned route, but the morning was going so well that a small detour seemed like a good idea. The overlook offered one of the best views in the area, and groups always appreciated the photo opportunity. \"Quick stop ahead,\" I called back to the group. \"There's a scenic overlook about 200 meters off the main trail. Worth the extra steps.\" Nicole perked up immediately. \"Really? How scenic are we talking?\" \"See for yourself in a few minutes.\" The side trail climbed steeply through a stand of old-growth pine, the kind of trees that made you feel small in the best possible way. I could hear the group's breathing getting heavier behind me, but nobody complained. Good sign. They were all in better shape than their paperwork had suggested. The trees opened up suddenly, revealing a rocky outcrop that jutted out over a wide valley. The view stretched for kilometers. Rolling hills covered in forest, a meandering river catching the morning light, mountains rising in the distance like something out of a postcard. \"Wow.\" Deborah was already pulling out her camera. \"This is incredible.\" \"Take your time,\" I said, setting my pack down near a large boulder. \"We're making good time, so we can afford a longer break here.\" I pulled out my binoculars, habit more than necessity. Part of being a good guide was staying aware of everything around you, even when things seemed perfectly safe. I scanned the valley below, checking for wildlife, weather changes, anything that might affect our route. That's when I saw him. About 60 meters down in the meadow that spread out at the base of the cliff, a lone figure sat perfectly motionless. At first glance, nothing unusual. Hikers stop to rest all the time. But something about this one made me look closer. The jacket caught my attention first. Bright orange and yellow, the kind of high-visibility gear that practically glowed against the green grass of the meadow. But it wasn't just the colors that seemed off. It was the way he sat, completely still like a statue someone had placed in the middle of nowhere. I adjusted the focus on my binoculars, trying to get a clearer look. The figure was definitely human, male from what I could tell, but there was something about his posture that didn't sit right with me. Too rigid. Too perfectly motionless. People don't sit that still, not unless something's wrong. I'd been guiding long enough to trust my instincts, and right now, they were telling me to pay attention. The wilderness had its own rhythms, its own normal patterns of movement and sound. This figure didn't fit. \"Dean?\" Eddie's voice broke into my concentration. \"Everything okay?\" \"Just checking the area,\" I said, not lowering the binoculars. \"Making sure our route's clear.\" But I kept watching the figure in the meadow. Still hadn't moved, not even a shift in position or a turn of the head. Just sitting there in that unnaturally bright jacket, facing away from our overlook. Then he started to move. Not normal movement. Not the kind of shifting or stretching you'd expect from someone who'd been sitting for a while. Instead, his torso began swaying back and forth in a slow, rhythmic motion that made my skin crawl. I tightened my grip on the binoculars, telling myself I was seeing things wrong. Maybe he was doing some kind of exercise or meditation, or just stretching out sore muscles. But the movement continued, growing more pronounced, and my unease deepened into something closer to alarm. The swaying wasn't random. It followed a pattern, forward, back, side to side, like he was moving to music only he could hear. But it was the angle of the movement that really bothered me. His torso bent in ways that seemed to push the limits of normal human flexibility, tilting at angles that should have been uncomfortable or impossible to maintain. \"What are you looking at?\" Nicole appeared beside me, camera in hand. \"Can I see?\" \"Just wildlife,\" I said, still watching through the binoculars. The figure's arms had started moving now, twisting and contorting in ways that definitely weren't normal. The joints seemed to bend at impossible angles, like he was made of rubber instead of bone and muscle. This wasn't right. This wasn't human. My pulse started racing, that fight-or-flight response kicking in, even though I couldn't explain what I was seeing. Every instinct I'd developed over years in the wilderness was screaming that something was very, very wrong down in that meadow. \"Dean?\" Eddie had moved closer, concern clear in his voice. \"What's going on?\" Before I could answer, Nicole raised her camera toward the valley. \"Is that a person down there in the bright jacket?\" \"Nicole, put the camera away.\" The words came out sharper than I'd intended, but I didn't care. Whatever was happening down there, I didn't want any record of it. I didn't want my group anywhere near it. \"But-\" \"Now.\" I lowered my binoculars and turned to face the group, forcing my voice back to something resembling calm authority. \"We need to keep moving. Weather's supposed to change later, and I want us at the campsite before it hits.\"That was a lie. The weather forecast had been clear for the next 48 hours, but I needed to get these people away from this overlook, away from whatever was happening in that meadow below. The figure was still moving, still swaying and contorting in ways that violated everything I knew about human anatomy. And I had the terrible feeling that if we stayed here much longer, it might notice us watching. \"Everyone pack up,\" I said, already shouldering my gear. \"Time to go.\" I kept the binoculars pressed to my face, unable to look away from whatever was happening down there. The figure's swaying had become something else entirely. Violent, jerky movements that made my stomach drop. Then the man's head started shaking. Not a normal shake. This was rapid, erratic, like he was having some kind of seizure. His head whipped from side to side so fast I could barely track the motion through the lenses. The violence of it made me take an involuntary step backward, my boots scraping against the rock. What the hell was I looking at? The head shaking stopped as abruptly as it had started. Then the figure stood up. My blood turned to ice water. The man, if that's what this was, unfolded to a height that defied everything rational. Seven feet tall, maybe more. His limbs stretched out like someone had taken a normal human frame and pulled it on a rack. Arms that hung too low, legs that seemed to bend in places they shouldn't. When he moved, it was with this fluid grace that looked completely wrong, like his joints were made of liquid instead of bone and cartilage. I'd been guiding people through wilderness for over a decade. I'd seen bears, wolves, mountain lions. I'd dealt with hypothermia, broken bones, panic attacks. But nothing, absolutely nothing had ever made me feel like this. Like every instinct I had was screaming at me to run. The worst part came next. The figure turned toward us. Not gradually, not with the slow movement of someone casually looking around. He pivoted with mechanical precision until he was facing our direction across the valley. Even at this distance, even through the binoculars, I could feel those eyes locked onto our position. He knew we were here. He knew we were watching. \"Dean?\" Eddie's voice seemed to come from very far away. \"Everything okay up there?\" I yanked the binoculars down and spun around. The entire group was looking at me with varying degrees of concern. Nicole had her camera half-raised again. Deborah was checking her equipment, and Derek was consulting his expensive GPS watch. Normal people doing normal things while something impossible stared at us from across the valley. \"We need to move,\" I said, shouldering my pack with movements that felt too sharp, too urgent. \"Right now.\" I positioned myself between the group and the edge of the overlook. Whatever was down there, I wasn't going to let it have a clear line of sight to my clients. The protective instinct kicked in hard. These people were my responsibility, and I'd be damned if I let anything happen to them on my watch. \"Everyone pack up,\" I continued, trying to keep my voice level. \"Stay together. We're moving fast.\" \"Dean, what's wrong?\" Hazel stepped closer, her dark eyes searching my face. She had that maternal ability to sense when something was seriously off. \"You look like you've seen a ghost.\" I wanted to tell her the truth, that I'd seen something that might be worse than a ghost, that every fiber of my being was telling me we needed to get as far away from this place as possible. Instead, I just repeated my instructions. \"Keep moving. Stay close. Don't look back.\" Robert had already shouldered his pack with military efficiency, but the others were moving too slowly. Nicole was still fiddling with her camera settings, Derek was checking his gear one more time, and Eddie was looking between me and the valley, like he was trying to figure out what had spooked me. \"Walk faster,\" I said, more firmly this time. \"I mean it.\" We started down the trail from the overlook, and I kept myself at the back of the group, constantly glancing over my shoulder. I couldn't see the meadow from this angle anymore, but that didn't make me feel any better. If anything, not being able to see what was happening down there made it worse. That's when the sound started. Deep, rhythmic thumping that echoed across the entire valley, like someone beating a massive drum, but with irregular timing that made my skin crawl. The sound was too loud, too resonant to be coming from anything normal. Thump, thump, thump, thump. \"What is that?\" Deborah had stopped walking, and was looking around with wide eyes. I knew what it was even though my rational mind was rejecting the possibility. The figure was beating his chest. Both fists from the sound of it, hammering against his torso with enough force that we could hear it clearly from hundreds of meters away. The impacts carried across the valley like thunder, each one making my teeth ache. \"Keep walking,\" I said, my voice coming out rougher than I intended. \"Don't stop.\" Nicole had gone pale, her camera forgotten in her hands. Eddie moved closer to his wife and daughter, his protective instincts kicking in even though he didn't understand the threat. Derek was looking around like he expected something to come crashing through the trees at any moment. Smart man. I herded them forward, pushing the pace as much as I dared without causing someone to trip on the uneven trail. We needed to put distance between us and whatever was in that meadow.We needed to get around the bend where the trees would block the line of sight. We needed to... The thumping stopped. The sudden silence was somehow worse than the noise had been. It felt like the entire forest was holding its breath, waiting for something to happen. I could hear my own pulse hammering in my ears, could feel sweat running down my back despite the cool mountain air. We reached the bend in the trail, and I guided the group around it, finally putting a wall of pine trees between us and the overlook. For the first time in the last 10 minutes, I felt like I could breathe properly. That feeling lasted exactly 30 seconds. The scream that ripped through the air froze every person in our group mid-step. It wasn't human, couldn't be human. The sound started low and guttural like it was coming from the bottom of a well, then climbed to a pitch that made my bones ache. There was something predatory in it, something that spoke to the deepest, most primitive part of my brain, the part that remembered when humans were prey animals, when things with claws and teeth hunted us in the dark. Nicole let out a small whimper and grabbed onto her mother's arm. Hazel had gone completely white, her eyes wide and terrified. Eddie was looking around like he expected something to come charging out of the woods. Robert had automatically dropped into a defensive stance, his military training kicking in, even though he had no idea what he was defending against. Derek was just standing there with his mouth open, his expensive gear suddenly looking very inadequate. Every muscle in my body had tensed to the point of pain. My hands were clenched into fists, my jaw locked tight. The sound seemed to go on forever, echoing off the valley walls and bouncing back at us from multiple directions until I couldn't tell where it was coming from anymore. When it finally stopped, the silence that followed felt heavy and oppressive, like the forest itself was afraid to make a sound. Robert's voice cut through the quiet like a blade. \"What the hell was that?\" His demand hung in the air, raw and desperate. The retired teacher in him expected answers, needed them, but I had nothing rational to offer. My mind was still processing what we'd witnessed, that thing in the meadow, the impossible movements, the predatory scream that had frozen every living creature within miles. Deborah's fingers dug into Derek's arm with enough force to leave marks. Her knuckles had gone white against his expensive jacket, and I could see her whole body trembling. Derek didn't seem to notice the pain. His corporate confidence had evaporated completely, leaving behind someone who looked like he'd never been outside an office building in his life. \"Dean?\" Eddie's voice was quieter than Robert's, but carried the same urgent need for explanation. \"What's happening?\" I forced my breathing to steady, tried to access the calm authority that had guided hundreds of clients through challenging situations. But this wasn't a twisted ankle or sudden weather change. This was something that violated every natural law I understood. \"We need to keep moving,\" I said, pulling my radio from its clip. \"Let me check in with the station.\" The radio crackled to life, but only static filled the channel. I adjusted the frequency, tried again. More static. We were too deep in the wilderness, too far from the repeater towers that carried signals back to civilization. The realization hit me like cold water. We were completely cut off. Nicole had pressed herself against her mother's side, her camera forgotten and hanging loose around her neck. Hazel's face had drained of all color, her eyes darting between the trees as if expecting something to emerge from the shadows. The family unit that had been casually enjoying a nature walk an hour ago now looked like refugees fleeing a war zone. \"The radio's not reaching,\" I said, clipping it back to my belt, \"but that's normal at this distance.\" The lie came easily, automatically. Part of my job was managing group psychology, keeping panic from spreading like wildfire through inexperienced hikers. But looking at their faces, I realized panic had already taken root. \"We're changing our route,\" I announced, shouldering my pack with deliberate calm. \"Instead of continuing to the campsite, we're taking a more direct path back toward the parking area.\" Robert stepped forward, his military bearing reasserting itself despite his obvious fear. \"What about our gear? Our reservations?\" \"Safety first,\" I said. \"We can reschedule.\" It wasn't entirely untrue. Getting this group away from whatever was in that meadow had become my only priority. The planned route would keep us in the deep wilderness for another two days. The direct path could have us back to vehicles in six hours if we pushed hard. Derek cleared his throat, his business instincts kicking in. \"Is this about liability? Are we in some kind of danger?\" I met his eyes, saw the intelligence behind the fear. He was putting pieces together, recognizing that my sudden route change wasn't arbitrary. \"Just being cautious,\" I said. \"Follow me, stay close together.\" I led them off the main trail onto a narrower path that cut through dense forest. This route was steeper, more challenging, but it would get us out faster. My boots found familiar footing on the rocky ground, muscle memory guiding me while my mind raced through contingency plans.\nFor the next hour, we pushed through forests that felt wrong in ways I couldn't articulate. The normal sounds of wilderness, bird calls, rustling leaves, distant animal movement, had vanished completely. Our footsteps and labored breathing were the only sounds breaking the unnatural silence. Even the wind seemed to have died, leaving the air still and heavy. I kept glancing over my shoulder, scanning the trail behind us. The others had settled into a rhythm, focused on the challenging terrain, but my nerves remained on high alert. Every shadow between the trees could hide something watching us. Every crack of a branch under someone's foot made me tense for pursuit. Maybe we'd gotten lucky. Maybe whatever had been in that meadow was territorial, content to scare off intruders rather than hunt them down. Maybe the scream had been a warning rather than a promise. I let myself hope that distance and determination had been enough to escape. Nicole's scream shattered that hope like glass. \"Oh my God, behind us.\" I spun around, following her pointing finger back down the trail we'd just traveled. Through a gap in the trees, maybe 200 meters back, I could see it moving. The figure from the meadow was following us. Its gait was all wrong, a staggering jerky movement that should've been slow and clumsy, but somehow covered ground with terrifying speed. Arms and legs bent at angles that made my stomach lurch, joints moving in directions that defied human anatomy. Yet despite the uncoordinated appearance, it was gaining distance rapidly, closing the gap between us with each bizarre lurching step. My calm leadership facade cracked and fell away completely. \"Run!\" I shouted, abandoning every protocol about safe hiking practices. \"Everyone run! Now!\" The group exploded into motion, stumbling forward on the narrow trail with desperate urgency. I took a position at the rear, making sure no one fell behind while my ears strained for sounds of pursuit. Within seconds, I could hear it, the crash of vegetation being trampled, branches snapping under impossible weight, the sound of something moving through the forest with inhuman speed. I heard Hazel's sharp cry behind me and spun around to see her sprawled across the trail. Her hands wrapped around her ankle. The others kept running. I could hear their footsteps crashing through the underbrush ahead, getting fainter by the second. \"Hazel!\" I doubled back, my boots sliding on the loose dirt as I skidded to a stop beside her. She was breathing hard. Her face twisted in pain. \"My ankle,\" she gasped, trying to push herself up. \"I can't. It twisted when I went down.\" This was exactly what I'd been afraid of. In all my years guiding groups through wilderness, someone always got hurt when panic took over. People forgot to watch their footing, forgot to think about anything except getting away from whatever scared them. But right now, with that thing pursuing us, an injury could mean death. I crouched down next to her. My hands automatically checking her ankle through her hiking boot. It was already starting to swell. I could feel the heat and tightness even through the leather. Not broken, probably, but definitely sprained. She wouldn't be running anywhere on this. \"Can you put weight on it?\" I asked, though I already knew the answer from the way she winced when I barely touched it. \"I don't think so.\" Her voice was shaky, scared. \"Dean, what was that thing back there? What's happening?\" I opened my mouth to give her some reassuring lie, something about wildlife or confused hikers, but the words died in my throat, because when I looked up from her ankle, I saw it. The tall figure stood less than 20 meters away, perfectly still, except for his head, which jerked and twitched in rapid, violent motions. Left, right, forward, back. Like he was having some kind of seizure, but the rest of his body remained completely motionless. Those impossibly long arms hung at his sides, and even from this distance, I could see how wrong they looked. How the joints bent in directions that made my stomach turn. My blood went cold. How had he gotten so close without me hearing him? I'd been listening for sounds of pursuit, but there had been nothing. No crashing through brush, no snapping branches. He'd moved through the forest like a ghost. Hazel must've sensed my tension because she started to turn her head to look behind her. I grabbed her shoulder, keeping her facing away from the figure. \"Don't look,\" I whispered. My voice barely audible. \"Don't move.\" But I couldn't stop myself from staring. The shadows from the tree canopy fell across his face, but I could still make out enough to know that something was fundamentally wrong with his features. His face looked stretched somehow. Like someone had taken a normal human face and pulled it in directions it wasn't meant to go. His eyes caught what little light filtered through the trees, and they reflected it back with an unnatural gleam that reminded me of an animal's eyes in headlights, except animals blinked. This thing just stared with that horrible unblinking intensity. There was intelligence there, but it was alien, cold, like he was studying us, figuring out what we were and what he wanted to do with us. The thought made my skin crawl.Hazel was trembling against me, and I realized she could probably feel my own tension radiating through my hands where I gripped her shoulder. Her breathing was ragged, scared and way too loud in the unnatural quiet of the forest. I was afraid the sound might trigger something in that thing, might make him move toward us instead of just standing there with his head twitching like a broken machine. \"Dean,\" she whispered, so quietly I almost didn't hear her. \"What's wrong?\" I couldn't answer, couldn't take my eyes off the figure. Couldn't even think clearly with that inhuman stare fixed on us. Every instinct I had was screaming at me to run, to grab Hazel and get as far away from this thing as possible, but she couldn't run, and I wouldn't leave her. The three of us stayed frozen like that for what felt like hours, but was probably only seconds. Me kneeling beside Hazel, supporting her weight. Her trembling and trying not to look behind her, and that thing just watching us with those unblinking eyes while his head jerked and twitched in patterns that hurt to look at. I kept waiting for him to move toward us, to make some sound, to do something that would force me to act. But he just stood there, swaying slightly. His massive frame perfectly balanced despite the violent head movements. I could hear Hazel's breathing getting more and more panicked, could feel her shaking getting worse as the seconds dragged on. Then, without any warning at all, the figure suddenly bolted away into the dense forest, moving with that same impossible speed we'd witnessed earlier. His long limbs carrying him between the trees with fluid grace that defied everything I knew about human movement, leaving Hazel and me alone in the eerie silence. I helped Hazel to her feet, wrapping my arm around her waist to take weight off her injured ankle. She leaned against me heavily, her breathing still shaky from the encounter. \"Can you walk?\" I asked, though I already knew the answer from how she favored her left leg. \"I think so, with help.\" We started moving forward on the trail, Hazel's steps careful and uneven. Every few seconds, I found myself turning to scan the forest behind us, expecting to see that impossibly tall figure watching from between the trees. The silence felt different now. Not just the absence of normal forest sounds, but something deeper, like the woods themselves were holding their breath. After about 10 minutes of slow progress, I heard voices ahead. Eddie's voice cut through the trees, calling Hazel's name with obvious worry. Then Nicole's higher pitch joining in. Relief flooded through me as we rounded a bend and saw the rest of the group clustered together on the trail, all five of them turning toward us with expressions of concern and fear. \"Mom.\" Nicole rushed forward, her camera bouncing against her chest. \"We heard you scream and then...\" \"I'm okay,\" Hazel said quickly, though her grip on my arm tightened. \"Just twisted my ankle.\" Eddie moved to Hazel's other side, taking some of her weight from me. His wire-rimmed glasses had slipped down his nose, and sweat beaded on his forehead despite the cool air. \"What happened back there? We kept running, and then realized you two weren't with us.\" I caught Robert's eye. The older man stood with his back to a large pine, positioned so he could see both directions on the trail. His military bearing was more pronounced now, shoulders set and hands loose at his sides. He knew something was seriously wrong, even if he didn't understand what. \"We need to keep moving,\" I said, instead of answering Eddie's question. \"Hazel can walk, but we need to take it slow.\" Derek stepped forward, his expensive gear looking somehow less impressive now. \"Should we call for help? I've got a satellite communicator.\" \"The ranger station isn't far,\" I cut him off. \"We'll get Hazel looked at there.\" That wasn't entirely true. We still had three hours of hiking ahead of us, but I didn't want to explain why I thought staying put while waiting for rescue might be a bad idea. The image of those unblinking eyes and that mechanical head movement kept replaying in my mind. Whatever that thing was, it had shown interest in us. I didn't want to give it time to come back. Deborah had positioned herself close to Derek, her earlier confidence completely gone. She kept looking over her shoulder, her camera equipment forgotten. \"Dean, what was that sound we heard? That screaming?\" I helped adjust Hazel's position so Eddie could support more of her weight. \"Wildlife. Sometimes they make sounds you wouldn't expect.\" The lie came easily, but I could see from Robert's expression that he wasn't buying it. Neither was Eddie for that matter, but they didn't push, maybe sensing that whatever the truth was, they didn't really want to hear it while we were still out here. We started moving again, our pace much slower now with Hazel's injury. I took point this time, constantly scanning ahead and listening for any sound that didn't belong. Behind me, I could hear the group's nervous chatter. Nicole asking her mother if she needed to rest, Derek quietly discussing evacuation procedures with Deborah, Eddie trying to reassure everyone that we'd be fine. But it was Robert's silence that bothered me most. He walked at the rear of the group now, and every time I glanced back, I saw him checking our trail behind us. He'd seen enough combat to recognize when a situation had gone sideways, even if he didn't understand the specifics. The next two hours passed with agonizing slowness.Every snapping branch made my heart rate spike. Every shadow between the trees looked like it might be hiding something watching us, but nothing happened. No sounds of pursuit, no glimpses of impossible movement through the forest, just the normal progression of afternoon light filtering through the canopy and the steady rhythm of our footsteps on the trail. By the time we reached the parking area, I felt like I'd been holding my breath for hours. The sight of our vehicles and the ranger station building beyond felt like stepping back into the real world after spending time somewhere the normal rules didn't apply. I helped Hazel into Eddie's car while Nicole fussed over her mother's ankle. The rest of the group gathered their gear with obvious relief, but I could see the questions in their eyes. They knew something had happened out there, something I wasn't telling them. \"I need to file a report,\" I told Eddie through his car window. \"Standard procedure for any injury on a guided trip. You should probably take Hazel to the clinic in town, get that ankle X-rayed.\" Eddie nodded, but his expression was troubled. \"Dean, what really happened back there?\" I met his eyes through the glass. Part of me wanted to tell him everything, the figure in the meadow, the impossible movements, those alien eyes staring at us with cold intelligence. But what would be the point? They were safe now, heading back to their normal lives. Better to let them think it was just an unfortunate hiking accident. \"Sometimes things go wrong in the wilderness,\" I said. \"That's why we have procedures.\" It wasn't an answer, and we both knew it, but Eddie didn't press. He started the engine and pulled out of the parking area, Hazel and Nicole waving from the passenger seats. The others followed in their rental car, Derek driving while Deborah and Robert sat in tense silence. I watched their taillights disappear down the access road before turning toward the ranger station. The building looked exactly the same as always, log construction with green metal roof, official park service signs, radio antenna sprouting from one corner. But after what I'd seen in the forest, even this familiar place felt different somehow. Station Chief Joseph Navarro looked up from his desk when I walked in, his weathered face creasing with mild surprise. \"Dean, didn't expect to see you back so soon. How'd the overnight trip go?\" I sat down in the chair across from his desk, suddenly feeling exhausted. \"We had an incident. I need to file a report.\" Joseph's expression shifted to professional concern. He pulled out a standard incident form and clicked his pen. \"What kind of incident?\" I stared at the blank form for a moment, trying to figure out how to put what I'd witnessed into official language. How do you report something that shouldn't exist? \"We encountered a man in the wilderness,\" I began slowly, \"approximately 60 meters from Lookout Point down in the meadow. He was wearing a high visibility jacket, orange and yellow.\" Joseph started writing. \"Injured hiker?\" \"No.\" I paused, choosing my words carefully. \"His behavior was unusual, erratic movements like he might be under the influence of something or experiencing a medical emergency. He appeared to be alone and didn't respond to visual contact.\" \"Did you attempt to make contact?\" \"Negative. I had six clients with me, including a minor. When the individual's behavior became more concerning, I made the decision to evacuate the group.\" Joseph looked up from his writing. \"More concerning how?\" I thought about those impossible joint movements, the mechanical precision of that head turn, the way he'd moved through the forest without making a sound. \"The movements became increasingly erratic and unnatural. I assessed the situation as potentially dangerous and prioritized client safety.\" \"Good call.\" Joseph continued writing. \"Any idea who this individual might be? We haven't had any reports of missing hikers in that area.\" \"Unknown. He was tall, maybe seven feet, with disproportionately long limbs. The high-vis jacket suggests he might be involved in forestry or construction work, but I'm not aware of any active projects in that sector.\" Joseph's pen stopped moving. \"Seven feet? You sure about that height estimate?\" \"Affirmative. When he stood up, the height was clearly abnormal.\" \"Stood up from what?\" \"He was sitting in the meadow when I first spotted him, completely motionless for several minutes, then began swaying movements that escalated to more violent gestures.\" Joseph finished writing and looked up at me. His hazel eyes held the kind of concern that comes from 25 years of dealing with wilderness emergencies. \"This individual followed your group?\" I nodded. \"We observed him on our trail approximately two hours after leaving Lookout Point, maintained distance, but appeared to be tracking our movement.\" \"Jesus.\" Joseph leaned back in his chair. \"Any injuries to your clients?\" \"One sprained ankle during evacuation, Hazel Cruz. Non-serious, but she'll need medical attention.\" \"I'll need their contact information for follow-up.\" Joseph set down his pen and reached for his radio. \"Summer, you copy?\" Ranger Summer Buck's voice crackled through the speaker. \"Copy, Chief.\"\"Need you in the office. We've got a situation.\" Within minutes, Summer walked through the door. Her auburn hair pulled back in its usual practical bun and her uniform crisp despite the late hour. She'd been with the Park Service for eight years, most of that time in search and rescue operations. If anyone could organize a proper response to this, it was her. Joseph handed her my report. \"Dean encountered an individual exhibiting concerning behavior in the Lookout Point area. Possible mental health crisis or substance abuse situation. We need a search team.\" Summer read through the report quickly. Her green eyes scanning the details with professional efficiency. \"Seven feet tall? That's unusual.\" \"That's what Dean reported.\" Summer looked at me directly. \"You're certain about these physical descriptions? The height? The movements?\" I met her stare. \"I observed this individual for an extended period through binoculars. The physical characteristics are accurate.\" She nodded slowly. \"I'll coordinate with the county sheriff's office and get a team together. If someone's out there in crisis, we need to find them before dark.\" I watched Summer work her radio coordinating with various agencies and calling in off-duty personnel. Within an hour, she had assembled a search team of 12 people, including rangers, sheriff's deputies, and volunteer search and rescue members. They planned to start at Lookout Point and work outward in a grid pattern with helicopter support arriving in the morning. \"You wanna guide the team back to the location?\" Summer asked me as the searchers gathered their gear. I thought about those unblinking eyes, the way that head had turned with mechanical precision to stare directly at me across hundreds of meters of valley. \"Yeah. I'll take them there.\" The hike back to Lookout Point felt different with 12 armed and trained personnel behind me instead of six nervous tourists. But as we approached the meadow where I first spotted the figure, my heart rate still increased. I found myself scanning the tree line, looking for any sign of movement or that telltale flash of high visibility fabric. The meadow was empty. We spent the rest of the daylight hours combing through the area where I'd seen the figure sitting, then expanded to search the forest where he disappeared after the encounter with Hazel and me. The search team was thorough and professional, documenting everything and calling out regularly in case the individual was hiding or injured. Nothing. No footprints, no disturbed vegetation. No pieces of clothing caught on branches. It was like the figure had never existed. \"Ground's pretty hard here,\" one of the deputies observed, crouched next to where I'd seen the figure sitting. \"Wouldn't hold prints well.\" Summer examined the area with equal care. Her trained eyes looking for any sign of human passage. \"Could have moved through on the rock outcroppings. Avoided leaving tracks.\" They were trying to make sense of the lack of evidence, but I could see the puzzlement in their faces. A seven-foot-tall man in a bright jacket should have left some trace of his presence, especially if he'd been sitting in one spot for an extended period and then moving rapidly through dense forest. The helicopter arrived the next morning. A county sheriff's aircraft with thermal imaging equipment. I watched from the ranger station as it made systematic passes over the entire area, covering not just where we'd searched on foot, but expanding to several square kilometers of wilderness. Nothing. Summer updated me regularly over the next three days as the search continued. Additional ground teams, expanded helicopter coverage, interviews with other hikers who'd been in the area. They even brought in tracking dogs, though the scent trail went cold after just a few hundred meters. On the fourth day, Summer stopped by my office with the final report. Her expression was professionally neutral, but I could see the frustration underneath. \"We're calling off the active search,\" she said, settling into the chair across from my desk. \"We've covered over 20 square kilometers with no sign of your individual.\" I looked at the thick folder of search documentation she'd placed on my desk. \"Nothing at all?\" \"Few pieces of litter, some old camp sites, normal wildlife sign. But no evidence of a seven-foot-tall man in a high-vis jacket.\" Summer paused. \"Dean, is there anything else about this encounter you think might be relevant?\" I met her eyes, seeing the unasked question there. She was wondering if I'd made a mistake. If the stress of the situation had caused me to misperceive what I'd seen. It was a reasonable question from a professional standpoint. \"The physical description is accurate,\" I said. \"Height, clothing, behavior patterns. I observed this individual for an extended period under good lighting conditions.\" Summer nodded slowly. \"I believe you saw something. But whatever it was, it's not out there now.\" After she left, I sat alone in my office staring at the search report. 23 trained personnel. Three days of intensive searching. Helicopter support with thermal imaging. No trace found of something I'd watched for hours and that had followed my group for several kilometers. I found myself replaying every detail of the encounter, examining my memories for any sign that I'd misunderstood what I was seeing. The figure in the meadow swaying with movements that push the boundaries of human flexibility. Those arms and legs bending at impossible angles as it pursued us through the forest. The mechanical precision of that head turn. Those unblinking eyes reflecting light with an intensity that seemed alien.... and the complete silence of its movement through the forest, appearing behind us without making a sound despite its size and speed. The rational part of my mind kept trying to find explanations. Maybe someone on stilts, though that wouldn't account for the joint movements. Maybe someone with a rare medical condition affecting height and flexibility, though that wouldn't explain the pursuit behavior or the lack of any physical trace. But the deeper I thought about it, the more I kept coming back to one inescapable conclusion. I hadn't encountered a person in the wilderness. I'd encountered something else entirely, something that could appear human from a distance but moved and behaved according to different rules. The lack of any physical evidence wasn't proof that I'd imagined it. It was proof that whatever I'd seen didn't leave the kind of traces a normal person would leave. Three weeks later, I was still thinking about those eyes, still waking up sometimes with the memory of that mechanical head movement, the way it had turned to stare directly at me with cold intelligence that felt completely alien, still wondering what would've happened if I hadn't moved the group away from Lookout Point, if we'd stayed longer or tried to make contact. Most of all, I kept wondering if it was still out there somewhere, watching other hikers with those unblinking eyes, studying them the way it had studied us. I couldn't stop thinking about it. Every night for the past week, I'd lie in bed running through what I'd seen, trying to make sense of movements that defied basic anatomy, trying to rationalize eyes that had stared back at me with something that felt ancient and calculating. The official search had turned up nothing. Twenty-three people, helicopter support, tracking dogs, all of it adding up to a big fat zero in the evidence column. But I knew what I'd seen. That's what drove me back out here on my day off, hiking the same trail with just my day pack and a thermos of coffee that had gone cold an hour ago. I told myself I was being logical about this, professional. Maybe there was something the search teams had missed, some detail that would make sense of the whole thing. Maybe I could find tracks they'd overlooked or fabric caught on a branch or any physical proof that would validate what had happened to my group. The truth was simpler and more unsettling. I needed to know if it was still out there. The trail felt different without six nervous clients behind me. Quieter, but not in the unnatural way it had been that day. Birds called from the canopy, leaves rustled in the breeze, and my boots found their familiar rhythm on the packed dirt. Normal forest sounds that should've been reassuring, but somehow made me more aware of how alone I was out here. I'd been hiking for two hours when I reached the turnoff for Lookout Point. My feet stopped without any conscious decision, and I found myself staring up the side trail where this whole mess had started. Part of me wanted to climb back up there, to stand at that overlook and see if anything had changed. But the larger part of me, the part that had been having nightmares about mechanical head movements and impossible joint angles, wanted to get to the meadow and get this over with. The meadow where I'd first spotted the figure was another 20 minutes down the main trail. I'd studied the search reports enough times to have the layout memorized. The teams had been thorough, dividing the area into grid sections and documenting every square meter. They'd found deer tracks, old campfire remains from other hikers, and a few pieces of litter that had been properly cataloged and removed. Nothing that suggested a seven-foot man in a high-visibility jacket had ever been there, but I knew better. The trees began to thin as I approached the clearing and my pulse picked up despite my efforts to stay calm. I'd been telling myself this was just due diligence, a professional follow-up to an unusual incident. Now, with the meadow just ahead, I had to admit I was scared. Not of finding nothing, of finding something. I pushed through the last line of trees and stepped into the open space where the figure had been sitting. The meadow looked exactly as I remembered it. Roughly circular, maybe 60 meters across, with knee-high grass and wildflowers scattered throughout. The search teams had trampled most of the vegetation, leaving obvious boot prints and disturbed soil where they'd conducted their systematic sweep. I walked to the center of the clearing, trying to pinpoint where the figure had been positioned when I'd first spotted it through my binoculars. The afternoon light hit the grass at roughly the same angle as it had a week ago, and I could picture that rigid, unnatural posture perfectly. \"Right about here,\" I thought, stopping next to a cluster of purple wildflowers that had been flattened by the search. That's when I saw it. My heart slammed against my ribs so hard I actually took a step backward. 20 meters away, hanging from a pine branch at exactly eye level was the bright orange and yellow high-visibility jacket. I stood frozen, staring at the thing I'd been looking for without really believing I'd find it. The jacket hung motionless in the still air, its reflective stripes catching the filtered sunlight. It looked fresh, clean, like it had just been placed there, like someone had hung it up carefully and walked away, like someone had left it there for me to find. My hands were shaking as I approached the tree. Each step felt deliberate and wrong, like I was walking into a trap I couldn't see. But I had to know,I had to touch it to prove to myself it was real and not some stress-induced hallucination brought on by a week of broken sleep and unanswered questions. The jacket was positioned perfectly, not caught on the branch by accident, not blown there by wind, hung there. The sleeves were spread wide, the zipper facing outward, the collar positioned so the size tag was visible. Someone had taken time to arrange it properly to make sure it would be seen by anyone entering the meadow from the trail, my trail, the same path my group had used. I reached out with one trembling hand and touched the fabric. It was real, solid. The material felt exactly like what you'd expect from a safety jacket, thick polyester with a slight roughness to it. No tears, no dirt, no signs of weather damage despite hanging outdoors for a week. The reflective stripes were bright and clean, the orange color still vivid. I lifted the jacket off the branch and held it up, checking for any identifying marks. No company logos, no name tags, no patches that might indicate where it had come from. Just a standard high-visibility jacket in size extra large, the kind worn by construction workers and road crews, the kind worn by someone who wanted to be seen. But as I examined it more closely, details began to register that made my skin crawl. The sleeves were wrong, too long for a normal human arm span, extending well past where wrists should be. The torso was stretched, designed for someone much taller than average. And when I held it up against my own body, the proportions became even more disturbing. This jacket had been made for someone with the exact dimensions I'd observe, this jacket had been made for someone with the exact dimensions I'd observed through my binoculars. 7 feet tall with arms that hung too long and a frame that bent in ways human bones shouldn't allow. I dropped the jacket like it had burned me, watching it fall to the grass in a bright orange heap. My breath came in short, sharp bursts as I backed away from the tree. My eyes scanning the treeline for any sign of movement. The meadow felt exposed now, like I was standing in the middle of a target with nowhere to hide. The placement was too deliberate to ignore. This wasn't some random piece of clothing that had blown in from a nearby trail. Someone had walked into this meadow, selected this specific tree, and hung the jacket at precisely the right height for me to notice. They'd known I would come back. They'd been counting on it. I pulled out my phone and took pictures of the jacket where it lay, then of the branch where it had been hanging. The camera felt inadequate for what I was trying to document, but I needed some kind of record, evidence that this time, I hadn't imagined what I'd found. As I crouched to examine the ground around the tree, I noticed something else that made my stomach twist. The grass directly beneath the branch was pressed down in a perfect circle, as if something heavy had been standing there for an extended period. The depression was too large for human feet, and the edges were too clean, too uniform. Whatever had made this mark had stood motionless in one spot long enough to compress the soil, waiting. I straightened up and looked back at the jacket lying in the grass. The bright colors seemed almost mocking now, a cheerful beacon in the middle of something I didn't understand. Part of me wanted to leave it there, to back away from this meadow and pretend I'd never found it, but I knew I couldn't do that. This was evidence, proof that what I'd seen was real. I picked up the jacket again, forcing myself to examine it more thoroughly despite the way it made my hands shake. The fabric was completely dry, with no morning dew or moisture that should've accumulated from hanging outside overnight. The interior lining was pristine, showing no signs of wear or use. It looked brand new, like it had never been worn. But that was impossible. I'd seen this jacket on the figure in the meadow, watched it move with those impossible contortions and fluid grace. This was the same jacket, I was certain of it. The colors matched perfectly. The reflective pattern was identical. So how could it look unused? I folded the jacket carefully and tucked it under my arm, my decision made. Whatever was happening here, I wasn't going to solve it by standing in an empty meadow asking questions that had no rational answers. I needed to get back to the station, document what I'd found, and figure out my next move. But as I turned to leave, I caught sight of something that stopped me cold. On the far side of the meadow, barely visible through the afternoon shadows, another tree had something hanging from its branches, something dark and shapeless that I hadn't noticed before. My legs moved without conscious thought, carrying me across the clearing toward this new discovery. As I got closer, the object resolved into focus, and I felt the last of my rational explanations crumble away. It was my own jacket, the dark green ranger jacket I'd been wearing the day we'd encountered the figure, the jacket I'd left hanging in my closet at home this morning. I reached the tree with my heart hammering so hard I could hear it in my ears. The jacket hung at the same precise height as the high-visibility one had, positioned with the same deliberate care. The Forest Service patches were clearly visible, my name tag still pinned to the chest pocket.... I touched the fabric with numb fingers, feeling the familiar weight and texture of the jacket I'd worn on hundreds of hikes. It was real, solid, exactly as I remembered it, but it was supposed to be hanging in my bedroom closet 40 minutes away by car. I pulled out my phone and called my own landline, listening to it ring four times before my answering machine picked up. The sound of my own voice felt surreal in the empty meadow, but I forced myself to speak. \"This is Dean. I need you to do me a favor and check my bedroom closet. Look for my spare Ranger jacket, the one with the small tear on the left elbow. Call me back and tell me if it's there.\" I hung up, and immediately felt foolish. I lived alone. There was no one to check my closet, no one to confirm what I already knew. The jacket hanging from this tree was impossible, but it was also undeniably real. I stood in the center of the meadow, holding two jackets that shouldn't exist in this place, surrounded by evidence that someone or something had been watching me closely enough to know exactly what would get my attention. The bright orange fabric felt heavy in my hands, while my own jacket hung motionless from the pine branch like an accusation. Whatever I'd encountered the week before, it knew who I was, it knew where I lived, what I wore, how I would react, and it had brought me back here for a reason I was only beginning to understand. I stood there gripping the orange jacket, my fingers working the synthetic fabric while my mind tried to process what I was looking at. The thing hanging from the pine branch wasn't just my jacket. It was positioned exactly like the high-visibility one had been. Same height, same deliberate spread of the sleeves, same careful attention to how it faced outward. Someone or something had taken the time to make this display perfect. My hands started shaking. Not from cold, but from the slow realization that this wasn't random. The figure I'd seen through my binoculars hadn't just wandered into that meadow by accident. It had known I was watching, known I would come back, known exactly how to get my attention. I pulled out my phone and took another photo of my Ranger jacket hanging there, then forced myself to walk closer. The name tag caught the afternoon light, Tran in white letters on the dark green fabric. Below it, the Forest Service patch with its distinctive shield design. This was definitely mine. I could see a small coffee stain near the left pocket from last Tuesday when I'd spilled my morning cup while reviewing trail reports. But I'd left this jacket in my closet this morning, I was sure of it. I remembered seeing it hanging there when I grabbed my day pack, remembered thinking I wouldn't need it for a short hike in decent weather. Yet here it was, displayed like some kind of trophy or message. I reached up and pulled it down from the branch. The fabric felt normal, slightly wrinkled from hanging, but otherwise exactly as it should be. No tears, no strange odors, nothing to suggest it had been dragged through the forest or handled roughly. Whoever had placed it here had been careful with it. That thought made my stomach clench. Careful, deliberate, purposeful. I turned in a slow circle, scanning the entire meadow again. The searchers had been thorough, 23 people with dogs and helicopter support. They'd found nothing. Yet somehow, between their systematic grid search and my return today, someone had been here. Someone had hung these jackets like calling cards, positioned them where I couldn't miss them. The silence in the meadow felt different now. Not peaceful, but watchful, like the trees themselves were holding their breath, waiting to see what I do next. I found myself checking the shadows between the pines, looking for any hint of movement or unnatural stillness. Nothing, just afternoon light filtering through branches and the gentle sway of grass in the breeze. I folded my Ranger jacket and tucked it under my arm with the orange one. Two jackets that shouldn't exist in this place, but here they were, physical proof that something had been watching me, studying me, learning enough about my habits and belongings to orchestrate this entire scenario. The figure in the meadow hadn't been having a medical emergency or substance-induced episode. It had been performing, putting on a show designed specifically for me, knowing I'd spot it through my binoculars from the overlook, knowing I'd bring my group down from that rocky outcrop, knowing I'd eventually come back alone to investigate. I thought about the way it had turned to look directly at me across the valley, despite the distance. The mechanical precision of that movement, the unblinking stare that had felt like recognition rather than surprise. It had been waiting for me to notice it watching. My radio crackled with static, and I nearly jumped out of my skin. Just interference from the distance to the repeater towers, but the sudden noise in the quiet meadow sent my heart racing. I clipped it back to my belt and tried to steady my breathing. Joseph needed to see these jackets. Whatever we were dealing with, it wasn't going away. The search teams might not have found footprints or disturbed vegetation, but they hadn't found these either. Someone or something was still out here, still active, still focused on making contact. I took one more look around the clearing, memorizing the positions where both jackets had hung. The pine trees stood like silent witnesses,... their branches now empty, but somehow still pointing accusingly at the spots where the fabric had been displayed. The circular depression in the grass remained visible near the base of the first tree. That perfect, unnatural mark where something had stood motionless for who knew how long. The weight of being watched pressed against my shoulders, not the feeling of eyes on me right now, but the knowledge that I had been observed closely enough for someone to know my routines, my clothing, my reactions. The figure had studied me like a specimen, learning what would bring me back to this place. I started walking toward the trail, both jackets bundled under my arm. Each step felt deliberate, like I was following a script someone else had written. Come to the meadow, find the first jacket, discover the second, take them both, leave with more questions than answers. But what choice did I have? The alternative was pretending this hadn't happened, leaving the evidence hanging in the trees for the next hiker to stumble across. Or worse, for it to disappear as mysteriously as it had appeared, leaving me with nothing but my own memories and the growing certainty that I was losing my grip on reality. The forest felt normal again once I reached the main trail. Birds called from the canopy and squirrels rustled through the underbrush. The oppressive silence that had blanketed the meadow didn't extend here, but I couldn't shake the feeling that I was still being observed, still part of someone else's carefully orchestrated plan. I picked up my pace, eager to put distance between myself and that clearing. The jackets felt heavier with each step, weighted down by implications I didn't want to consider. Someone had been in my home or had access to my belongings. Someone knew my schedule well enough to predict when I'd return to investigate. Someone wanted me to understand that our encounter had been intentional from the very beginning. The trail curved through familiar terrain, past the spot where Hazel had twisted her ankle, past the bend where we'd heard that inhuman scream echoing across the valley. Everything looked exactly as it should, just another section of wilderness trail marked by boot prints and the occasional piece of litter, but I couldn't see it the same way anymore. This wasn't my territory. I'd been kidding myself thinking I knew these woods, thinking my decade of guiding experience meant anything here. Someone else had claimed this place, marked it, turned it into a stage for whatever performance they were conducting. I was just another actor following the script they'd written. The parking area came into view after an hour of steady hiking. My truck sat alone under the pine trees, exactly where I'd left it. No other vehicles, no signs that anyone else had been here. I pulled out my keys and loaded the jackets into the passenger seat, handling them like evidence at a crime scene, which I realized they probably were. Evidence of something, anyway. Stalking, maybe, or harassment. Breaking and entering if someone had actually been in my house. The local sheriff would want to know about this, even if they couldn't explain it any better than I could. I started the engine and pulled out onto the access road, watching the trailhead disappear in my rear-view mirror. The radio would work once I got closer to town, and I could call ahead to make sure Joseph was still at the station. This couldn't wait until tomorrow or next week. Whatever was happening in those woods, it was escalating. The orange jacket caught my eye as I drove, its bright fabric almost glowing in the afternoon sunlight streaming through the windshield. Size, extra large, proportioned for someone much taller than normal with sleeves that would hang past my fingertips and a torso stretched for an impossibly long frame. Physical evidence that the seven-foot figure I described to the search teams was real. But evidence of what exactly? I still didn't have an answer for that. Just two jackets that shouldn't exist in this place, surrounded by evidence that someone or something had been watching me closely enough to know exactly what would get my attention. The bright orange fabric felt heavy in my hands, while my own jacket hung motionless from the pine branch like an accusation. Whatever I'd encountered the week before, it knew who I was. It knew where I lived, what I wore, how I would react. And it had brought me back here for a reason I was only beginning to understand."
}