{
  "title": "I Moved Into a House in Japan. Something is Living Under the Floorboards.",
  "upload_date": "",
  "duration_sec": 3829.0,
  "segments": [],
  "full_text": "The thick envelope from Japan sat on my coffee table for three days before I finally worked up the courage to open it. Something about the formal Japanese and English lettering, the red stamp marks and the weight of it filled me with a sense of dread I couldn't shake. When I finally tore it open, the contents confirmed what I'd been avoiding. Uncle Jeff was gone, and somehow I was his heir. I spread the documents across my table, squinting at the legal language. Property deeds, transfer forms, tax documents, all for a house in rural Gifu Prefecture that I'd never even heard of. The last page bore an official seal from the Japanese government confirming that the property now belonged to me, Marshall Walker. 15 years, that's how long it had been since I'd spoken to Jeff. Our last conversation played in my mind like it was yesterday, his voice rising to a shout in my apartment as I packed for my flight to Tokyo. \"You're making a mistake,\" he'd said, his face flushed with anger. \"This job isn't worth leaving everything behind.\" \"It's my career,\" I'd fired back. \"Just because you never left the country until you retired doesn't mean I have to wait.\" \"That's not what this is about, and you know it.\" The argument had escalated from there, with words we couldn't take back. I'd accused him of jealousy. He'd called me arrogant and naive. When he stormed out, slamming my door hard enough to shake the walls, I figured that was it. No Christmas cards, no birthday calls, nothing for 15 years. And now according to these papers, he'd left me a house. My phone rang, jolting me from the memory. The caller ID showed an unfamiliar international number. \"Hello?\" I answered. \"Mr. Walker? Marshall Walker?\" The voice was male, Japanese accented, but with excellent English. \"Speaking.\" \"My name is Levi Ferguson. I'm the attorney handling your uncle's estate in Japan. I trust you've received the documentation I sent.\" I glanced at the papers spread across my table. \"Yes, just looking at them now. I don't understand why my uncle would leave me anything. We weren't exactly close.\" There was a pause on the line. \"Mr. Walker, I should inform you that your uncle has been reported missing for several months. The local authorities conducted searches, but...\" He trailed off. \"Missing?\" My stomach tightened. \"Not dead?\" \"Legally, no. But given the circumstances and the length of time, the courts have allowed the execution of his will. Your uncle was quite specific that the property should pass to you in the event of his absence.\" I ran a hand through my hair. \"This doesn't make any sense.\" We hadn't spoken in 15 years. \"I understand this must be confusing,\" Ferguson said. \"Your uncle purchased this property about 20 years ago. He moved there permanently after retiring from his position in Tokyo.\" \"And no one knows what happened to him?\" \"The police investigation is ongoing. I'm afraid I don't have further details. The property, however, is now legally yours to do with as you wish. If you'd like to sell, I can arrange...\" \"I need to see it,\" I interrupted, surprising myself with the certainty in my voice. \"I beg your pardon?\" \"The house, I need to see it for myself.\" Ferguson cleared his throat. \"Of course. The property is located in a rather remote area of Gifu Prefecture. I can arrange for someone to meet you there if...\" \"Just give me the address. I'll find it.\" After getting the details and ending the call, I sat staring at the address I'd written down. Why would Jeff leave me a house after all this time? What happened to him? The question circled in my mind, demanding answers I couldn't find in the legal documents. Two days later, I was behind the wheel of a rental car, following the GPS voice as it guided me away from the main highways and onto increasingly narrow mountain roads. The scenery grew more rural with each passing mile, rice fields giving way to dense forests, small villages becoming more sparse. The road wound higher into the mountains, barely wide enough for two cars to pass. After almost three hours of driving, the GPS announced I was approaching my destination. The paved road gave way to gravel, which crunched under the tires as I navigated the final stretch. The trees opened up to reveal a clearing, and there it was. The house stood alone at the end of the gravel path, a traditional Japanese home with dark wooden beams and paper screens, much larger than I'd expected. Time hadn't been kind to it. The once elegant roof sagged in places, several tiles missing or broken. The wooden exterior had weathered to a silvery gray. And what must've once been a garden was now an overgrown tangle of vegetation creeping toward the house like slow-moving fingers. I parked the car and turned off the engine, expecting to hear the usual sounds of the countryside. Birds, insects, wind in the trees. Instead, I was met with nothing. The silence hit me like a physical force, unnatural and absolute. No chirping birds, no buzzing insects, not even the whisper of breeze through the leaves. I stepped out of the car, and the sound of my door closing seemed to hang in the air, offensive against the backdrop of perfect quiet.I stood still, listening harder, convinced I must be missing something. But the silence remained, thick and oppressive, as if the property existed in its own bubble, cut off from the natural world. The hair on my arms stood up despite the warm summer air. I'd spent enough time in rural Japan to know this wasn't normal. Even the most remote locations had their ambient sounds, the constant background music of the natural world. I took a deep breath and started toward the house, gravel crunching loudly under my feet. Up close, the property looked even more neglected. Weeds pushed up through the wooden steps leading to the front door. A small stone lantern lay toppled on its side near what might have once been a pond, now just a depression filled with leaves and debris. The front door was a traditional sliding wooden panel. I hesitated before reaching out to touch it, half expecting it to be locked. To my surprise, it slid open with little resistance, the track surprisingly well-oiled despite the general state of disrepair. As I stood on the threshold peering into the dimness beyond, that unnatural silence seemed to deepen, as if the house itself were holding its breath, waiting for me to enter. I slid the door open and stepped across the threshold. The smell hit me immediately, a heavy mix of mildew and something else I couldn't place, something rotten and metallic that made my stomach turn. \"Uncle Jeff?\" I called out, my voice falling flat in the silence. The entryway opened to a main living area that looked like a war zone. Furniture lay overturned, a low table on its side, cushions torn open with stuffing scattered across the floor. Papers were strewn everywhere, some crumpled, others spread out like someone had been searching frantically for something. My eyes fixed on dark rust-colored stains splattered across the tatami mats. They looked disturbingly like dried blood. I took a few careful steps into the room, the floorboards creaking under my weight. A gust of wind blew through from my right, and I turned to see a large window facing the garden had been completely shattered. Glass fragments littered the floor inside. Not outside. Whatever broke it had done so from within the house. \"What the hell happened here?\" I whispered to myself, the words hanging in the dead air. I moved deeper into the house, stepping around the debris. The hallway connecting to other rooms bore more signs of violence. Deep scratches ran along the wooden walls, splintering the surface in long, jagged lines. They were too large to be from a knife, more like someone had taken a garden tool or something with multiple points and dragged it forcefully across the wood. A chair lay broken against the wall, one leg completely snapped off. In another room, what looked like a study, bookshelves had been emptied, their contents dumped across the floor. More of those dark stains marked the wooden floor here. The kitchen was at the back of the house, a small space with traditional elements mixed with modern appliances that looked at least a decade old. Unlike the rest of the house, this room seemed relatively untouched by whatever violence had swept through. The counters were dusty but organized, dishes stacked neatly in a drying rack. On the small kitchen table sat a letter, placed carefully in the center as if meant to be found. I picked it up, my name written across the envelope in handwriting I recognized even after 15 years. Uncle Jeff's distinctive scrawl, all capital letters with sharp angles. I tore it open and unfolded the single sheet inside. The letter was dated exactly three months earlier. \"Marshall,\" it began without any greeting. \"If you're reading this, I'm likely gone. I've arranged for the house to pass to you if anything happens to me. I need someone who might understand to know what I've found here.\" I frowned, scanning down the page. \"Do not stay in this house overnight. I made that mistake. The woman and child won't let you go if you stay after dark. They're in the walls, under the floor. I've tried to contain them, but they're getting stronger.\" The letter continued in increasingly erratic handwriting. \"There's something about our family history I never told you. Your grandmother didn't die of natural causes like everyone said. What happened to her is happening again here. I thought I could end it, but I was wrong. Get out before sunset. Burn this place if you can.\" It ended abruptly without a signature. I put the letter down, a chill running through me despite the warm air. I looked around the kitchen again, trying to make sense of it. My uncle had always been eccentric, but this was different. This sounded like the ravings of someone who'd lost touch with reality. I pulled out my phone and dialed Detective Bell's number. He'd been handling the missing persons case, according to Levi Ferguson. The call went straight to voicemail. \"Detective Bell, this is Marshall Walker, Jeff Walker's nephew,\" I said after the beep. \"I'm at my uncle's house in Gifu Prefecture. There's evidence of some kind of struggle here. Possible bloodstains. The place is trashed. I found a letter that's concerning. Call me back when you get this.\" I hung up and checked the time, almost 6:00 in the evening. The sun would be setting soon. I walked back to the main room and looked out through the broken window at the overgrown garden.The shadows were already lengthening, darkness gathering between the trees surrounding the property. The rational part of my brain, the engineer in me, said I should leave. Find somewhere in town to stay for the night and come back with the police tomorrow. But another part of me, the part that remembered the 15 years of silence between us wanted answers. What had happened to Uncle Jeff? What was this family history he mentioned? And why had he moved to this isolated place after telling me Japan would swallow me whole? I looked down at my watch, then back at the letter on the kitchen table. The warning about staying after dark seemed absurd. Ghosts and spirits weren't real. Whatever had happened here had a rational explanation. My uncle had clearly been disturbed, perhaps suffering from paranoid delusions. I walked back to my car and retrieved my overnight bag. I'd planned to stay at a hotel, but the nearest one was at least 30 minutes back down the mountain. I had a flashlight, my phone, and enough supplies to make it through one night. As the first hints of sunset colored the sky, I made my decision. I would stay. Whatever had happened to Uncle Jeff, I was determined to understand it. I wouldn't let some superstitious warning in a letter drive me away. I cleared a small area in the main room, pushing aside the overturned furniture and scattered papers. The tatami mats felt gritty under my hands as I swept away broken glass and debris. The dark stains I'd noticed earlier, the ones that looked disturbingly like dried blood, I covered with a corner of the sleeping bag. No sense sleeping directly on top of that, even if it was just some old spill. \"This is ridiculous,\" I muttered to myself, my voice sounding flat in the strange acoustics of the house. I unrolled my sleeping bag in the cleanest spot I could find, smoothing it out and placing my backpack at the head as a makeshift pillow. The broken window worried me, not just for security reasons, but because the weather report had mentioned possible rain. I rummaged through the kitchen until I found a stack of flattened cardboard boxes, probably leftover from when Jeff moved in. I tore one down to size and wedged it into the window frame, using packing tape from my car to secure it in place. The cardboard wouldn't keep out determined intruders, but it would block the elements. As I worked, the last light of day faded. I hadn't bothered to check if the electricity was still connected. The state of the house suggested it wasn't, so I set up my camping lantern in the center of the room. Its glow created a small circle of light that barely reached the walls, leaving the corners in shadow. I checked my watch. 8:30. Too early to sleep, but there wasn't much else to do. I sat cross-legged on my sleeping bag and pulled out Jeff's letter again, reading it for the third time. The warning seemed more ominous now in the dim light. Darkness in family history. The woman and child won't let you go after dark. I folded the letter and put it away. Jeff had always been dramatic, even before he went off the deep end. Whatever had happened here, and something clearly had, it had a rational explanation. People don't just vanish and houses aren't cursed. There was a story here, and I intended to figure it out. As the night deepened, the silence of the house seemed to change character. During daylight, it had been merely unusual, the absence of normal sounds. Now, it felt heavy, pressing in from all sides. The house seemed to contract around me, the walls drawing closer. I told myself it was just an optical illusion caused by the limited light and my tired eyes. I tried to sleep, but kept jerking awake at imagined sounds. The wind picked up outside, making the old house creak and settle. Each noise had me sitting up, straining to identify its source. Eventually, I gave up and just lay there, watching shadows dance across the ceiling as the lantern flickered. My watch read just after midnight when I heard it. Footsteps. Not outside, not in my imagination, but directly overhead in the attic. Slow, deliberate steps crossing from one end to the other. I sat bolt upright, heart pounding. The steps were unmistakeable, the distinct sound of weight shifting on old floorboards. They moved steadily, paused, then continued back in the other direction. \"Hello?\" I called out, my voice cracking slightly. No response. Just those measured footsteps continuing their path. I grabbed my flashlight, clicked it on, and got to my feet. If someone was in the house, I needed to know. The rational part of my brain suggested it might be an animal, a raccoon or even a tanuki, the Japanese raccoon dogs I'd occasionally spotted in rural areas. But it sounded too heavy, too purposeful for an animal. I found the narrow staircase leading to the attic near the back of the house. The steps creaked under my weight as I climbed, the beam of my flashlight bouncing off the walls. The footsteps above had stopped. At the top of the stairs, I hesitated before pushing open the small door. The attic was pitch black, beyond the reach of my light. I stepped inside, sweeping the beam across the space. Empty. Just dust, cobwebs, and a few old boxes pushed against the far wall. No footprints in the thick dust except my own leading from the door. No sign anyone or anything had been moving around up here.... when I walked the length of the attic, checking behind the boxes, looking for any hiding spots or signs of entry. Nothing. The small window at the far end was intact and sealed shut with years of paint. The footsteps I'd heard had been clear and distinct, moving right across this space. But there was simply nowhere for anyone to hide and no evidence anyone had been here. \"You're losing it, Marshall,\" I whispered to myself, the words instantly swallowed by the dead air. I made my way back downstairs, feeling foolish but still unnerved. The camping lantern glowed exactly where I'd left it, casting long shadows across the room. As I stepped off the last stair, the air around me changed. The temperature dropped suddenly, not gradually as you'd expect when weather shifts, but all at once, as if I'd walked into a freezer. My breath clouded in front of my face. This made no sense. Outside, it was a humid summer night, probably still over 70 degrees. Yet inside, I could see my breath and feel the cold biting at my skin. A wind swept through the room, not from the covered window or any obvious source, but circling around me like a small cyclone. The camping lantern flickered wildly, then went out, plunging the room into darkness. What the hell? I fumbled with my flashlight which had switched off when I put it in my pocket. My fingers felt numb with cold as I found the switch and clicked it on. The beam cut through the darkness, illuminating the room in a narrow cone of light. I swung it toward the window where the cardboard covering still held in place, and there she was. Standing outside the covered window, visible somehow through the cardboard as if it were transparent, was a woman. She wore a white dress that hung limply on her thin frame. Long, black hair obscured her face completely, falling forward in wet-looking strands. She stood perfectly still, hands hanging at her sides. I froze. The flashlight beam fixed on her. She didn't move, didn't react to the light. I tried to speak but couldn't form words. My rational mind scrambled for explanations. A neighbor, a hiker lost in the woods, a trick of light and shadow, but none made sense. I blinked just once. She was gone. The space outside the window was empty, just darkness and the silhouettes of overgrown bushes. The cold remained, raising goosebumps on my arms, but the wind had stopped. The silence returned, deeper than before. I stood rooted to the spot, flashlight still pointed at the window, waiting for her to reappear. She didn't. After several minutes, I forced myself to move, crossing to the window on unsteady legs. I pulled back the cardboard just enough to look outside. Nothing. No footprints in the dirt below the window. No movement in the garden. No sound in the absolute stillness of the night. I replaced the cardboard and backed away from the window, keeping my light trained on it. The rational explanations I'd been clinging to seemed increasingly inadequate. I'd seen her clearly, a woman standing outside a second-story window with no way to get there, visible through a solid piece of cardboard, vanishing in an instant. I heard the footsteps at exactly 3:00 in the morning. I knew the time because I'd been staring at my watch every few minutes, unable to sleep after what I'd seen at the window. The sound was unmistakable, light and quick, the patter of small feet moving down the hallway toward the main room where I sat huddled in my sleeping bag. My hand tightened around the flashlight I'd been clutching for hours. The camping lantern still cast a weak glow across the room, but it wasn't enough to penetrate the darkness of the hallway where the footsteps originated. \"Hello?\" I called out, my voice breaking the silence like a stone through ice. The footsteps stopped. I pointed my flashlight toward the sound, the beam cutting through the darkness until it landed on a figure standing in the doorway. It was a child, a boy no older than seven. He wore a traditional Japanese yukata, faded and worn as if from another era. His hair was dark and cut in a simple bowl style that framed his small face. But his eyes, his eyes were what made my breath catch. They were completely hollow, dark pools that seemed to absorb the flashlight beam rather than reflect it. \"Hey there,\" I tried, my voice barely above a whisper. \"Are you lost? How did you get in here?\" The boy didn't respond. He just stared at me, unblinking and still. \"My name's Marshall,\" I said, slowly rising to my feet. \"I can help you find...\" The boy's mouth opened then, stretching wider than seemed humanly possible. His jaw extended in what should have been a scream, but no sound came out. Just a terrible, silent agony that seemed to vibrate through the air between us. His face contorted with an expression no child should ever wear. I stumbled backward, knocking over my water bottle. When I looked up again, the doorway was empty. The boy had vanished. \"Jesus,\" I muttered, heart hammering in my chest. I swept the flashlight beam across the room into every corner and shadow. Nothing. This was insane. First the woman at the window, now a child. I needed to get out of here.I grabbed my phone from beside the sleeping bag. Still no signal. I shoved it into my pocket and made for the front door, leaving my sleeping bag and most of my supplies behind. I could come back for them in the daylight if needed, but right now, I just needed to get to my car. I reached the front door and grabbed the handle, pulling it with more force than necessary. It didn't move. I tried again, yanking harder this time, but the door remained firmly shut as if it had been nailed in place. This made no sense. I checked it earlier. It wasn't locked. There wasn't even a deadbolt or chain. \"Come on,\" I growled, pulling with both hands now. The door wouldn't budge even a millimeter. I moved to the broken window I'd covered with cardboard. I tore away the makeshift repair and tried to push the remaining glass out of the frame to create an exit. The glass felt like concrete, immovable despite my efforts. I tried the other windows in the room with the same result. Each one refused to open as if they'd been sealed shut. Panic began to rise in my throat. I patted my pockets for my car keys, intending to use them to break a window if needed, but they were gone. I checked every pocket twice, then frantically searched the area around my sleeping bag. The keys had vanished from my pocket. My phone, I pulled it out again. Still no signal, but maybe I could use the flashlight app for better visibility. As I unlocked the screen, the battery percentage dropped from 48% to zero in seconds, and the phone went dark. \"This isn't happening,\" I said aloud, trying to steady myself with the sound of my own voice. \"This isn't real.\" But it felt real. The cold air against my skin, the solid resistance of the doors and windows, the absence of my keys, all of it felt terribly real. Something was keeping me trapped inside. A prickling sensation crawled up my spine. I turned slowly, directing my flashlight beam down the hallway. She was there. The woman from the window stood at the end of the hall, her white dress hanging limply around her thin frame. Her long, black hair still obscured her face, falling forward in tangled strands. She was completely still except for her mouth, which moved continuously as if she were speaking, though I couldn't hear a sound. I took an involuntary step backward as she began to move toward me. Her gait was wrong, jerky and uncoordinated, like a marionette controlled by an inexperienced puppeteer. Each step seemed disconnected from the last, her body moving in segments rather than as a whole. \"Stay back,\" I warned, though I knew it was pointless. Whatever this was, hallucination, ghost, or something else entirely, it wasn't going to respond to verbal commands. She continued her approach, each unnatural movement bringing her closer. I could see her fingers now, elongated and bent at odd angles. Her head tilted sharply to one side, hair parting just enough to reveal a slice of her face, skin stretched too tight over cheekbones, and a single visible eye that was completely black. I backed away, desperate to maintain distance between us. My heel caught on the overturned table I'd moved earlier, and I stumbled, nearly losing my balance. I regained my footing and continued retreating, knocking aside cushions and papers in my haste. My back hit the wall. I was cornered in the main room, the woman's jerky approach cutting off my path to any exit. The flashlight beam shook wildly in my trembling hand as she drew closer, her mouth still moving in that silent, terrible speech. I couldn't move. The woman stood less than three feet away, her face still hidden behind that curtain of black hair, her body bent at angles that defied human anatomy. My back pressed hard against the wall, the flashlight beam shaking across her white dress, which seemed to move without any breeze. Then she vanished. One moment she was there, the next, nothing. The space where she'd stood was empty. I didn't trust it. I kept the flashlight aimed at that spot, my breath coming in short gasps. The room temperature continued dropping until I could see my breath forming small clouds in the beam of light. I waited for her to reappear, for something to happen, but minutes passed in silence. Finally, I gathered enough courage to push away from the wall. I needed to find a way out. The front door and windows were sealed somehow, but there had to be another exit. I took one step forward, and the flashlight beam caught movement at the doorway. The boy stood there again, his hollow eyes fixed on me, mouth still closed. He raised one small hand and pointed down the hallway. \"What do you want?\" I asked, my voice cracking. His mouth opened in that impossible silent scream, the air around him seeming to vibrate. Then he turned and disappeared into the darkness. I stayed frozen in place, waiting. The silence pressed against my ears again, that unnatural quiet that seemed to swallow all sound. My watch read 3:32 in the morning, hours until sunrise. A soft scratching sound came from behind the wall to my right. It started low, then grew more insistent, like fingernails dragging across the other side of the plaster.I swung the flashlight toward it, watching in horror as the wall seemed to bulge slightly outward. I backed away, moving toward the center of the room. The scratching stopped. For the next hour, I stood in the middle of the room, turning in slow circles with my flashlight, jumping at every creak and groan of the old house. The temperature kept dropping until I was shivering violently, my teeth chattering. Frost began forming on the windows, creating delicate patterns that caught the flashlight beam and scattered it in crystalline reflections. At 4:27, the woman appeared again, this time at the far end of the room. She stood motionless, her head tilted at that impossible angle. The boy materialized beside her, his small hand reaching up to clutch the fabric of her dress. They remained there, watching me, for what felt like hours, but was probably only minutes. Then they both vanished simultaneously. This pattern continued throughout the night. Sometimes they appeared together, sometimes separately, materializing in different parts of the room or glimpsed at the end of the hallway. Each time, they never made a sound, but their presence filled me with a sense of dread so profound I could barely breathe. At one point, I found myself huddled in a corner, the flashlight clutched to my chest, my eyes darting from shadow to shadow. The frost had spread from the windows to the walls, creating a thin layer of ice that glittered in the flashlight beam. My fingers had gone numb from the cold, and my breath came out in thick, white clouds. I checked my watch constantly, counting down the minutes until dawn, 5:15, 5:46, 6:22. At 6:38, I noticed a subtle change. The darkness outside the windows had shifted from black to deep blue. The first hint of dawn was approaching. The woman appeared one final time, standing directly in front of me, closer than ever before. Her hair parted slightly, revealing just a glimpse of pale skin and a single wide-open eye. I pressed myself against the wall, unable to look away, unable to move. Then, as the first ray of sunlight broke through the frost-covered window, she disappeared. The temperature in the room began to rise immediately. The frost on the windows started to melt, water droplets running down the glass. I waited several minutes, not trusting the sudden absence of the apparitions. When nothing happened, I slowly made my way to the front door, expecting it to still be sealed shut. To my shock, the handle turned easily in my grip. The door slid open with no resistance at all. I didn't hesitate. I didn't stop to gather my sleeping bag or backpack or any of my belongings. I bolted through the door and ran to my car, fumbling with the keys I'd somehow found back in my pocket. The engine started on the first try. I reversed out of the clearing, tires spinning on the damp ground, and sped down the narrow dirt path toward the main road. My hands shook violently on the steering wheel as I navigated the winding mountain road, taking curves too fast, desperate to put as much distance as possible between myself and that house. I kept checking the rear-view mirror, half-expecting to see the woman and child standing in the middle of the road behind me. But there was nothing there, just the empty row disappearing around the curves. As I approached the bottom of the mountain, I saw flashing lights ahead. Police cars blocked the main road, officers in uniforms standing beside their vehicles. My first instinct was relief. Other people, normal people, authority figures who could help. I slowed the car as one of the officers stepped into the road and held up a hand. His uniform identified him as local Japanese police, and he wore a serious expression as he approached my window. \"Detective Nakamura,\" he said in accented English, showing me his badge. \"Please step out of the vehicle, sir.\" I complied, my legs still shaky as I stood on the pavement. The morning air was already warm with summer heat, making the freezing temperatures of the night seem impossible. \"We received reports from neighbors about strange lights and sounds from the Thompson property during the night,\" Nakamura said, studying my face carefully. \"May I ask what you were doing in that area?\" \"I was staying at my uncle's house,\" I said, my voice hoarse. \"Jeff Walker's place. I inherited it after he... After he disappeared.\" Nakamura's expression changed instantly, growing more serious. He exchanged a glance with another officer nearby. \"You stayed in that house overnight?\" he asked, his tone shifting from professional to concerned. I stared at the phone screen in Nakamura's hand, unable to process what I was seeing. The image showed a body, decomposed, discolored, barely recognizable as human, wedged into a tight space beneath wooden floorboards. But even in that state, I recognized the watch on the wrist, the same distinctive titanium band Uncle Jeff had always worn, the same one he'd shown me 15 years ago, telling me it would outlast him. He'd been right. \"Mr. Walker?\" Nakamura's voice seemed to come from somewhere far away. \"Do you need to sit down?\" I couldn't take my eyes off the phone. \"That's... That's him. That's Jeff.\" \"We found him this morning after receiving an anonymous tip,\" Nakamura explained, mercifully lowering the phone.\"Based on the decomposition, our medical examiner estimates he's been dead approximately three months.\" Three months? My mind flashed to the letter in my pocket, the one I'd found in the kitchen. The date on it matched almost exactly. \"The floorboards,\" I said, my voice hollow. \"He was under the floorboards? In the main room?\" Nakamura nodded gravely. \"Yes, directly beneath where you set up your sleeping bag.\" A wave of nausea hit me so hard I had to bend forward, hands on my knees. I'd spent the night lying directly above my uncle's corpse while those things had appeared and disappeared around me, while the temperature had dropped and frost had formed on the windows, while I'd felt that crushing sense of dread. \"I need to see,\" I managed to say once the nausea passed. \"Mr. Walker, I strongly advise against-\" \"I need to see,\" I repeated, straightening up. \"Please.\" Nakamura studied my face for a long moment before nodding. \"Follow me, but stay behind the tape. This is an active crime scene.\" We drove back up the mountain road in Nakamura's police car, neither of us speaking. The forest that had seemed so ominous last night looked ordinary in the morning light, just trees and underbrush and the occasional bird darting across the road. When we reached the narrow dirt path, Nakamura pulled over. \"We walk from here,\" he said. \"The forensics team has vehicles up there already.\" The path looked different in daylight. Less threatening, more neglected, just an overgrown trail leading to an old house. But with each step closer, my chest tightened more. The clearing came into view, and I stopped cold. The house looked exactly as I'd left it, but the surrounding area had transformed into a hub of activity. Three police vehicles were parked haphazardly in the clearing. Yellow crime scene tape circled the entire property. Men and women in uniforms and plainclothes moved purposefully around the grounds, taking photographs, collecting samples, talking in low voices. \"Come,\" Nakamura said, lifting the tape for me to duck under. We approached the house, and I noticed the front door standing wide open, the same door that had refused to budge last night until sunrise. Inside, the main room was crawling with people in white protective suits. They had pulled up several tatami mats in the center of the room, exposing the wooden structure beneath. A large, roughly person-sized section of floorboards had been removed entirely, revealing a dark cavity below. I stopped at the threshold, unable to make myself step inside. The memory of the night before was too fresh. The woman with her impossibly angled head, the boy with his silent scream, the bone-deep cold that had seemed to come from nowhere. \"That's where we found him,\" Nakamura said, pointing to the cavity. \"Someone cut through the support beams to create a space, then sealed him in. Very deliberate.\" \"How did you know to look there?\" I asked, my voice barely audible. \"The anonymous tip was specific. Caller said to check under the floorboards in the main room.\" I wanted to ask more, but at that moment, a commotion broke out on the far side of the room. Several officers were gathered around the wall where I'd seen the woman standing last night. One of them called out something in Japanese, and Nakamura responded sharply, moving quickly to join them. I remained frozen in the doorway, watching as they began examining the wall with greater intensity. One officer brought over what looked like some kind of scanning equipment, running it slowly across the surface. After a few minutes of discussion, Nakamura returned to where I stood. \"There appears to be a cavity in the wall as well,\" he said. \"We're going to open it up.\" I nodded numbly, not trusting myself to speak. Part of me wanted to run back down the mountain and never look back, but a stronger part kept me rooted to the spot, needing to see this through. For the next hour, I watched from the doorway as the investigation unfolded. The forensics team worked methodically, photographing everything before making a single change. They brought in specialized tools and began carefully removing sections of the wall where the scanner had indicated the cavity. The work was painstaking with frequent pauses for documentation. When they finally broke through, a collective hush fell over the room. One of the officers stepped back quickly, covering his mouth and nose. Even from the doorway, I caught a whiff of the sickly sweet odor of advanced decomposition. Nakamura moved forward, peering into the opening they'd created. His face, usually composed, visibly paled. He said something to the team in Japanese, then stepped back to allow them to continue their work. He returned to where I stood. \"Mr. Walker, I think you should wait outside.\" \"What is it?\" I asked, though I already knew. I'd seen her last night standing in that exact spot, her white dress billowing without wind. Nakamura hesitated. \"There appears to be another body. A woman.\" Even expecting it, the confirmation hit me like a physical blow. I nodded and backed away from the door, grateful for the excuse to leave. Outside, I sat on a large rock at the edge of the clearing, watching the activity around the house from a distance. Police photographers documented the exterior. Officers searched the overgrown garden, looking for evidence.... a drone buzzed overhead, mapping the property. Time passed in a strange disconnected way. The sun climbed higher. More vehicles arrived. At some point, someone handed me a bottle of water, which I accepted without drinking. Then, in the early afternoon, the activity around the house intensified. I watched as two officers emerged carrying a black body bag on a stretcher. Uncle Jeff, I presumed. They loaded it carefully into a waiting vehicle. Shortly after, they brought out a second stretcher with another body bag. This one, they handled with extra care as if the contents were more fragile. I knew without being told that it contained the woman from the wall, the woman in the white dress who had tormented me throughout the night. As they loaded the second body into the vehicle, Nakamura approached me again. \"Mr. Walker, we'll need to take a formal statement from you back at the station. But first, I thought you should know what we've found.\" I looked up at him, waiting. \"The second body appears to have been there much longer than your uncle's. Decades possibly. She was wearing what remains of a white dress. Based on preliminary examination, she may have been sealed into the wall while still alive.\" I felt the blood drain from my face. \"Still alive?\" Nakamura nodded grimly. \"The position of the body suggests she may have been trying to claw her way out. There were scratch marks on the inside of the wall.\" The image of her face behind the curtain of black hair, mouth moving silently, flashed in my mind. I swallowed hard. \"Do you know who she is?\" I asked. \"We have a theory. 20 years ago, a local woman named Denise McLaughlin disappeared without a trace. She was 25 at the time, the right age and build for our victim. We'll confirm with dental records.\" 20 years, long before Uncle Jeff had moved to Japan, long before he'd bought this house. \"What about the boy?\" I asked before I could stop myself. Nakamura frowned. \"What boy?\" I hesitated, then shook my head. \"Nothing. Just something from the letter Jeff left me.\" The detective didn't push, but I could tell he'd filed the comment away for later. \"We should go to the station now. I'll have someone drive your rental car down.\" The rest of the day passed in a blur of formal statements and paperwork. I described finding the house, discovering the signs of struggle, reading Jeff's letter, and my decision to stay overnight. I left out the supernatural elements, the apparitions, the impossible cold, the doors that wouldn't open until sunrise. I wasn't ready to be looked at like I was crazy, not on top of everything else. Late in the afternoon, Nakamura called me into his office. He looked tired. The lines around his eyes deeper than they'd been that morning. \"We've confirmed the woman's identity through dental records,\" he said without preamble. \"It is indeed Denise McLaughlin who disappeared 20 years ago.\" I nodded, not surprised. \"What's interesting,\" Nakamura continued. \"Is the timing. Your uncle purchased that house five months after Denise's disappearance.\" I frowned. \"You think he knew something about her death?\" \"It's possible. Or perhaps he discovered her remains after moving in and was killed by whoever put her there.\" Nakamura tapped a pen against his desk. \"Did your uncle ever mention this woman to you?\" \"No, but we hadn't spoken in 15 years.\" \"I see.\" Nakamura set the pen down. \"There's something else you should know, Mr. Walker. That property has a history.\" I waited, a chill creeping up my spine despite the warm office. \"Local residents have long believed it to be cursed. The house was built in the 1950s by an American family named Thompson. Since then, several owners have met violent ends or simply disappeared. Your uncle is not the first.\" \"And no one thought to mention this when he was buying the place?\" I asked, anger flaring briefly through the numbness. Nakamura shrugged slightly. \"Rural superstitions are not typically disclosed in real estate transactions. And the house had stood empty for nearly a decade before your uncle purchased it.\" I rubbed my face with both hands, suddenly exhausted. \"What happens now?\" \"We continue our investigation. We'll need to determine if your uncle's death is connected to Denise McLaughlin's murder or if they are separate crimes separated by 20 years.\" \"And the house?\" \"It remains a crime scene for now. Eventually, as the legal owner, you'll need to decide what to do with it.\" I knew already what I would do. Bulldoze it to the ground. Salt the earth. Never set foot on that property again. Nakamura seemed to read my thoughts. \"Many locals would not be sad to see it gone,\" he said quietly. I left the police station as the sun was setting with a promise to remain in Japan until the investigation progressed further. The hotel Nakamura recommended was clean and anonymous, with a view of nothing in particular. I sat on the edge of the bed, staring at my hands, trying to make sense of everything. My uncle had been murdered, his body hidden beneath the floorboards where I'd slept. A woman had been sealed alive inside the walls of the same house 20 years earlier. The property was considered cursed by locals, with a history of disappearances and violent deaths. And I had spent the night there, haunted by the ghosts of both victims.... I learned that Detective Nakamura believed Jeff had found Denise's body and been killed by whoever murdered her in the first place. We sat in his office at the small police station in town. The overhead fluorescent lights making his tired face look even more drawn. \"Your uncle likely discovered something he wasn't supposed to,\" Nakamura explained, sliding a folder across his desk. \"The construction work to seal Ms. McLaughlin in that wall was professional. Someone knew what they were doing.\" I flipped through the crime scene photos, my stomach turning at the images of the broken wall and what remained inside it. \"But you don't know who did it?\" \"No physical evidence pointing to a specific suspect. The original crime happened 20 years ago, and your uncle's murder three months ago used his own kitchen knife. Very clean work.\" He paused. \"We'll continue investigating, but you should know these cold cases rarely-\" \"Get solved,\" I finished for him. \"I understand.\" What I didn't tell him was how I'd spent the entire day jumping at every noise, checking corners, and feeling like someone, something was watching me. I didn't mention how the image of that woman's face hidden behind her hair kept flashing in my mind, or how I could still hear the silence of the boy's impossible scream. That evening, I booked the earliest flight I could find back to the United States. The airline's website showed a red-eye leaving Tokyo the next night. I clicked purchase without hesitation. The confirmation page bringing the first moment of relief I'd felt since driving up that mountain road. My Tokyo apartment felt both familiar and strange as I packed my belongings. I'd been living here for three years but now the space felt contaminated somehow, as if the horror from that house had followed me here. I moved methodically through my rooms, sorting what to take and what to leave, trying to focus on the mundane task instead of the memories. A door creaked behind me and I whirled around, heart racing. Nothing there. Just the air conditioning shifting the pressure in the apartment. \"Get it together,\" I muttered to myself, shoving shirts into my suitcase. But I couldn't shake the feeling that I wasn't alone. The hollow dead-eyed stare of the woman in white kept appearing in my mind. The way her head had tilted at that impossible angle, her hair hanging down like a curtain, her mouth forming words I couldn't hear. And the boy, that silent scream that somehow filled the room with dread without making a sound. I dropped a stack of books I was packing when my phone buzzed. The sound was so ordinary, yet I nearly jumped out of my skin. A text from my boss asking about a project deadline. Normal life continuing while mine had been shattered. Every shadow in my apartment seemed to hide watching eyes. The darkness in the corners of my bedroom looked deeper than usual. When the refrigerator cycled on, the sudden hum made me drop the glass I was drinking from, shattering it across the kitchen floor. \"Shit,\" I whispered, carefully picking up the larger pieces. A movement caught my eye, just my reflection in the window. But for a split second, I thought I saw long, black hair framing a pale face behind me. I spun around, breathing hard, but found only my empty living room. I didn't sleep that night. I sat with my back against the wall, lights on, waiting for morning. By the time my taxi arrived to take me to the airport, my eyes were burning from exhaustion, but I felt safer in daylight. The airport was crowded with travelers. The noise and movement a welcome distraction from my thoughts. I kept checking over my shoulder, certain I would see the woman or the boy standing motionless among the hurrying passengers. But there was nothing. Just normal people going about their lives, completely unaware of what I had experienced. On the plane, I took my window seat and pressed my forehead against the cool glass, watching ground crew scurry around with luggage. The rational part of my brain, the engineering part that had always served me well, tried to make sense of what had happened. Stress, suggestion from Jeff's letter, the power of fear working on an exhausted mind. I tried to convince myself that I had hallucinated the entire night, that finding out I'd slept above my uncle's corpse had created a psychological break. But the physical evidence contradicted this comfortable explanation. The frost on the windows in summer, the doors and windows that wouldn't open, then suddenly did. My car keys disappearing and reappearing. And most damning of all, I had seen the woman in white before finding out about Denise's body in the wall. I had seen her white dress with dark stains that matched the tatami mats before knowing she existed. The flight attendant offered me a drink, and I accepted, hoping alcohol might dull the edges of my memory. It didn't. For 14 hours, I sat rigid in my seat, replaying every moment of that night. I had slept directly above my uncle's corpse in a house where a young woman had been murdered and sealed inside the walls. The supernatural encounters I experienced felt more real, more visceral than any dream or hallucination could possibly be. By the time we landed in the United States, I had made my decision. I would move to a different city, change jobs, start fresh. I had enough savings to make it work. Distance, physical, geographical distance might be the only way to escape the memories of what happened in that house.As I waited for my luggage at the carousel, I pulled out my phone and began searching for apartments in cities I'd never visited before. Places with no connection to my past life or to Japan, places where no one knew me or my family history. Places where I might eventually stop looking over my shoulder for a woman in white and a boy with a silent scream. I needed to leave behind the horrors I had witnessed. Whether that was even possible, I didn't know, but I had to try. Six months had passed since I fled Japan, but the nightmare followed me like a shadow. I'd done everything possible to rebuild my life, moved to Seattle, accepted a senior engineering position at a tech startup, found an apartment with big windows and good light, yet peace remained elusive. I sat at my desk in the new office, staring at spreadsheets that blurred before my eyes. The open floor plan buzzed with the energy of my colleagues, but I felt disconnected from it all. My hands trembled slightly as I reached for my coffee mug, a tremor that had become a permanent fixture since that night. \"Marshall, you with us?\" My new boss, Elaine, was looking at me expectantly from across the conference table. \"Sorry,\" I mumbled, straightening in my chair. \"Just working through some calculations in my head.\" She nodded, seemingly satisfied, and returned to discussing quarterly projections. I forced myself to focus, jotting down notes I'd likely never review. The meeting dragged on for another 40 minutes before we were finally released back to our desks. Back at my workstation, I opened my desk drawer and stared at the bottle of prescription sleep aids. The label had my name printed neatly across it, a recent addition to my daily routine. The dreams came almost nightly. Vivid recreations of those hours trapped in Uncle Jeff's house. Sometimes in the dreams, I never escaped. Other times, I found myself sealed inside the wall alongside Denise, watching new inhabitants through cracks in the plaster with my head bent at an impossible angle. I'd wake gasping for air, drenched in sweat, the bone-deep cold lingering even in my climate-controlled bedroom. The pills helped somewhat, dulling the dreams to foggy impressions rather than high definition horrors. My phone buzzed with a text from my landlord about a maintenance issue. Normal life. I tried to embrace these mundane moments to anchor myself in the ordinary. I'd chosen Seattle specifically because it was nothing like rural Japan, a modern American city full of light and noise and people. No silence here, no isolation. Yet even surrounded by coworkers and neighbors, I never felt truly safe. The first time I saw her after leaving Japan was three weeks into my new job. I was working late, alone in the office bathroom. I bent over the sink to splash water on my tired face, and when I straightened, she was there in the mirror behind me, the woman in white, her face hidden behind that curtain of black hair, head tilted at that sickening angle. I spun around with a strangled cry, but the bathroom was empty. When I looked back at the mirror, only my pale, terrified face stared back. I told myself it was stress, lack of sleep, my mind playing tricks. But it happened again two weeks later at my apartment. Catching her reflection in my bedroom window as I closed the blinds at dusk. Then again in the rear-view mirror of my car, always when I was alone, always gone when I turned to look, always watching. The boy appeared less frequently, but his visits were no less terrifying. A small figure glimpsed at the end of a hallway, standing motionless in a grocery store aisle, or sitting cross-legged in the corner of my bedroom in the darkest hours of night. I never told anyone. What would I say? That I was being haunted by the ghosts of a woman and child from a house in Japan? That I'd slept above my murdered uncle's corpse while supernatural entities tormented me through the night? I'd be referred to psychiatric care faster than I could finish the story. Instead, I suffered in silence, jumping at shadows and avoiding mirrors when possible. One rainy afternoon, I gathered everything related to the inheritance, the original documents Levi Ferguson had sent, the keys to the property, Jeff's letter with its warnings, and burned them in a metal trash can on my small balcony. I watched the flames consume the paper, turning Jeff's cramped handwriting to ash, hoping some symbolic closure might help. It didn't. I never set foot in Japan again. My former employer had been understanding about my sudden departure, chalking it up to family trauma, and I'd arranged for a shipping company to pack and send my belongings from my Tokyo apartment. The thought of returning, even to a different city, made me physically ill. Three months after I left, I found a news article online about the house. Local authorities in Gifu Prefecture had demolished it following the conclusion of the murder investigation. The article mentioned the property's troubled history and local superstitions, but provided no details about previous owners or other deaths. The comments section was filled with locals expressing relief that the cursed house was finally gone. I should've felt relieved too. Instead, I wondered if destroying the physical structure had released whatever was trapped there, set it free to follow me more easily across the ocean.On my bedside table sat a framed photo of my parents, taken years before their deaths. I often found myself studying their faces, wondering if they had known about our family's connection to the house. Had Uncle Jeff known what he was buying when he purchased the property 18 years ago? Was there some dark family secret that had drawn him there as his letter suggested? These questions would likely never be answered now that Jeff was gone. I tried to move forward. I joined a local hiking group, hoping the physical exertion and company would help clear my mind. I went on a few dates with a woman from the marketing department, though I ended things when I realized I couldn't bring myself to let her stay overnight. How could I explain waking up screaming, or worse, what if she saw what I sometimes saw in the darkest hours? Tonight, like most nights, I sat alone in my apartment with all the lights on, television playing in the background to fill the silence. I developed rituals to get through each day, checking behind doors, avoiding reflective surfaces when alone, keeping lights on, never staying in empty buildings after dark. I often wondered if I had truly escaped the curse or if I had merely carried it with me across the ocean. Had Uncle Jeff felt the same way? Had he tried to run too before whatever force in that house finally caught up with him? The rational part of my mind, the engineer who believed in physics and tangible reality, tried to explain away my experiences as trauma response, as PTSD from discovering my uncle's murder. But that explanation fell apart when I remembered the frost patterns that disappeared between blinks, the doors that wouldn't open until dawn, the car keys that vanished and reappeared. I looked over my shoulder constantly now, a habit that had become so ingrained, my coworkers joked about it. \"Marshall's always watching his back,\" they'd say, unaware of how literally true that was. Would the woman and child ever release me from their ghostly grip? Or would they shadow me for the remainder of my days, waiting for a moment of vulnerability for that one night I might forget to leave the lights on? I didn't know. All I knew was that I had survived an encounter that had claimed my uncle's life. Perhaps that was victory enough. Perhaps one day, the memories would fade, the apparitions would find someone else to haunt, and I would finally sleep through the night without pharmaceutical help. But as I sat there in my brightly lit living room, watching the rain streak down my windows and deliberately avoiding looking at my own reflection in the glass, I doubted it."
}